<template>
  <div class="agreement-wrap">
    <h1>平台入驻协议</h1>
    <section>
      <p class="weight-style">为使用觅特App提供的服务（以下简称“本服务”），您应当阅读并遵守《平台入驻协议》（以下简称“本协议”）
        呼伦贝尔市觅特网络科技有限公司在此特别提醒您认真阅读、充分理解本协议各条款，特别是其中所涉及的免除、减轻呼伦贝尔市觅特网络科技有限公司责任的条款、对您的权利限制条款、争议解决和法律适用条款等。其中，限制、免责条款可能以黑体加粗或下划线等形式提示您重点注意。请您审慎阅读并选择接受或不接受本协议。除非您接受本协议所有条款，否则您无权使用觅特App于本协议项下所提供的本服务。您一经注册或使用本服务即视为对本协议所有条款的理解和接受。
        您有违反本协议的任何行为时，呼伦贝尔市觅特网络科技有限公司有权依照违反情况，随时单方限制、中止或终止向您提供本服务，并有权追究您的相关责任。
        如果您未满18周岁，请在法定监护人的陪同下阅读本协议。</p>
    </section>
    <section>
      <p>有鉴于此，为保证觅特App（以下简称“平台”）健康发展，保护双方的合法权益，双方本着自愿合作的原则达成如下协议：</p>
    </section>
    <section>
      <h2>第一条 总则</h2>
      <p>1、呼伦贝尔市觅特网络科技有限公司基于平台为您提供相应的平台技术服务。</p>
      <p>2、您入驻觅特App作为主播，长期在平台从事网络主播活动服务。网络主播活动，即利用平台从事包括但不限于聊天、cos表演、唱歌、跳舞、游戏等服务。</p>
      <p class="weight-style">注册成为觅特App主播前，您应当且已经充分了解有关平台之各项规则及要求，并确认您有条件与能力履行相应的职责与义务。您应根据觅特App要求注册成为觅特App主播前，您应当且已经充分了解有关平台之各项规则及要求，并确认您有条件与能力履行相应的职责与义务。您应根据觅特App要求</p>
      <p>4、您仅可在本协议约定的范围内使用通过觅特App审核后开通的直播间，不可将该直播间以任何形式（包括但不限于转让、出租、借用等方式）提供给第三人，或允许第三人使用该直播间。</p>
      <p>5、 您承诺并声明您在使用平台时将遵守中华人民共和国及呼伦贝尔市觅特网络科技有限公司所在地法律法规的相关规定以及平台之各项规则及要求，不得从事任何违反中华人民共和国及呼伦贝尔市觅特网络科技有限公司所在地的法律法规规定以及平台之各项规则及要求的行为。</p>
      <p>6、本注册行为，不代表您与呼伦贝尔市觅特网络科技有限公司之间构成任何劳动法律层面的劳动、雇佣、劳务关系。</p>
    </section>
    <section>
      <h2>第二条 呼伦贝尔市觅特网络科技有限公司的权利义务</h2>
      <p>1、呼伦贝尔市觅特网络科技有限公司有权制定平台的运营制度及对主播的管理规则等各项规则及要求，并有权对您进行管理和监督，且根据运营情况对平台做出调整或变更（包括但不限于停止运营平台等）</p>
      <p>2、呼伦贝尔市觅特网络科技有限公司有权独立对您进行考察、评审，以决定是否确立或取消对您的奖励或处罚。</p>
      <p>3、呼伦贝尔市觅特网络科技有限公司有权对您履行在本协议项下义务的行为提出改进建议和意见，并对您网络主播活动的方式和内容有最终决定权，您应严格按照呼伦贝尔市觅特网络科技有限公司的建议和意见提供或调整相关服务</p>
      <p>4、您确认并同意，呼伦贝尔市觅特网络科技有限公司独立拥有您在平台直播节目时所产生的著作权、著作邻接权以及其他相关合法权益，呼伦贝尔市觅特网络科技有限公司在行使该等权益（包括但不限于授权他人使用该等著作权及著作邻接权以及其他相关合法权益等）时，无需取得您和/或任何第三方的同意。呼伦贝尔市觅特网络科技有限公司有权自行或授权任何第三方以任何形式对前述直播进行使用。您应确保呼伦贝尔市觅特网络科技有限公司或呼伦贝尔市觅特网络科技有限公司授权的第三方对前述直播的使用不会侵犯任何第三方的合法权益（包括但不限于版权、表演者权、肖像权等），也无需向任何第三方支付任何费用，否则因此造成呼伦贝尔市觅特网络科技有限公司或呼伦贝尔市觅特网络科技有限公司授权的第三方损失的，您应予以赔偿。您同意并保证放弃对呼伦贝尔市觅特网络科技有限公司及呼伦贝尔市觅特网络科技有限公司授权的第三方主张表演者权等其他权益，否则，您属于违约。
        对于以任何方式侵犯上述直播的著作权、著作邻接权以及其他合法权益的行为，呼伦贝尔市觅特网络科技有限公司有权以自身名义进行维权（包括但不限于采取申请证据保全、财产保全、行政投诉、提起民事诉讼、上诉、申请执行、和解、获得赔偿金等权利）。</p>
      <p>5、呼伦贝尔市觅特网络科技有限公司负责提供平台的技术服务支持，可以帮助您提升知名度和收益，提供最大化的宣传力度。</p>
      <p>6、呼伦贝尔市觅特网络科技有限公司有权根据业务需求，单方调整您的分成模式、分成比例与结算方式，调整后的政策以觅特App通知为准；前述政策及其调整内容一经通知即对您产生效力，您应当予以遵守。</p>
      <p>呼伦贝尔市觅特网络科技有限公司有权根据运营情况对平台协议、各项规则及要求等进行修改。相关协议、规则及要求经修改后，如果您继续使用本服务，呼伦贝尔市觅特网络科技有限公司有权根据运营情况对平台协议、各项规则及要求等进行修改。相关协议、规则及要求经修改后，如果您继续使用本服务，</p>
      <p>8、呼伦贝尔市觅特网络科技有限公司有权要求您在网络主播活动中增加合理的直接或植入性广告或产品、活动推广。</p>
    </section>
    <section>
      <h2>第三条 您的权利义务</h2>
      <p>1、您须年满18 周岁（未成年人须经法定监护人同意并共同确认同意接受本协议），具有完全的民事行为能力。若您不具备前述资格，则您的法定监护人应承担因此而导致的一切后果，且觅特App有权注销或永久冻结您的帐号，并单方终止本协议。您应承担因此导致的相关损失（包括但不限于已产生的收益等）；若因此给呼伦贝尔市觅特网络科技有限公司造成损失的，您及其法定监护人应当赔偿呼伦贝尔市觅特网络科技有限公司损失。</p>
      <p>2、觅特App网络主播活动的形式包括但不限于聊天、cos表演、唱歌、跳舞、游戏等与演艺有关和/或与公众形象有关的任何线上活动，您开展上述主播活动均需要征求呼伦贝尔市觅特网络科技有限公司同意。</p>
      <p>3、您同意并授权呼伦贝尔市觅特网络科技有限公司及其关联公司，在您注销觅特App账号后，于平台之产品内置、包装、线上线下演出及广告和宣传品等宣传推广渠道和活动上，使用您的肖像、姓名（包括艺名）、录音、录像、视频以及您创作的音乐等相关作品（包括但不限于词曲以及录音制品等）。</p>
      <p>4、 以您完全履行本协议为前提，您将优先获得呼伦贝尔市觅特网络科技有限公司的推荐资源以及网络主播活动所需的技术支持，并有机会参与平台官方大型线上与线下活动；您有责任按照呼伦贝尔市觅特网络科技有限公司的要求参与并完成各项活动和工作，并将此作为第一优先级安排，包括但不限于线上与线下的演出活动等，否则呼伦贝尔市觅特网络科技有限公司有权视具体情况将您拒绝协助参与上述活动的行为视为违反呼伦贝尔市觅特网络科技有限公司相关管理规范，并给于相关处罚以致解除本合同。</p>
      <p>5、您应自行承担通过平台开展网络主播活动所需的所有视频和语音设备及其他设施，并保证视频图像清晰，语音质量清晰。</p>
      <p>6、您承诺直播间仅可用作本协议约定之网络主播活动用途，不得将其用于其他任何性质的活动（包括但不限于不可提供广告、推介等服务，或从事任何违法行为）。未经呼伦贝尔市觅特网络科技有限公司书面同意，在运营过程中不得以任何形式引导或变相引导平台用户进入其他同类平台。</p>
      <p>7、您承诺，您通过平台实施的行为或提供的服务合法、不侵犯第三人的任何权利（包括但不限于著作权等）；您承诺与呼伦贝尔市觅特网络科技有限公司开展本协议约定之合作的行为不会违反与任何第三人的约定也不会侵犯任何第三方的合法权益；您承诺将严格遵守平台的各项运营制度和管理规则，不得使用平台从事涉黄、反动等任何违法违纪的活动；不得以网络主播活动为幌子，从事暴力、传销、推销、鼓动诱导性营销等活动。</p>
      <p>8、您应为自身树立正面形象（包括但不仅限于妆容、服饰与言行等），不得出现任何因吸毒、婚外恋、盗窃、嫖娼、赌博等违反公共秩序、法律法规以及其他影响您公众形象的行为；不得从事任何损害呼伦贝尔市觅特网络科技有限公司及其关联公司及平台产品和品牌形象的行为。</p>
    </section>
    <section>
      <h2>第四条 您的报酬及支付</h2>
      <p>1、平台用户可以购买平台的虚拟礼物，并赠送给其选择的主播。就平台用户为向您赠送虚拟礼物而产生的消费，呼伦贝尔市觅特网络科技有限公司可按一定比例给您分成，具体规则如下：
        由<strong class="weight-style">觅特App</strong>将您收到的虚拟礼物总值（虚拟币）折算成人民币后，按人民币价格的一定比例作为您的分成（具体比例以<strong class="weight-style">觅特App</strong>系统后台规则为准）。若您属于与呼伦贝尔市觅特网络科技有限公司合作的第三方经纪公司所派驻的主播，则觅特App会在扣除该第三方经纪公司的经纪费用之后，将剩余收益按照一定比例作为您的分成结算（具体比例以觅特App系统后台规则为准）。</p>
      <p class="line-style">2、您所获得的报酬应当缴纳的税金由呼伦贝尔市觅特网络科技有限公司或呼伦贝尔市觅特网络科技有限公司委托或指定的第三方根据国家相关法律法规代扣代缴。</p>
      <p>3、您保证您提供的账户信息正确、真实、有效，如因账户信息不准确造成觅特App的任何支付错误的，由您独自承担责任。同时，若您需要变更帐户信息的，需在变更前提前10个工作日书面通知觅特App并经觅特App审核，新账户信息自您提交申请且经觅特App审核通过后下一个结算月生效。</p>
      <p class="weight-style">4、您知晓并同意，经呼伦贝尔市觅特网络科技有限公司书面通知您后，呼伦贝尔市觅特网络科技有限公司有权从您应得的报酬中直接扣除您应向呼伦贝尔市觅特网络科技有限公司支付的赔偿金、违约金、政府部门罚款以及应向用户支付的补偿金、赔偿金等款项.</p>
    </section>
    <section>
      <h2>第五条 保密制度</h2>
      <p>1、您应严格遵守呼伦贝尔市觅特网络科技有限公司的保密制度，承诺无限期保守呼伦贝尔市觅特网络科技有限公司的商业秘密。商业秘密是指由呼伦贝尔市觅特网络科技有限公司提供的、或者您在双方合作期间了解到的、或者呼伦贝尔市觅特网络科技有限公司对其他方承担保密义务的，与呼伦贝尔市觅特网络科技有限公司业务有关的，能为呼伦贝尔市觅特网络科技有限公司带来经济利益，具有实用性的、非公知的所有信息，包括但不限于：技术信息、经营信息、呼伦贝尔市觅特网络科技有限公司相关活动和与呼伦贝尔市觅特网络科技有限公司运营或管理有关的信息和文件（含本协议及相关协议内容）。</p>
      <p>2、您应严格遵守本协议，未经呼伦贝尔市觅特网络科技有限公司书面授权或同意，对呼伦贝尔市觅特网络科技有限公司的商业秘密不得：</p>
      <p>（１） 以任何方式向第三方进行传播、泄露；</p>
      <p>（２） 为非本协议的目的而使用呼伦贝尔市觅特网络科技有限公司的商业秘密。</p>
    </section>
    <section>
      <h2>第六条 协议的变更、解除、终止</h2>
      <p>1、因本协议所依据的法律、行政法规、规章或政策发生变化，致使本协议无法继续履行或继续履行有风险的，呼伦贝尔市觅特网络科技有限公司有权单方面终止本协议而无需承担任何法律责任。</p>
      <p>2、您有下列情形之一，呼伦贝尔市觅特网络科技有限公司可以立即解除本协议，不需要提前通知：</p>
      <p>（1）您违反在本协议项下所做的声明或承诺的；</p>
      <p>（2）因您原因直接或间接给呼伦贝尔市觅特网络科技有限公司、觅特App利益造成损害的；</p>
      <p>（3）违反国家法律法规的；</p>
      <p>（4）违反本协议规定的其它义务。</p>
      <p>3、您主动注销觅特App账号，单方面终止本协议的。</p>
      <p>4、无论本协议因为何原因终止的，对于您平台帐号中的全部数据或您因使用平台而存储在觅特App服务器中的数据等任何信息，呼伦贝尔市觅特网络科技有限公司可将该等信息保留或删除，包括服务终止前您尚未完成的任何数据。</p>
      <p>5、不论本协议因为何原因终止的，您应自行处理好关于数据等信息的备份等事项，由此造成呼伦贝尔市觅特网络科技有限公司损失的，您应负责赔偿。</p>
    </section>
    <section>
      <h2>第八条 违约责任</h2>
      <p>1、除本协议另有规定外，如因您的任何不实陈述或保证，或因您违反本协议项下的义务，或因您对第三方的侵权行为或违约行为，导致呼伦贝尔市觅特网络科技有限公司或觅特App面临任何索赔、诉讼或仲裁等要求，或导致呼伦贝尔市觅特网络科技有限公司或觅特App遭受损失，您应当采取适当的措施（包括但不限于与该第三方协调解决纠纷），保证呼伦贝尔市觅特网络科技有限公司或觅特App免受任何索赔、诉讼或仲裁等要求的任何影响和（或）呼伦贝尔市觅特网络科技有限公司或觅特App所受的损失。在该等情形下，呼伦贝尔市觅特网络科技有限公司或觅特App就其因此所受损失保留向您索赔的权利。特别地，呼伦贝尔市觅特网络科技有限公司或觅特App有权视您违约情节的严重程度采取下列某一项或者某几项措施追究您的违约责任：</p>
      <p>（1）暂时地封停您的平台账号，使您无法通过该账号登录平台，直至您纠正其违约行为时再恢复；</p>
      <p>（2）永久性地封停您的平台账号，使您无法通过该账号登录平台；</p>
      <p>（3）将您的平台账号永久性地删除；</p>
      <p>（4）拒绝您再次注册平台账号；</p>
      <p>（5）暂时中止您报酬的结算和支付，直至您纠正其违约行为时再进行结算和支付；</p>
      <p>（6）将尚未支付给您的报酬作为支付给呼伦贝尔市觅特网络科技有限公司的违约金，不再支付给您；</p>
      <p>（7）要求您于收到呼伦贝尔市觅特网络科技有限公司书面通知之日起5个工作日内，向呼伦贝尔市觅特网络科技有限公司支付金额相当于您已经获得的报酬总金额50%～100%的违约金（具体比例由呼伦贝尔市觅特网络科技有限公司届时依据您违约行为的严重程度单方面确定），如果上述违约金金额仍不足以补偿呼伦贝尔市觅特网络科技有限公司或觅特App损失的，呼伦贝尔市觅特网络科技有限公司还可以要求您另行给予相应的赔偿；</p>
      <p>2、您如违反本协议第三条第2、6、7、8的规定，觅特App有权单方面扣除您应得的部分或全部报酬，情节严重的，呼伦贝尔市觅特网络科技有限公司有权单方面解除本协议，如因此对呼伦贝尔市觅特网络科技有限公司或觅特App造成的损失，您应承担全部责任。</p>
      <p>3、如果您的违约行为遭到媒体曝光，导致呼伦贝尔市觅特网络科技有限公司或觅特App遭受相应的公关危机的，呼伦贝尔市觅特网络科技有限公司还可以要求您发表书面声明，澄清事实并向用户和/或呼伦贝尔市觅特网络科技有限公司道歉。您如果拒绝的，呼伦贝尔市觅特网络科技有限公司或觅特App可以您的名义发表上述内容的书面声明，并将其登载在平台和/或其他合适的媒介上。</p>
    </section>
    <section>
      <h2>第九条 关于通知</h2>
      <p>1、呼伦贝尔市觅特网络科技有限公司觅特App可能会以网页公告、网页提示、电子邮箱、手机短信、常规的信件传送、您注册的平台账户的管理系统内发送站内信等方式中的一种或多种，向您送达关于本服务的各种规则、通知、提示等信息，该等信息一经呼伦贝尔市觅特网络科技有限公司或觅特App采取前述任何一种方式公布或发送，即视为送达，对您产生约束力。若您不接受的，请您停止使用觅特App提供的服务，否则视为您已经接受、同意。</p>
      <p>2、若由于您提供的电子邮箱、手机号码、通讯地址等信息错误，导致您未收到相关规则、通知、提示等信息的，您同意仍然视为您已经收到相关信息并受其约束，一切后果及责任由您自行承担。</p>
      <p>3、您同意呼伦贝尔市觅特网络科技有限公司或呼伦贝尔市觅特网络科技有限公司合作伙伴可以向您的电子邮件、手机号码等发送可能与本服务不相关的其他各类信息包括但不限于商业广告等。</p>
      <p>4、若您有事项需要通知呼伦贝尔市觅特网络科技有限公司的，应当按照本服务对外正式公布的联系方式书面通知呼伦贝尔市觅特网络科技有限公司。</p>
    </section>
    <section>
      <h2>第十条 争议处理</h2>
      <p class="weight-style">1、本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。</p>
      <p class="weight-style line-style">2、若您和呼伦贝尔市觅特网络科技有限公司或者觅特App之间发生任何纠纷或争议，首先应友好协商解决；协商不成功的，双方均同意将纠纷或争议提交至呼伦贝尔市觅特网络科技有限公司所在地有管辖权的人民法院解决。</p>
    </section>
    <section>
      <h2>第十一条 责任限制</h2>
      <p>1、您理解并同意，呼伦贝尔市觅特网络科技有限公司会在现有技术水平和条件下尽最大努力向您提供平台技术服务，确保服务的连贯性和安全性；但呼伦贝尔市觅特网络科技有限公司不能随时预见和防范法律、技术以及其他风险，包括但不限于不可抗力，大规模的病毒、木马和黑客攻击，系统不稳定，第三方服务瑕疵，政府管制等原因可能导致的服务中断、数据丢失以及其他的损失和风险。</p>
      <p>2、您已充分知悉和同意：呼伦贝尔市觅特网络科技有限公司仅根据本协议提供平台技术服务。在该平台上，呼伦贝尔市觅特网络科技有限公司不是您的代理商、合伙人、雇员或雇主等关系人，呼伦贝尔市觅特网络科技有限公司不对您的行为负责。</p>
      <p>3、您同意，未经呼伦贝尔市觅特网络科技有限公司许可，不可在平台上设置网络链接信息。</p>
      <p>4、您理解并同意，在使用平台服务的过程中，可能会遇到不可抗力等风险因素使平台服务发生中断。不可抗力是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等以及社会事件如战争、动乱、政府行为等。出现上述情况时，呼伦贝尔市觅特网络科技有限公司或觅特App将努力在第一时间与相关单位配合，及时进行修复，但是由此给您造成的损失，呼伦贝尔市觅特网络科技有限公司或觅特App不承担任何责任。</p>
      <p>5、在法律允许的范围内，呼伦贝尔市觅特网络科技有限公司或觅特App对以下情形之一导致的服务中断或受阻不承担责任：</p>
      <p>（1） 受到计算机病毒、木马或其他恶意程序、黑客攻击的破坏；</p>
      <p>（2） 您或呼伦贝尔市觅特网络科技有限公司或觅特App的电脑软件、系统、硬件和通信线路出现故障；</p>
      <p>（3） 您操作不当；</p>
      <p>（4） 您通过非呼伦贝尔市觅特网络科技有限公司或觅特App授权的方式使用本服务；</p>
      <p>（5） 其他呼伦贝尔市觅特网络科技有限公司或觅特App无法控制或合理预见的情形。</p>
      <p>6、呼伦贝尔市觅特网络科技有限公司或觅特App依据本协议约定获得处理违法违规内容的权利，该权利不构成呼伦贝尔市觅特网络科技有限公司或觅特App的义务或承诺，呼伦贝尔市觅特网络科技有限公司或觅特App不能保证及时发现违法行为或进行相应处理。</p>
    </section>
    <section>
      <h2>第十二条 其他</h2>
      <p>1、一经注册或使用本协议下任何服务，即视为您已阅读并同意接受本协议及上述内容的约束。呼伦贝尔市觅特网络科技有限公司有权在必要时单方修改本协议或上述内容，相关内容变更后，如果您继续使用本服务，即视为您已接受修改后的相关内容。如果您不接受修改后的相关内容，应当停止使用相关服务。</p>
      <p>2、本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。</p>
      <p>3、本协议平台或相关产品、功能名称、协议名称变更的，不影响本合作的进行，以实际变更后的为准。</p>
      <p>4、本协议条款无论因何种原因部分无效，其余条款仍有效，对各方具有约束力。</p>
    </section>
  </div>
</template>
<script>
export default {
  name: "register",
  created() {
    document.title = this.$route.meta.title;
  }
};
</script>
