<template>
  <div class="agreement-wrap">
    <h1>隐私协议</h1>
    <section>
      <p>觅特App（以下称“平台”）尊重并保护所有使用觅特App用户的个人隐私权。为了给您提供更准确、更有个性化的服务，平台会按照本协议的规定使用和披露您的个人信息。但平台将以高度的勤勉、审慎义务对待这些信息。除本协议另有规定外，在未征得您事先许可的情况下，平台不会将这些信息对外披露或向第三方提供。另外，为了响应国家对涉黄行为的监管要求，平台在提供服务的过程中有权并有义务通过技术手段对服务参与方进行监控，此种监控不视为对您隐私权的侵犯。平台会不时更新本协议。您在同意觅特App用户注册协议之时，即视为您已经同意本协议全部内容。本协议属于觅特App用户注册协议不可分割的一部分。</p>
    </section>
    <section>
      <h1>一、适用范围</h1>
      <p>用户理解并同意，觅特App能获取用户下列信息： </p>
      <p>1.1 用户注册时填写的全部个人信息；</p>
      <p>1.2 用户在享受觅特App服务过程中平台可能获得的信息，包括但不限于：</p>
      <p>1) 用户上传到觅特App程序中的信息；</p>
      <p>2) 用户在访问或使用觅特App过程中，觅特App自动接收记录的浏览器和计算机信息（包括但不限于IP地址、访问时间、软硬件设备信息、浏览记录等信息）；</p>
      <p>3) 用户使用觅特App过程中的操作痕迹及交易信息等。</p>
    </section>
    <section>
      <h2>二、信息使用</h2>
      <p>2.1平台不会向任何无关第三方提供、出售、出租、分享或交易您的个人信息，除非事先得到您的许可，或该第三方和平台（含本应用关联公司）单独或共同为您提供服务，且在该服务结束后，其将被禁止访问包括其以前能够访问的所有这些资料。</p>
      <p>2.2平台亦不允许任何第三方以任何手段收集、编辑、出售或者无偿传播您的个人信息。任何平台平台用户如从事上述活动，一经发现，平台有权立即终止与该用户的服务协议。</p>
      <p>2.3 觅特App可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与平台同等的保护用户隐私的责任，则平台有权将用户的注册资料等提供给该第三方。</p>
      <p>2.4 在不透露单个用户隐私资料的前提下，觅特App有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。</p>
    </section>
    <section>
      <h2>三、信息披露</h2>
      <p>保护用户隐私是觅特App的一项基本政策，平台保证不对外公开或向第三方提供单个用户的注册资料及用户在使用网络服务时存储在觅特App中的非公开内容，但下列情况除外：</p>
      <p>3.1 事先获得用户的明确授权；</p>
      <p>3.2根据有关的法律法规要求；</p>
      <p>3.3 按照相关政府主管部门的要求；</p>
      <p>3.4 为维护社会公众的利益；</p>
      <p>3.5 为维护觅特App的合法权益；</p>
      <p>3.6 为处理某用户与其他用户或权利人之间的纠纷或争议（包括因某用户因知识产权等原因被投诉，向投诉人披露相关信息，以便处理和解决纠纷）。</p>
      <p>3.7 对于因电信系统或互联网网络故障、计算机故障或病毒、计算机系统问题或其它任何不可抗力原因而产生的信息泄露。</p>
      <p>3.8 其它平台根据法律、法规或者网站政策认为合适的披露。</p>
    </section>
    <section>
      <h2>四、信息安全</h2>
      <p>觅特App有安全保护功能，请妥善保管您的用户名及密码信息。平台将通过对用户密码进行加密等安全措施确保您的信息不丢失，不被滥用和变造。尽管有前述安全措施，但同时也请您注意在信息网络上不存在“完善的安全措施”。</p>
      <p>请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。如您发现自己的个人信息泄密，尤其是用户名及密码发生泄露，请您立即联络觅特App应用的客服，以便平台采取相应措施。</p>
    </section>
    <section>
      <h2>五、隐私协议的更改</h2>
      <p>5.1如果决定更改隐私协议，我们会在本协议中、觅特App应用程序中以及我们认为适当的位置发布这些更改，以便您了解我们如何收集、使用您的个人信息，哪些人可以访问这些信息，以及在什么情况下我们会透露这些信息。</p>
      <p>5.2呼伦贝尔市觅特网络科技有限公司保留随时修改该隐私协议的权利。如对本协议作出重大更改，本公司会通过觅特App应用程序的运行网站以通知的形式告知。</p>
      <p></p>
    </section>
    <section>
      <h2>六、争议解决</h2>
      <p>6.1 因本协议引起的或与本协议有关的任何争议，各方应友好协商解决；协商不成的，任何一方均可将有关纠纷或争议提交至公司所在地区的仲裁委员会并按照其届时有效的仲裁规则仲裁；仲裁裁决是终局的，对各方均有约束力。</p>
    </section>
  </div>
</template>
<script>
export default {
  name: "privacy",
  created() {
    document.title = this.$route.meta.title;
  }
};
</script>
