<template>
  <div class="agreement-wrap">
    <h1>用户充值协议</h1>
    <section>
      <p>尊敬的用户您好，在同意本协议前，请您认真阅读并充分知悉、理解本平台的各项规则及要求，以及国家关于该类互联网信息服务的法律法规等。如果您对本协议的任何条款表示异议，您可以选择不使用；<strong class="weight-style">使用则意味着您将同意遵守本协议下全部规定，以及我们后续对使用协议随时所作的任何修改，并完全服从于我们的统一管理。</strong>本协议已对与您的权益有或可能具有重大关系的条款，及对本平台具有或可能具有免责或限制责任的条款用粗体字予以标注，请您注意。
请确认您具有完全民事行为能力，如您已年满18周岁，或您已年满16周岁且依靠自己的劳动收入作为主要生活来源，否则请您停止注册或使用本协议项下的服务。</p>
    </section>
    <section>
      <h2>第一章 总则</h2>
      <p>第1条 本平台向用户提供的是一种更方便的进行视频直播、观看视频直播服务并与注册用户进行互动的视频社交平台。本平台将为用户提供虚拟礼物、技术支持、流量入口等进行视频社交所需的服务。 </p>
      <p>第2条 本平台所有权、经营权、管理权均属于呼伦贝尔市觅特网络科技有限公司</p>
      <p>第3条 本协议最终解释权归属呼伦贝尔市觅特网络科技有限公司。</p>
    </section>
    <section>
      <h2>第二章 充值规则</h2>
      <p>第4条 觅特App向您提供的用于在本平台上进行相关消费的虚拟币，您可将购买的虚拟礼物赠与主播。但是，“虚拟币”不能兑换为人民币，您应根据自己的实际需求购买相应数量的“虚拟币”。</p>
      <p>第5条 您可以通过觅特App、PC官网、目前在iOS系统中您只能通过对Apple账户充值以购买“虚拟币”，在Android平台中您可以通过支付宝、微信等第三方支付平台购买“虚拟币”，通过对Apple账户充值手段购买虚拟币时，因App Store会收取适当比例的费用，所以在iOS系统中购买虚拟币的价格会比在其他平台中使用第三方支付平台略高。</p>
      <p>第6条 于本协议签署日，人民币在iOS平台购买“虚拟币”：本平台保留根据相关法律规定、主管部门要求、业务开展情况等因素对使用人民币购买“虚拟币”的规则与价格等进行单方面变更、调整、中止或终止的权利。您同意无条件接受对上述购买规则的变更、调整、中止或终止，<strong class="weight-style">本平台开展前述行动时将以于本平台公布的方式通知，并自公布之日起自动生效，而无需另行单独通知您，也不就该等行动给您造成的任何损失承担任何责任。</strong></p>
      <p>第7条 在使用充值方式时，您务必仔细确认自己的账号并仔细选择相关操作选项。若因为您自身输入账号错误、操作不当或不了解充值计费方式等因素造成充错账号、错选充值种类、充错金额等情形而损害自身权益的，本平台将不会作出任何补偿、赔偿与退款。</p>
      <p>第8条 若您以非法的方式，或使用非本平台所指定的充值方式进行充值，本平台有权将涉及的虚拟币进行销毁，并保留追究相关人员法律责任的权利。若因此造成您权益受损，本平台不会作出任何补偿、赔偿和退款，本平台同时保留随时终止您账号资格及使用各项充值服务的权利。</p>
      <p>第9条 不论您是否为完全民事行为能力人，一旦充值成功本平台将不会作出任何退还、补偿与赔偿。给您及相关人造成的损失，本平台不承担任何责任。</p>
      <p>第10条 充值成功后，充值所增加的账号内“虚拟币”可由您在本平台上自由使用，但本平台不会提供任何退还或逆向兑换服务。</p>
      <p>第11条 如果本平台发现因系统故障或其他任何原因导致的处理错误，无论有利于本平台还是有利于您，本平台都有权在以电子邮件、微信或其他合理方式通知您后纠正该错误。如果该措施导致您实际收到的“虚拟币”数量少于您应获得的“虚拟币”，则本平台在确认该处理错误后会尽快将差额补足至您的账户中。如果该错误导致您实际收到的“虚拟币”数量多于您应获得的“虚拟币”，则无论错误的性质和原因如何，本平台有权从您的账户中直接扣除差额。</p>
    </section>
     <section>
      <h2>第三章 权利声明</h2>
      <p>第12条 您可随时在觅特APP上查看您的“虚拟币”的余额情况。如您对该记录有异议，应立即向本平台提出，本平台核对后确有错误的，将予以更正；否则视为您同意本平台上的交易记录将作为“虚拟币”交易的唯一有效依据。</p>
      <p>第13条 本平台有权基于交易安全等方面的考虑不时设定涉及交易的相关事项，包括但不限于交易限额、交易次数等。您了解，本平台的前述设定可能对您的交易造成一定不便，您对此没有异议</p>
      <p>第14条 在任何情况下，对于您购买“虚拟币”时涉及由第三方提供相关服务的责任由该第三方承担，本平台不承担该等责任。</p>
      <p>第15条 进行充值时，您应确保您是所绑定的支付账户的持有人，可合法、有效使用该账户且未侵犯任何第三方合法权益，否则因此造成支付宝账户实际所有人损失的，您应单独负责解决由此产生的纠纷并承担全部法律责任。</p>
      <p>第16条 因您自身的原因导致本平台无法提供“虚拟币”购买服务或提供“虚拟币”购买服务时发生任何错误而产生的任何损失或责任，由您自行负责，本平台不承担责任，包括但不限于：</p>
      <p>（1）您未按照本协议或本平台不时公布的任何规则进行操作；（2）因您的账号失效、丢失、被封停；（3）因您绑定的第三方支付机构账户的原因导致的损失或责任，包括您使用未经认证的第三方支付账户或使用非您本人的第三方支付账户，您的第三方支付账户被冻结、查封等；（4）您将密码告知他人导致的财产损失；（5）因您个人的故意或重大过失所造成的财产损失。</p>
      <p>第17条 本平台系统因下列状况无法正常运作，使您无法使用各项服务或任何虚拟财产丢失时，本平台及呼伦贝尔市觅特网络科技有限公司不承担损害赔偿责任，该状况包括但不限于：（1）在本平台公告之系统停机维护、升级、调整期间；（2）电信通讯或设备出现故障不能进行数据传输的；（3）因台风、地震、海啸、洪水、停电、战争、恐怖袭击、政府管制等不可抗力之因素，造成本平台系统障碍不能执行业务的；（4）由于黑客攻击、电信部门技术调整或故障、网站升级、相关第三方的问题等原因而造成的服务中断或者延迟。</p>
    </section>
     <section>
      <h2>第四章 处罚规则</h2>
      <p>第18条 如发生下列任何一种情形，本平台有权随时中断或终止向您提供本协议项下的网络服务而无需通知您：(1) 您提供的个人资料不真实；（2）您违反本协议中规定的购买规则。除前款所述情形外，本平台同时保留在不事先通知您的情况下随时中断或终止部分或全部网络充值服务的权利，对于充值服务的中断或终止而造成的任何损失，本平台无需对您或任何第三方承担任何责任。</p>
      <p>第19条 如果用户违规使用非本人苹果手机应用商店代冲值，或者通过其它非本平台认可的渠道非法购买“虚拟币”，则本平台有权冻结该账户，并进行相应惩罚，严重者可以进行封号处理。</p>
      <p>第20条 用户在使用本平台时，如出现违反国家法律法规、《用户注册协议》约定、本协议约定或其他本平台对用户的管理规定的情形，本平台有权暂时或永久封禁您的账号。账号封禁后至解禁（如有）前，您账户上的剩余“虚拟币”将被暂时冻结或全部扣除，不可继续用于购买平台上的虚拟产品或服务，同时不予返还您购买“虚拟币”时的现金价值。</p>
    </section>
     <section>
      <h2>第五章 附则</h2>
      <p>第21条 本平台保留修改或增补本协议内容的权利。本协议的修改文本将公告于本平台或以其他本平台认为可行的方式公告。修改文本一旦公布则立即生效，且对生效前的用户同样适用。若您在本协议内容发生修订后，继续使用本服务的，则视为您同意最新修订的协议内容；否则您须立即停止使用本服务。</p>
      <p>第22条 因本协议引起的或与本协议有关的争议，均适用中华人民共和国法律。</p>
      <p>第23条 因本协议引起的或与本协议有关的争议，本平台与您将协商解决。协商不成的，任何一方均有权向呼伦贝尔市觅特网络科技有限公司所在地有管辖权的法院提起诉讼。</p>
      <p>第23条 因本协议引起的或与本协议有关的争议，本平台与您将协商解决。协商不成的，任何一方均有权向呼伦贝尔市觅特网络科技有限公司所在地有管辖权的法院提起诉讼。</p>
      <p>第25条 本协议未涉及的问题参见国家有关法律法规，当本协议与中华人民共和国法律法规冲突时，以中华人民共和国法律法规为准。</p>
    </section>
  </div>
</template>
<script>
export default {
  name: "recharge",
  created() {
    document.title = this.$route.meta.title;
  }
};
</script>

