<template>
  <div class="agreement-wrap">
    <h1>用户注册协议</h1>
    <section>
      <h2>一、总则</h2>
      <p>1.1 觅特App(下述软件、平台都特指觅特App)的所有权和运营权归呼伦贝尔市觅特网络科技有限公司所有。 </p>
      <p>1.2 用户在注册之前，应当仔细阅读本协议，同意并遵守本协议后方可成为注册用户。一旦注册或登录成功，则用户与觅特App之间自动形成协议关系，用户应当受本协议的约束。用户在使用特殊的服务或产品时，应当同意并接受相关协议后方能使用 </p>
      <p>1.3 本协议可由觅特App随时更新，用户应当及时关注，并同意本软件不承担通知义务。本软件运行过程中所发出的通知、公告、声明或其它类似内容是本协议的一部分。 </p>
      <p class="weight-style">1.4 如果您未满18周岁，请在监护人的陪同下阅读本协议，并特别注意未成年人使用条款。</p>
    </section>
    <section>
      <h2>二、服务内容</h2>
      <p>2.1 呼伦贝尔市觅特网络科技有限公司为觅特App的开发者、所有者及经营者，完全按照其发布的服务条款和操作规则提供基于互联网以及移动互联网的相关服务（以下简称“网络服务”）。觅特App网络服务的具体内容由呼伦贝尔市觅特网络科技有限公司根据实际情况提供，包括但不限于Meet、Meet移动版等视频服务、聊天服务、内容服务、充值服务等。 </p>
      <p>2.2 用户理解并接受，本软件仅提供相关的网络服务，除此之外与相关网络服务有关的设备（如个人电脑、手机、及其他与接入互联网或移动互联网有关的装置）及所需的费用（如为接入互联网而支付的电话费及上网费、为使用移动网而支付的手机费）均应由用户自行负担。 </p>
    </section>
    <section>
      <h2>三、用户账号</h2>
      <p>3.1 用户只能按照注册要求使用真实姓名，及身份证号注册。您一旦注册成功成为用户，将得到一个账号和密码，您需要对自己在账户中的所有活动和事件负全责。如果由于您的过错导致您的账号和密码脱离您的控制，则由此导致的针对您、觅特App或任何第三方造成的损害，您将承担全部责任。 </p>
      <p>3.2 经觅特App注册系统完成注册程序的用户即成为正式用户，可以获得本软件规定用户所应享有的一切权限。觅特App有权对用户的权限设计进行变更。</p>
      <p>3.3 用户对经注册成功所或得的觅特账号、觅特ID以及昵称仅有使用权，所有权归觅特App所有，觅特App可视用户使用情况将上述账号、ID及昵称收回。</p>
    </section>
    <section>
      <h2>四、用户使用规则</h2>
      <p>4.1 遵守中华人民共和国相关法律法规，包括但不限于《中华人民共和国计算机信息系统安全保护条例》、《计算机软件保护条例》、《最高人民法院关于审理涉及计算机网络著作权纠纷案件适用法律若干问题的解释(法释[2004]1号)》、《全国人大常委会关于维护互联网安全的决定》、《互联网电子公告服务管理规定》、《互联网新闻信息服务管理规定》、《互联网著作权行政保护办法》和《信息网络传播权保护条例》等有关计算机互联网规定和知识产权的法律和法规、实施办法。</p>
      <p>4.2 用户在申请使用觅特App应用服务时，必须向觅特App应用网络提供真实、准确、完整有效的个人资料，如个人资料提供不准确、不真实、不合法、不详尽或有任何变动的，必须及时更新或修改。因用户提供个人资料不准确、不真实、不合法、不详尽而引发的一切后果由用户承担，并且觅特App保留停止用户使用觅特App应用服务的权利。</p>
      <p>4.3 用户不应将其账号、密码转让、出借或以任何脱离用户控制的形式交由他人使用，包含但不限于三方登录的账号。如用户发现帐号遭到未授权的使用或发生其他任何安全问题，应立即修改帐号密码并妥善保管，如有必要，请通知觅特App运营人员。因黑客行为或用户的保管疏忽导致帐号非法使用，觅特App运营平台不承担任何责任。</p>
      <p>4.4 用户应当为自身注册账户下的一切行为负责，因用户行为而导致的用户自身或其他任何第三方的任何损失或损害，觅特App不承担责任。</p>
      <p>4.5 用户理解并接受觅特App提供的服务中可能自行或由第三方广告商通过包括但不限于邮件、短信、电话、站内信的方式向您发送商业或非商业广告、推广或宣传信息（包括商业或非商业信息），其他方式和范围可不经向您特别通知而变更。用户同意在使用网络服务的过程中显示本站和第三方广告商、合作伙伴提供的广告，且本站无需4.5 用户理解并接受觅特App提供的服务中可能自行或由第三方广告商通过包括但不限于邮件、短信、电话、站内信的方式向您发送商业或非商业广告、推广或宣传信息（包括商业或非商业信息），其他方式和范围可不经向您特别通知而变更。用户同意在使用网络服务的过程中显示本站和第三方广告商、合作伙伴提供的广告，且本站无需</p>
      <p>4.6 用户在使用本应用程序过程中，必须遵循以下原则：</p>
      <p>4.6.1 遵守中华人民共和国有关的法律和法规；：</p>
      <p>4.6.2 遵守中华人民国和国所有与网络服务有关的网络协议、规定和程序</p>
      <p>4.6.3 不得为任何非法目的而使用觅特App；</p>
      <p>4.6.4 不得利用觅特App进行任何可能对互联网或移动网正常运转造成不利影响的行为；</p>
      <p>4.6.5 不得利用觅特App提供的网络服务上传、展示或传播任何虚假的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或其他任何非法的信息资料；</p>
      <p>4.6.6 不得侵犯觅特App和其他任何第三方的专利权、著作权、商标权、名誉权或其他任何合法权益；</p>
      <p>4.6.7 不得利用觅特App应用程序进行任何不利于呼伦贝尔市觅特网络科技有限公司的行为；</p>
      <p>4.6.8 不得传输或发表：煽动抗拒、破坏宪法和法律、行政法规实施的言论，煽动颠覆国家政权，推翻社会主义制度的言论，煽动分裂国家、破坏国家统一的言论，煽动民族仇恨、民族歧视、破坏民族团结的言论；</p>
      <p>4.7 如用户在使用觅特App时违反任何上述规定，本软件或其授权的人员有权要求用户改正或直接采取一切必要的措施（包括但不限于更改或删除用户收藏的内容等、暂停或终止用户使用软件的权利）以减轻用户不当行为造成的影响。如果用户使用觅特App违反了任何上述规定，导致任何第三方遭受损害的，您应当独立承担责任，本站因此遭受损失的，您也应当一并赔偿。</p>
    </section>
    <section>
      <h2>五、 服务变更、中断或终止</h2>
      <p>5.1 鉴于网络服务的特殊性，用户同意觅特App有权根据业务发展情况随时变更、中断或终止部分或全部的网络服务而无需通知用户，也无需对任何用户或任何第三方承担任何责任</p>
      <p>5.2 用户理解，呼伦贝尔市觅特网络科技有限公司需要定期或不定期地对提供软件应用程序的平台（如互联网网站、移动网络等）或相关的设备进行检修或者维护，如因此类情况而造成软件应用程序在合理时间内的中断，觅特App无需为此承担任何责任，但本软件应尽可能事先进行通告。</p>
      <p>5.3 如发生下列任何一种情形，觅特App有权随时中断或终止向用户提供本协议项下的网络服务（包括收费网络服务）而无需对用户或任何第三方承担任何责任：</p>
      <p>5.3.1 用户提供的个人资料不真实；</p>
      <p>5.3.2 用户违反相关法律法规或本协议中规定的使用规则；</p>
      <p>5.3.3 按照法律规定或主管部门的要求；</p>
      <p>5.3.4 出于安全的原因或其他必要的情形.</p>
    </section>
    <section>
      <h2>六、知识产权</h2>
      <p>6.1 觅特App中包含的任何文本、图片、图形、音频和/或视频资料均受版权、商标和/或其它相关法律的保护，未经觅特平台相关权利人同意，上述资料均不得用于任何商业目的。</p>
      <p>6.2 觅特App为提供网络服务而使用的任何软件（包括但不限于软件中所含的任何图像、照片、动画、录像、录音、音乐、文字和附加程序、随附的帮助材料）的一切权利均属于该软件的著作权人，未经该软件的著作权人许可，用户不得对该软件进行反向工程（reverse engineer）、反向编译（decompile）或反汇编（disassemble）。</p>
    </section>
    <section>
      <h2>七、隐私保护</h2>
      <p>七、隐私保护</p>
      <p>7.1.1 用户注册时填写的全部个人信息；</p>
      <p>7.1.2 用户在享受觅特App服务过程中本软件可能获得的信息，包括但不限于：</p>
      <p>1) 用户上传到觅特App应用程序中的信息；</p>
      <p>2) 用户在访问或使用觅特App过程中，觅特App自动接收记录的浏览器和计算机信息（包括但不限于IP地址、访问时间、软硬件设备信息、浏览记录等信息）；</p>
      <p>3) 用户使用觅特App过程中的操作痕迹及交易信息等；</p>
      <p>4）觅特App有权并有义务通过技术手段对用户接受服务时的活动进行监督和管理时所获取的信息。</p>
      <p>7.2 保护用户隐私是觅特App的一项基本政策，本站保证不对外公开或向第三方提供单个用户的注册资料及用户在使用网络服务时存储在觅特App中的非公开内容，但下列情况除外：</p>
      <p>7.2.1 事先获得用户的明确授权；</p>
      <p>7.2.2 根据有关的法律法规要求；</p>
      <p>7.2.3 按照相关政府主管部门的要求；</p>
      <p>7.2.4 为维护社会公众的利益；</p>
      <p>7.2.5 为维护觅特App的合法权益；</p>
      <p>7.2.6 为处理某用户与其他用户或权利人之间的纠纷或争议（包括因某用户因知识产权等原因被投诉，向投诉人披露相关信息，以便处理和解决纠纷）。</p>
      <p>7.3 觅特App可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与本软件同等的保护用户隐私的责任，则本软件有权将用户的注册资料等提供给该第三方。</p>
      <p>7.4 在不透露单个用户隐私资料的前提下，觅特App有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。</p>
    </section>
    <section>
      <h2>八、免责声明</h2>
      <p>8.1 觅特App不担保网络服务一定能满足用户的要求，也不担保网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作担保。</p>
      <p>8.2 觅特App不保证为向用户提供便利而设置的外部链接的真实性、准确性和完整性，同时，对于该等外部链接指向的不由本站实际控制的任何网页上的内容，本站不承担任何责任。</p>
      <p>8.3 对于因电信系统或互联网网络故障、计算机故障或病毒、信息损坏或丢失、计算机系统问题或其它任何不可抗力原因而产生损失，觅特App不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。</p>
      <p>8.4 觅特App不担保本软件所包含或以其他方式通过本软件提供给用户的全部信息、内容、产品（包括软件）、服务和从本站发出的电子信息、信件没有病毒或其他有害成分。</p>
      <p>8.5 除非另有明确书面说明，觅特App不对本站的运营及其包含在本站上的信息、内容、产品（包括软件）、服务作任何形式的、明示或默示的担保。</p>
    </section>
    <section>
      <h2>九、法律适用及争议解决</h2>
      <p>9.1 本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国法律（不包括冲突法）。</p>
      <p>9.2 因本协议引起的或与本协议有关的任何争议，各方应友好协商解决；协商不成的，任何一方均可将有关纠纷或争议提交至公司所在地区的仲裁委员会并按照其届时有效的仲裁规则仲裁；仲裁裁决是终局的，对各方均有约束力。</p>
    </section>
    <section>
      <h2>十、未成年人使用条款</h2>
      <p class="weight-style">10.1 若用户未满18周岁，您应在监护人同意和指导下访问和/或使用觅特App的网络服务，并且您的监护人允许您使用本软件的网络服务且同意本协议的各项条款。如果您是未成年人的监护人，即表示您同意约束未成年人遵守这些条款使用本软件的网络服务。特别地，如用户未满18周岁或不具备完全民事行为能力，您应在监护人的同意和指导下使用本软件的充值服务，您使用充值服务而产生的一切后果，由您及您的监护人承担。</p>
      <p class="weight-style">10.2 未成年应在监护人的指导下合理安排时间使用Meet网站的网络服务，注意避免沉迷于网络，影响正常的学习生活。</p>
    </section>
     <section>
      <h2>十一、其他条款</h2>
      <p>11.1 本协议内容同时包括觅特App不时发布的其他相关协议、规则、声明、政策等内容。上述内容一经正式发布，即成为本协议不可分割的组成部分，与本协议具有同等的法律效力。</p>
      <p>11.2 如果本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，或违反任何适用的法律，则该条款被视为删除，但本协议的其余条款仍应有效并且有约束力。</p>
      <p>11.3 呼伦贝尔市觅特网络科技有限公司有权随时根据有关法律、法规的变化以及公司经营状况和经营策略的调整等修改本协议，而无需另行单独通知用户。修改后的协议会在觅特App应用程序上公布。用户可随时通过觅特App浏览最新服务协议条款。当发生有关争议时，以最新的协议文本为准。如果不同意呼伦贝尔市觅特网络科技有限公司对本协议相关条款所做的修改，用户有权停止使用觅特App。如果用户继续使用本软件，则视为用户接受呼伦贝尔市觅特网络科技有限公司对本协议相关条款所做的修改</p>
      <p>11.4 呼伦贝尔市觅特网络科技有限公司在法律允许的范围对本协议拥有解释权与修改权。</p>
    </section>
  </div>
</template>
<script>
export default {
  name: "register",
  created() {
    document.title = this.$route.meta.title;
  }
};
</script>

