<template>
  <div v-html="contract"></div>
</template>

<script>
export default{
      name:"contract",
      data(){
          return {
              contract:`      <p>マイニング規約</p>
      <p class="contract-margin">第1章　マイニングマシン売買規約</p>
      <p class="contract-margin">第１条　マイニングマシン売買規約の同意</p>
      <p>本規約に従い、フィント株式会社（以下、「当社」と言います）の運営するfinto.jp（以下、「本サイト」と言います）にて提供される仮想通貨のマイニング専用コンピュータハードウェアの販売サービス（以下、「本サービス」と言います）のご利用者は本規約に記載されている条項に則るものとします。本規約に同意されることで、ご利用者と当社との間で本規約の通り、マイニングマシン売買契約が締結されたものとみなし、ご利用者及び当社は本規約に定められた義務を負うものとします。本サービスとは仮想通貨のマイニング専用コンピュータハードウェア（以下、「マイニングマシン」と言います）を当社よりご利用者に販売させていただくことを言います。また、本サイトの購入ページに記載されている各種マイニングマシンから産出される仮想通貨の量は当社がご利用者に対し確約するものではございません。本規約に同意することにより、ご利用者は満年齢18歳以上であり、合法的に契約を締結することができる身分であることを表明したこととなり、ご利用者が法人である場合は、ご利用者自身が代表者または契約締結権限の保有者であることを表明したこととなります。[第３章第２条契約の解除に入れる。]</p>

      <p class="contract-margin">第2条　売買</p>
      <p>ご利用者は、本規約に従い、当社の運営する本サイトに掲載された仮想通貨のマイニング専用コンピュータハードウェア（以下、「商品」と言います）をご購入いただけます。</p>

      <p class="contract-margin">第3条　販売条件</p>
      <p>1.&nbsp;&nbsp;本サイトに掲載された商品の販売価格は、ご利用者が本サイトから購入され、マイニングサービスをご利用される場合は税抜金額で、かつ消費税は非課税となります。ご利用者が本サイトから購入され、日本国内のご指定の場所に配送する場合についても、税抜金額になります。ただし日本国が定める国外からの物品輸入に関する指定の税金などは、ご利用者の負担とし、弊社は一切の負担及び責任を負いません。</p>
      <p>2.&nbsp;&nbsp;ご利用者はご注文時に付随サービスご選択いただきます。</p>
      <p>&nbsp;&nbsp;1）当社にご注文いただいた本商品を当社指定のマイニングファームに納品し、その一切の保守管理運営を委託する「マイニングサービス」</p>
      <p>&nbsp;&nbsp;2）ご利用者の指定住所に配送する「日本へのお届けサービス」</p>
      <p>3.&nbsp;&nbsp;本サイトに表示された出荷予定日の表示は、目安の期間です。マイニングサービスをご利用の場合、ご購入確定日より３週間以内には弊社指定のマイニングファームに納品されるものとします。日本へのお届けサービスをご利用の場合は、その限りではありません。マイニングサービスをご利用いただく場合、商品の送料・設置・インストールなどマイニングを開始するための一切については、商品代金とは別に費用をご負担いただきます。</p>
      <p>4.&nbsp;&nbsp;日本へのお届けサービスをご利用いただく場合、商品の代金とは別に送料をご負担いただきます。</p>
      <p>5.&nbsp;&nbsp;原則として本サイトでの商品のご注文は、18歳以上のご利用者を対象とします。18歳未満のご利用者によるご注文は保護者の同意を必要とします。</p>

      
      <p class="contract-margin">第4条　ご注文とご成約</p>
      <p>1.&nbsp;&nbsp;ご利用者は、当社指定の手続きに従い、本サイトに掲載された商品の購入をご注文いただけます。</p>
      <p>2.&nbsp;&nbsp;ご利用者が、本サイトでのご注文手続と代金のお支払いを完了されますと、ご注文内容は確定（売買契約が成立）します。ただし、お支払い方法を銀行振込にされた場合は、本サイトでのご注文手続完了の時にご注文内容が確定するものとします。尚、クレジットカードによる支払いの場合は、購入画面にクレジット情報を入力し、無事購入完了まで終えたタイミングでご注文内容は確定（売買契約が成立）します。</p>
      <p>3.&nbsp;&nbsp;ご注文代金については、クレジットカード以外の決済方法をご選択の場合、注文より２４時間以内にお支払いいただきます。ご注文内容の確定後、期限内にお支払いいただけない場合、このご注文内容はキャンセル（売買契約は初めからなかったことになり、それに関連・付随する当社およびご利用者の債権債務は発生しません。）とさせて頂きます。</p>
      <p>4.&nbsp;&nbsp;各商品毎のご注文時の条件（販売価格および付随サービス、しかしそれに限らない）により契約が締結されます。</p>
      <p>5.&nbsp;&nbsp;以下の項目のいずれかにお客様ご利用者が該当した場合、当社はご注文がキャンセルされたものとみなします。</p>
      <p>&nbsp;&nbsp;1）クレジットカード決済の場合に、クレジットカード会社の承認が受けられないとき。</p>
      <p>&nbsp;&nbsp;2）前1号以外の決済方法の場合に、決済方法ごとに当社が定める期限内に代金がご入金されないとき。</p>
      <p>6.&nbsp;&nbsp;契約の成立後も、以下の事由が判明した場合、当社は無条件で契約を解除することができます。その場合、当社は一切の債務を負わず、またご利用者に対して損害賠償の請求を妨げるものではありません。</p>
      <p>&nbsp;&nbsp;1）個人情報に虚偽の事実が認められた場合。</p>
      <p>&nbsp;&nbsp;2）長期入荷未定商品または生産完了商品のご注文をお受けした場合。</p>
      <p>&nbsp;&nbsp;3）数量限定商品等お客様ご利用者のご購入に数量制限（手配可能数量）を設けている場合に、それを越えたご注文をお受けした場合。</p>
      <p>&nbsp;&nbsp;4）本サイトに表示された価格が市場相場等に比較して誤っていると当社が判断した場合。</p>
      <p>&nbsp;&nbsp;5）転売、再販売または営利の目的のおそれがあるご注文をお受けした場合。</p>
      <p>&nbsp;&nbsp;6）18歳未満のご利用者が保護者の同意を得ずにご注文された場合。</p>
      <p>&nbsp;&nbsp;7）その他当社がご注文のお断りまたは契約の解除の必要を認めた場合。</p>
      <p>&nbsp;&nbsp;8）本規約に違反した場合</p>


      <p class="contract-margin">第5条　日本へのお届けサービス</p>
      <p>1.&nbsp;&nbsp;当社は、日本へのお届けサービスを選択され、成約したご利用者に対し、ご注文の内容に従って所定のお届け先へ商品をお届けします。</p>
      <p>2.&nbsp;&nbsp;日本へのお届けサービスに関する送料はご利用者の負担とします。</p>
      <p>3.&nbsp;&nbsp;お届けには当社指定の配送業者が伺い、商品はお届け先の入口でのお引渡となります。なお、お引渡しをもって、当該商品の危険負担はご利用者に帰属します。</p>
      <p>4.&nbsp;&nbsp;当該商品の所有権は、クレジットカード決済の場合は商品引渡後クレジットカード会社から当社が商品代金の全額のお支払をいただいた時、ショッピングローン決済の場合はご利用者がお支払い総額を完済された時、その他のお支払方法の場合はお引渡し時に、ご利用者に帰属します。</p>
      <p>5.&nbsp;&nbsp;商品のお届け先は、原則として日本国内に限ります。</p>
      <p>6.&nbsp;&nbsp;運送は配送業者が行うため、運送中の事故などに起因してマイニングマシンが損壊した場合は、当社は一切の責任を負いません。</p>

      <p class="contract-margin">第6条　お支払い</p>
      <p>1.&nbsp;&nbsp;本サイトに掲載された商品の販売価格やその他のサービスに関する料金、送料などの算定方法等は、当社が定める通りとします。</p>
      <p>2.&nbsp;&nbsp;本サイトに掲載された商品のご注文時にクレジットカード以外の決済方法をご選択の場合、24時間以内に当社の指定口座にお支払いただくものとします。</p>
      <p>3.&nbsp;&nbsp;ご利用者は、本サイトに関連した支払いに関して、クレジットカード会社、立替代行業者等の間で料金その他の債務を巡って紛争が発生した場合、当該当事者と直接解決していただきます。</p>

      <p class="contract-margin">第7条　保証及びアフターサービス等</p>
      <p>1.&nbsp;&nbsp;本サイトの掲載の商品の保証及びアフターサービスは原則として製造元が定める内容とします。詳細内容はご購入画面に記載されている内容に則ります。保証は原則として製造元が行うため、当社は一切の保証を負う義務はありません。ただし、第２章で定めるマイニングサービスをご利用の場合は、当社のマイニングサービスの一つとして簡単な初期対応、簡易修理対応、もしくは製造元との修理・交換対応を代理で行います。また、日本へのお届けサービスをご利用の場合は、当社のアフターサービスとして、製造元との修理・交換窓口対応を代理で行います。いずれのサービスをご利用の場合でも、修理などによる別途送料などの費用が発生した場合、当社の指定する決済方法または仮想通貨にてご利用者にご負担いただきます。</p>
      <p>2.&nbsp;&nbsp;以下の場合については、保証及びアフターサポートは対象外となります。</p>
      <p>&nbsp;&nbsp;1）商品を故意に損壊させた場合</p>
      <p>&nbsp;&nbsp;2）商品を改造、分解、その他部品の交換を行った場合</p>
      <p>&nbsp;&nbsp;3）落雷、サージ電圧などの電源や電圧により損壊した場合</p>
      <p>&nbsp;&nbsp;4）水分の流入、湿気によるICチップ、その他電子部品異変・故障、またはそれらが原因で腐食し、商品が損壊した場合</p>
      <p>&nbsp;&nbsp;5）回路盤に焦げ跡が残っているまたはチップが燃えた場合</p>
      <p>&nbsp;&nbsp;6）商品本来の目的とは異なった使用、または正常な使用を怠った場合</p>

      <p class="contract-margin">第8条　返品等</p>
      <p>1.&nbsp;&nbsp;商品発送後の異議申し立てや売買契約の解除などは一切応じられません。</p>
      <p>2.&nbsp;&nbsp;お届けした商品に初期不良等瑕疵があった場合、商品到着後３０日以内にご連絡下さい。当社で確認の上、瑕疵があった場合に限り、メーカーと協議の元、交換もしくは修理対応いたします。なお、完売等の理由により同商品と交換もしくは修理対応できない場合に、返金もしくは同等他商品と交換で差額が発生する場合、ご利用者に差額をご負担頂きます。</p>
  

      <p class="contract-margin">第2章　マイニングサービス規約 </p>


      <p class="contract-margin">第１条　マイニングサービスの定義</p>
      <p>当社は専門の技術管理人員、電力・電源設備、インターネット設備、セキュリティモニタリング、サーバー等、ご利用者が本サイトより購入された本商品の保守管理業務（以下、「マイニングサービス」と言います）を行います。当社は善良なる管理者として以下のサービスをご利用者へ提供します。</p>
      <p>1.&nbsp;&nbsp;ご利用者が本サイトから購入された商品の設置・インストール・システム設定</p>
      <p>2.&nbsp;&nbsp;ご利用者が本サイトから購入された商品の定期的な確認</p>
      <p>3.&nbsp;&nbsp;ご利用者が本サイトから購入された商品が産出した仮想通貨の払い出し</p>
      <p>4.&nbsp;&nbsp;ご利用者が本サイトから購入された商品のトラブル時の初期対応</p>
      <p>5.&nbsp;&nbsp;ご利用者が本サイトから購入された商品の保守運営に関わるその他一切の業務</p>

      <p class="contract-margin">第２条　申し込み</p>
      <p>ご利用者は、本規定に従い、本サイトに掲載された商品のご注文時にマイニングサービスをお申し込みいただけます。マイニングサービスの期間は２年間とし、サービスの開始日はマイニング開始日とさせていただきます。契約終了時は、ご利用者と協議の上、別途定めるものとする。</p>
      

      <p class="contract-margin">第３条　利用条件</p>
      <p>1.&nbsp;&nbsp;本サイトに掲載された商品を、ご利用者が本サイトから購入され、付随サービスであるマイニングサービスをご選択いただいた場合、ご利用いただけます。</p>
      <p>2.&nbsp;&nbsp;当社マイニングファーム にご利用者が購入された商品が到着後、マイニングサービスを開始いたします。可及的速やかに準備を行いますが、マイニング開始日は原則として約束するものではありません。</p>
      <p>3.&nbsp;&nbsp;マイニングサービスをご利用の場合、商品代金とは別にセットアップ費用（マイニングファームへの運送料、機器設置、インストールなどを含むがそれに限らない）ご負担いただきます。</p>
      <p>4.&nbsp;&nbsp;仮想通貨のマーケット変動により、本サイトに掲載されたセットアップ費用は、事前の通知なく金額の変動がある可能性があります。</p>
      <p>5.&nbsp;&nbsp;マイニングサービスをご利用の場合、当社の運営管理手数料として、ご利用者が購入された商品から産出された仮想通貨より、当社からご利用者への仮想通貨払い出す際に控除させていただきます。なお、運営管理手数料は本サイトに掲載されているの各商品の購入ページに記載された通りです。</p>
      <p>6.&nbsp;&nbsp;マイニングサービスをご利用の場合、ご購入された商品を保守管理するために必要な費用（電気代、メンテナンス費、機器修理のための運送料など）はご利用者にご負担いただきます。なお、ご購入された商品が実際に消耗した電力に対する電気代を、ご購入された商品から産出された仮想通貨を当社からご利用者への仮想通貨払い出す際に控除させていただきます。</p>
      <p>7.&nbsp;&nbsp;仮想通貨市場は極めて早いスピードで変化を伴うものであり、各種仮想通貨の価格やハッシュパワー、運送費、電気代に関するデータ又は費用など（これらを含むがこれに限定されるものではない）はマイニングサービスの途中でも小規模な変動が起こり得ることをご了承いただきます。またそれに伴い、本規約も事前の通知なく変更されることがあります。</p>
      <p>8.&nbsp;&nbsp;仮想通貨の価格変動やマイニング難易度の増減などによる要因で、マイニングされる仮想通貨が７日間連続して当社の運営管理手数料及び電気代に充当される仮想通貨よりも下回った場合、ご利用者の利益保護の観点からマイニングサービスは一時停止となります。マイニングサービスの再始動は、運営管理手数料と電気代などの清算後、当社とご利用者と別途協議の上で、随時開始できるものとします。</p>
      <p>9.&nbsp;&nbsp;マイニングサービスの途中解約については一切応じられません。</p>
      <p>10.&nbsp;&nbsp;契約終了時については、ご利用者はマイニングマシンの処理について以下の内容のいずれかとします。</p>
      <p>&nbsp;&nbsp;１）当社で中古販売を行い、その利益をご利用者にお戻しする</p>
      <p>&nbsp;&nbsp;２）マイニングマシンは当社に処分を委託する</p>
      <p>&nbsp;&nbsp;３）日本へのお届けサービスをご利用いただき、マイニングマシンをお引き取りいただく</p>
      <p>11.&nbsp;&nbsp;原則として本サイトでのマイニングサービスご注文は18歳以上のご利用者を対象とします。18歳未満のご利用者によるご注文は保護者の同意を必要とします。</p>


      <p class="contract-margin">第4条　仮想通貨のお引き出し</p>
      <p>ご利用者は本サイトのアカウント内に保有された仮想通貨をご利用者が指定する仮想通貨ウォレットにお引き出しいただけます。ご利用者は本サイト内より引き出しの申請手続きを行うものとし、当社はその申請受領後２営業日以内にご利用者に対し送信作業を行います。なお、仮想通貨ウォレットの不具合や第三者によるハッキング、サイバー攻撃など（これらを含むがそれに限定されない）は一切責任を負いません。</p>

      <p class="contract-margin">第5条　マイニングサービス免責事項</p>
      <p>1.&nbsp;&nbsp;当社の合理的な支配が及ばない事由（以下「不可抗力」という）による本契約に基づく当社の義務の不履行又は履行遅滞について、当社は一切の責任を負いません。不可抗力には天災、政府又は政府関連機関の行為、法律、規制又は命令の遵守、関係当局による立入検査、火災、暴風雨、洪水もしくは地震、戦争、反乱、革命もしくは暴動、ストライキ、もしくはロックアウトを含みますが、これらに限定されるものではありません。不可抗力が発生してから3日に以内に当社はマイニングサービスご利用者に対して状況のご説明を行います。発生より15日営業日たっても本契約の一部または全てが履行できない場合は、契約の解除、内容の変更又は延期についてご利用者と協議させていただきます。本契約の主要履行責任が１８０日間の履行困難に陥った時点で、当社又はご利用者のいずれも本契約を解除する権利を持ち、契約解除による一切の違約責任などは負わないものとします。</p>
      <p>2.&nbsp;&nbsp;天変地異、戦争、暴動、内乱、革命、法令の改廃制定、裁判所もしくは行政当局による命令処分、輸送機関の事故、その他の不可抗力により契約の履行が遅延し、または不可能となったときは、当社はご利用者に対し何等の責任も負いません。</p>
      <p>3.&nbsp;&nbsp;以下の例示の事項（それらに限らない）が起こった場合、当社は一切の責任を負いません。</p>
      <p>&nbsp;&nbsp;1）仮想通貨の価格が暴落した場合の経済的損害</p>
      <p>&nbsp;&nbsp;2）仮想通貨関連技術の大幅な成長により、ご利用者が購入された商品からマイニングされる仮想通貨の量が下がった場合の経済的損害</p>
      <p>&nbsp;&nbsp;3）保守管理時の損壊、不慮の事故での損壊、運送中などの不可抗力にて損壊した場合</p>
      <p>&nbsp;&nbsp;4）停電、突然の電力遮断などの事故が発生した際にご利用者が購入された商品が一時的に停止した際の経済的又は物理的な損害</p>
      <p>&nbsp;&nbsp;5）ネット上のシステムダウンや第三者の不正アクセスが原因として生じたデータ消去などによる損害</p>
      <p>&nbsp;&nbsp;6）その他、管理者である当社が想定し得ないことによる損害</p>

      <p class="contract-margin">第３章　雑則</p>


      <p class="contract-margin">第１条　不可抗力</p>
      <p>当社の合理的な支配が及ばない事由（以下「不可抗力」という）による本契約に基づく当社の義務の不履行又は履行遅滞について、当社は一切の責任を負いません。不可抗力には天災、政府又は政府関連機関の行為、法律、規制又は命令の遵守、関係当局による立入検査、火災、暴風雨、洪水もしくは地震、戦争、反乱、革命もしくは暴動、ストライキ、もしくはロックアウトを含みますが、これらに限定されるものではありません。不可抗力が発生してから3日に以内に当社はマイニングサービスご利用者に対して状況のご説明を行います。発生より15日営業日たっても本契約の一部または全てが履行できない場合は、契約の解除、内容の変更又は延期についてご利用者と協議させていただきます。本契約の主要履行責任が１８０日間の履行困難に陥った時点で、当社又はご利用者のいずれも本契約を解除する権利を持ち、契約解除による一切の違約責任などは負わないものとします。</p>



      <p class="contract-margin">第2条　契約の解除</p>
      <p>1.&nbsp;&nbsp;当社又はご利用者が以下の一つに該当した際は、催告なしに直ちに本契約ならびにこれに基づく個別契約の一部または全部を解除することができます。</p>
      <p>&nbsp;&nbsp;1）本契約あるいは個別契約の条項に違反した時</p>
      <p>&nbsp;&nbsp;2）銀行取引停止処分を受けた時</p>
      <p>&nbsp;&nbsp;3）第三者から強制執行を受けた時</p>
      <p>&nbsp;&nbsp;4）破産・民事再生、または会社更生などの申し立てがあった時</p>
      <p>&nbsp;&nbsp;5）信用状態の悪化など、あるいはその他契約の解除につき、相当の事由が認められる時</p>
      <p>&nbsp;&nbsp;6）反社会的勢力の構成員もしくは関係者であることが判明した時</p>
      <p>&nbsp;&nbsp;7）仮想通貨市場の変動により商品の提供が困難になった時[第１章第２条６]</p>
      <p>2.&nbsp;&nbsp;いかなる理由があろうとも、契約の解除にあたっては、返金や返品またはサービス解除については原則的に行わないものとします。また、当社が被った経済的損害[ご注文いただいた機器＝経済的損害とする。]についてご請求させていただく場合がございます。</p>
      <p>3.&nbsp;&nbsp;経済的損害として以下を違約金としてお支払いただきます。</p>
      <p>&nbsp;&nbsp;1）ご購入頂いたマイニングマシンの販売金額</p>
      <p>&nbsp;&nbsp;2）ご購入頂いたセットアップ費</p>


      <p class="contract-margin">第3条　秘密情報・個人情報の取り扱い</p>
      <p>当社はご利用者より知り得た如何なる情報（技術上、営業上又はその他の業務上の情報）を事前にご利用者からの書面による承諾を受けることなく、第三者に開示することはございません。ただし次の各号のいずれか一つに該当する情報についてはこの限りではありません。</p>
      <p>1.&nbsp;&nbsp;ご利用者から情報の提供を受けた時、既に公知であった情報</p>
      <p>2.&nbsp;&nbsp;ご利用者から情報の提供を受けた時、公知となった情報</p>
      <p>3.&nbsp;&nbsp;秘密保持義務を負うことなく、すでに保有している情報</p>
      <p>いかなる個人情報または秘密情報について、当社は善良なる管理者として情報管理に必要な措置を講じます。</p>

      <p class="contract-margin">第4条　禁止事項</p>
      <p>以下の行為は禁止事項とします。当社により発覚した場合は、直ちにアカウントを凍結させていただきます。また、違法行為などについては、直ちに警察に通報の上、捜査協力のためにその利用者のアカウント情報、その他個人情報などを提示させていただきます。また、当社が被る経済的損失の請求をさせていただきます。</p>
      <p>１.&nbsp;&nbsp;ご利用者は、当社のサービスまたは当社のサービスを通じて提供されたコンテンツまたは情報を利用して、ビジネスまたはその他活動を行うこと、その他の違法行為、または当社が不適切と判断する目的のために使用する事は禁止します。</p>
      <p>2.&nbsp;&nbsp;ご利用者のアカウントは本人のみが使用できるものとし、アカウントの譲渡や本人以外が使用することを禁止します。</p>

      <p class="contract-margin">第5条　反社会的勢力の排除</p>
      <p>本規約に同意することで、ご利用者は次の各号の事項を確約したこととなります。</p>
      <p>1.&nbsp;&nbsp;ご利用者が、暴力団、暴力団関係企業、総会屋若しくはこれらに準ずる者又はその構成（以下総称して「反社会的勢力」という）ではないこと。</p>
      <p>2.&nbsp;&nbsp;ご利用者またはご利用者の所属する団体、会社、機構などの組織にて、役員などの重要な職位(業務を執行する社員、取締役、執行役又はこれらに準ずる者をいう)に就くものが反社会的勢力ではないこと。 </p>
      <p>3.&nbsp;&nbsp;反社会的勢力に自己の名義を利用させ、この契約を締結するものでないこと。</p>
      <p>4.&nbsp;&nbsp;本商品の引渡し及び販売代金の全額の支払いのいずれもが終了するまでの間に、自らは第三者を利用して、この契約に関して次の行為をしないこと。</p>
      <p>&nbsp;&nbsp;a）相手方に対する脅迫的な言動又は暴力を用いる行為</p>
      <p>&nbsp;&nbsp;b）偽計又は威力を用いて相手方の業務を妨害し、又は信用を毀損する行為 </p>

      <p class="contract-margin">第6条　補足</p>
      <p>本規約の定めのない事項及び本規約の解釈について疑義が生じた場合、誠意を持って協議のうえ、解決に当たるものとします。</p>
     

      <p> class="contract-margin"第7条　管轄裁判所</p>
      <p>1.&nbsp;&nbsp;ご利用者と当社との間の本サイトの利用に関して、本規約により解決できない問題が生じた場合、ご利用者と当社とは誠意をもって協議しこれを解決するものとします。</p>
      <p>2.&nbsp;&nbsp;前項の規定にもかかわらず、協議によっても解決しない場合には、東京簡易裁判所または東京地方裁判所を第一審の専属管轄裁判所とします。</p>


      <p class="contract-margin">第8条　準拠法</p>
      <p>本利用規約の成立、効力、履行および解釈については、日本法を準拠法とします。</p>
     
      <p class="contract-margin">最終更新日 2018年11月13日 </p>`
          }
  }
}
</script>
<style lang="scss" scoped>
  div{
    font-size:16px;
    line-height:25px;
  }
</style>
