<template>
  <div class="container page-contract">
    <div>
      <h2>クラウドマイニング利用規約</h2>
      <h3>第１条　クラウドマイニング利用規約の同意</h3>
      <p>1.フィント株式会社（以下、「当社」と言います。）の運営するFinto.jp（以下、「本サイト」と言います）にて当社が提供するクラウドマイニングサービスのユーザーはクラウドマイニング規約（以下、「本規約」と言います）に記載されている条項に則るものとします。</p>
      <p>2.クラウドマイニングサービス（以下、「本サービス」と言います）とは、ユーザーが支払うご利用料金に応じて利用することができるハッシュパワーに基づき、仮想通貨を獲得するサービスです。</p>
      <p>3.ハッシュパワーとは当社が保有する仮想通貨のマイニング専用コンピュータハードウェア（以下、「マイニングマシン」と言います）の計算処理能力のことを言います。</p>
      <p>4.産出される仮想通貨の量は本サイトの購入ページに記載されている通りです。ただし、仮想通貨マーケットの変動やマイニング難易度の変動により本サイトに記載された数値などは当社がユーザーに対し確約するものではございません。</p>
      <p>5.ユーザーは、本規約に同意されることにより、本サイトで販売する本サービスをご注文していただくことができます。また、ユーザーは満年齢18歳以上であり、合法的に契約を締結することができる身分であることを表明した事となり、ユーザーが法人である場合は、ユーザー自身が代表者または契約締結権限の保有者である事を表明した事となります。</p>
      <p>6.ユーザーは、本規約同意後、本サービスの利用価格をお支払い後に利用契約が締結されるものとし、当社およびユーザーは本規約に定められた義務を負うものとします。</p>
      <h3>第２条　ご利用</h3>
      <p>ユーザーは、本規約に従い、本サイトに掲載された本サービスをご利用いただけます。</p>
      <h3>第3条　ご利用条件</h3>
      <p>1.本サイトに掲載されたクラウドマイニングの利用価格は税抜き価格です。</p>
      <p>2.本サイトに掲載されたクラウドマイニングの利用価格は予告なしに変更されることがあります。</p>
      <p>3.本サイトに記載がある各種予測数値（マイニングされるコインの枚数、収益など一切）はあくまでも予測であり、その数値は確約するものではありません。（仮想通貨のマーケット及び仮想通貨価格などにより変動します。）</p>
      <p>4.ご注文内容の確定後は、理由の如何を問わず変更・キャンセルはできません。</p>
      <p>5.当社の運営管理手数料として、ユーザーが利用したサービスから獲得された仮想通貨より、当社からユーザーへの仮想通貨を払い出す際に控除させていただきます。なお、運営管理手数料は本サイトに掲載されているの各サービスの購入ページに記載された通りです。</p>
      <p>6.ユーザーのご利用頂いたハッシュパワーに応じて、実際に消耗した電力に対し発生した電気代をご負担いただきます。この費用は、ユーザーが本サービスにより獲得された仮想通貨を当社からユーザーへの仮想通貨を払い出す際に控除させていただきます。</p>
      <p>7.仮想通貨のマーケット変動により、本サイトに掲載されたご利用価格などは、事前の通知なく金額の変動がある可能性があります。</p>
      <p>8.仮想通貨の価格変動やマイニング難易度の増減などによる要因で、獲得される仮想通貨が７日間連続して当社の運営管理手数料及び電気代に充当される仮想通貨よりも下回った場合、ユーザーの利益保護の観点から本サービスは、自動的に一時停止となります。なお、運営管理手数料と電気代などの清算後、当社の判断により本サービスの再始動ができる場合があります。</p>
      <p>9.仮想通貨市場は極めて早いスピードで変化を伴うものであり、各種仮想通貨の価格やハッシュパワー、運送費、電気代に関するデータ又は費用など（これらを含むがこれに限定されるものではない）は本サービスの途中でも変動が起こり得ることをご了承いただきます。またそれに伴い、本規約も事前の通知なく変更されることがあります。</p>
      <p>10.本サービスの途中解約については一切応じられません。</p>
      <p>11.原則として本サイトでのご注文は18歳以上のユーザーを対象とします。18歳未満のユーザーによるご注文は保護者の同意を必要とします。</p>
      <h3>第4条　ご注文とご成約</h3>
      <p>1.ユーザーは本サイトより当社指定の手続きに従い、本サービスのご注文をしていただけます。</p>
      <p>2.ユーザーが、本サイトでのご注文手続きと本サービスのご利用料金のお支払いを完了されますと、ご注文内容が確定（ご利用契約が成立）いたします。  尚、クレジットカードによる支払いの場合は、購入画面にクレジット情報を入力し、無事購入完了まで終えたタイミングでご注文内容は確定（売買契約が成立）します。ただし、お支払い方法を銀行振込にされた場合は、本サイトでのご注文手続き完了の際に、ご注文内容が確定するものとします。</p>
      <p>3.ご注文内容の確定後、ご利用料金を期限内にお支払いいただけない場合、このご注文内容はキャンセル（ご利用契約は初めからなかったことになり、それに関連・付随する当社およびご利用者の債権債務は発生しません。）とさせて頂きます。</p>
      <p>4.以下の項目のいずれかにユーザーが該当した場合、当社はご注文がキャンセルとなります。</p>
      <p class="type">1）クレジットカード決済の場合に、クレジットカード会社の承認が受けられないとき。</p>
      <p class="type">2) 前1号以外の決済方法の場合に、決済方法ごとに当社が定める期限内に代金がご入金されないとき。</p>
      <p>5.契約の成立後も、以下の事由が判明した場合、当社は無条件で契約を解除することができます。その場合、当社は一切の債務を負わず、またご利用者に対して損害賠償の請求を妨げるものではありません。</p>
      <p class="type">1）個人情報に虚偽の事実が認められた場合。</p>
      <p class="type">2）本サービスのうち販売を終了したにも関わらずそのご注文をお受けした場合。</p>
      <p class="type">3）ユーザーのご購入に数量制限を設けている場合に、それを越えたご注文をお受けした場合。</p>
      <p class="type">4）本サイトに表示された価格が市場相場等に比較して誤っていると当社が判断した場合。</p>
      <p class="type">5）転売、再販売または営利の目的のおそれがあるご注文をお受けした場合。</p>
      <p class="type">6）18歳未満のユーザーが保護者の同意を得ずにご注文された場合。</p>
      <p class="type">7）その他当社がご注文のお断りまたは契約の解除の必要を認めた場合。</p>
      <p class="type">8) 本規約に違反した場合</p>

      <h3>第5条　サービスの内容</h3>
      <p>1.ユーザーのお支払いが完了後、本サービスに定められたマイニング開始日より開始されます。開始日はクラウドマイニング商品毎によって異なります。詳細の開始日は各購入ページに記載されている通りです。</p>
      <p>2.本サービスのご利用期間は原則としてサービス開始日より２年間としますが、本サービスが定める契約期間が異なる期間の場合はその限りではありません。</p>
      <p>3.本サイトより毎日のご利用ステータスや獲得された仮想通貨の収支などの詳細情報がご覧いただけます。</p>

      <h3>第6条　お支払い</h3>
      <p>本サービスの利用料金やその他の料金・費用の算定方法などは、当社が定める通りとします。</p>
      <p>1.ご利用料金については、クレジットカード以外の決済方法をご選択の場合、注文より24時間以内に当社指定の口座および決済方法にてお支払いいただくものとします。</p>
      <p>2.本サービスより獲得される仮想通貨が電気代などの費用を下回った場合やその他費用が発生した場合、優先的に利用者のアカウント内の保有仮想通貨より控除させていただきます。もし利用者のアカウント内の保有仮想通貨が下回っている場合は、当社の指定する決済方法でお支払いいただきます。</p>

      <h3>第7条　当社の義務</h3>
      <p>当社は専門の技術管理人員、電力・電源設備、インターネット設備、セキュリティモニタリング、サーバー等、ユーザーが本サイトよりご利用いただいている本サービスの保守管理を行います。当社は善良なる管理者として以下のサービスをユーザーへ提供します。</p>
      <p>1.ユーザーが本サイトからご利用されたハッシュパワーの割り当て</p>
      <p>2.ユーザーが本サービスにより獲得された仮想通貨の払い出し</p>
      <p>3.本サービスを運営するに当たり必要となるその他一切の業務</p>

      <h3>第8条　仮想通貨のお引き出し</h3>
      <p>ユーザーは本サイトのアカウント内に保有された仮想通貨をユーザーが指定する仮想通貨ウォレットにお引き出しいただけます。ユーザーは本サイト内より引き出しの申請手続きを行うものとし、当社はその申請受領後２営業日以内にユーザーに対し送信作業を行います。なお、仮想通貨ウォレットの不具合や第三者によるハッキング、サイバー攻撃など（これらを含むがそれに限定されない）は一切責任を負いません。</p>

      <h3>第9条　禁止事項</h3>
      <p>以下の行為は禁止事項とします。当社により発覚した場合は、直ちにアカウントを凍結させていただきます。また、違法行為などについては、直ちに警察に通報の上、捜査協力のためにその利用者のアカウント情報、その他個人情報などを提示させていただきます。また、当社が被る経済的損失の請求をさせていただきます。</p>
      <p>1.ユーザーは、当社のサービスまたは当社のサービスを通じて提供されたコンテンツまたは情報を利用して、ビジネスまたはその他活動を行うこと、その他の違法行為、または当社が不適切と判断する目的のために使用する事は禁止します。</p>
      <p>２.ユーザーのアカウントは本人のみが使用できるものとし、アカウントの譲渡や本人以外が使用することを禁止します。</p>

      <h3>第10条　免責</h3>
      <p>1.当社の合理的な支配が及ばない事由（以下「不可抗力」という）による本契約に基づく当社の義務の不履行又は履行遅滞について、当社は一切の責任を負いません。不可抗力には天災、政府又は政府関連機関の行為、法律、規制又は命令の遵守、関係当局による立入検査、火災、暴風雨、洪水もしくは地震、戦争、反乱、革命もしくは暴動、ストライキ、もしくはロックアウトを含みますが、これらに限定されるものではありません。不可抗力が発生してから3日に以内に当社はマイニングサービスユーザーに対して状況のご説明を行います。発生より15日営業日たっても本契約の一部または全てが履行できない場合は、契約の解除、内容の変更又は延期についてユーザーと協議させていただきます。本契約の主要履行責任が１８０日間の履行困難に陥った時点で、当社又はユーザーのいずれも本契約を解除する権利を持ち、契約解除による一切の違約責任などは負わないものとします。</p>
      <p>2.天変地異、戦争、暴動、内乱、革命、法令の改廃制定、裁判所もしくは行政当局による命令処分、輸送機関の事故、その他の不可抗力により契約の履行が遅延し、または不可能となったときは、当社はユーザーに対し何等の責任も負いません。</p>
      <p>3.以下の例示の事項（それらに限らない）が起こった場合、当社は一切の責任を負いません。</p>
      <p class="type">1)仮想通貨の価格が暴落した場合の経済的損害</p>
      <p class="type">2)仮想通貨関連技術の大幅な成長により、ユーザーが購入された商品からマイニングされる仮想通貨の量が下がった場合の経済的損害</p>
      <p class="type">3)保守管理時の損壊、不慮の時間度での損壊、運送中などの不可抗力にて損壊した場合</p>
      <p class="type">4)停電、突然の電力遮断などの事故が発生した際にユーザーが購入された商品が一時的に停止した際の経済的又は物理的な損害</p>
      <p class="type">5)ネット上のシステムダウンや第三者の不正アクセスが原因として生じたデータ消去などによる損害</p>
      <p class="type">6)その他、管理者である当社が想定し得ないことによる損害</p>

      <h3>第11条　不可抗力</h3>
      <p>当社の合理的な支配が及ばない事由（以下「不可抗力」という）による本契約に基づく当社の義務の不履行又は履行遅滞について、当社は一切の責任を負いません。不可抗力には天災、政府又は政府関連機関の行為、法律、規制又は命令の遵守、関係当局による立入検査、火災、暴風雨、洪水もしくは地震、戦争、反乱、革命もしくは暴動、ストライキ、もしくはロックアウトを含みますが、これらに限定されるものではありません。不可抗力が発生してから3日に以内に当社はマイニングサービスユーザーに対して状況のご説明を行います。発生より15日営業日たっても本契約の一部または全てが履行できない場合は、契約の解除、内容の変更又は延期についてユーザーと協議させていただきます。本契約の主要履行責任が１８０日間の履行困難に陥った時点で、当社又はユーザーのいずれも本契約を解除する権利を持ち、契約解除による一切の違約責任などは負わないものとします。</p>
      
      <h3>第12条　契約の解除</h3>
      <p>1.当社又はユーザーが以下の一つに該当した際は、催告なしに直ちに本契約ならびにこれに基づく個別契約の一部または全部を解除することができます。</p>
      <p class="type">1)本契約あるいは個別契約の条項に違反した時</p>
      <p class="type">2)銀行取引停止処分を受けた時</p>
      <p class="type">3)第三者から強制執行を受けた時</p>
      <p class="type">4)破産・民事再生、または会社更生などの申し立てがあった時</p>
      <p class="type">5)信用状態の悪化など、あるいはその他契約の解除につき、相当の事由が認められる時</p>
      <p class="type">6)反社会的勢力の構成員もしくは関係者であることが判明した時</p>
      <p class="type">7)仮想通貨市場の変動により商品の提供が困難になった時[第１章第２条６]</p>

      <p>2.いかなる理由があろうとも、契約の解除にあたっては、返金や返品またはサービス解除については原則的に行わないものとします。また、当社が被った経済的損害[ご注文いただいた機器＝経済的損害とする。]（についてご請求させていただく場合がございます。</p>
      <p>3.経済的損害として以下を違約金としてお支払いただきます。</p>
      <p class="type">1)ご利用頂いたご利用価格の２倍</p>
      
      <h3>第13条　秘密情報・個人情報の取り扱い</h3>
      <p>当社はユーザーより知り得たいかなる情報（技術上、営業上又はその他の業務上の情報）を事前にユーザーからの書面による承諾を受けることなく、第三者に開示することはございません。ただし次の各号のいずれか一つに該当する情報についてはこの限りではありません。</p>
      <p>1.ユーザーから情報の提供を受けた時、既に公知であった情報</p>
      <p>2.ユーザーから情報の提供を受けた時、公知となった情報</p>
      <p>3.秘密保持義務を負うことなく、すでに保有している情報</p>
      <p>いかなる個人情報または秘密情報について、当社は善良なる管理者として情報管理に必要な措置を講じます。</p>

      <h3>第14条　権利</h3>
      <p>本サービスは本サイト及び本サービスの技術・商標・著作権などそれらを使用したサービス、またはその一部の所有権または財産権を利用者に貸与または譲渡するものではなく、すべての権利、権限および利益は、当社に帰属します。</p>

      <h3>第15条　反社会的勢力の排除</h3>
      <p>1.ユーザーが、暴力団、暴力団関係企業、総会屋若しくはこれらに準ずる者又はその構成（以下総称して「反社会的勢力」という）ではないこと。</p>
      <p>2.ユーザーまたはユーザーの所属する団体、会社、機構などの組織にて、役員などの重要な職位(業務を執行する社員、取締役、執行役又はこれらに準ずる者をいう)に就くものが反社会的勢力ではないこと。 </p>
      <p>3.反社会的勢力に自己の名義を利用させ、この契約を締結するものでないこと。</p>
      <p>4.本サービスの引渡し及び販売代金の全額の支払いのいずれもが終了するまでの間に、自らは第三者を利用して、この契約に関して次の行為をしないこと。</p>
      <p class="type">a)相手方に対する脅迫的な言動又は暴力を用いる行為</p>
      <p class="type">b)偽計又は威力を用いて相手方の業務を妨害し、又は信用を毀損する行為</p>

      <h3>第16条　補足</h3>
      <p>本規約の定めのない事項及び本規約の解釈について疑義が生じた場合、誠意を持って協議のうえ、解決に当たるものとする。</p>
      <h3>第17条　管轄裁判所</h3>
      <p>1.ユーザーと当社との間の本サイトの利用に関して、本規約により解決できない問題が生じた場合、ユーザーと当社とは誠意をもって協議しこれを解決するものとします。</p>
      <p>2.前項の規定にもかかわらず、協議によっても解決しない場合には、東京簡易裁判所または東京地方裁判所を第一審の専属管轄裁判所とします。</p>
      <h3>第18条　準拠法</h3>
      <p>本利用規約の成立、効力、履行および解釈については、日本法を準拠法とします。</p>

      <h3>最終更新日 2018年11月13日</h3>
    </div>
  </div>
</template>

<script>
  export default {
    head() {
      return {
        title: 'クラウドマイニング利用規約_FinTo-ワンストップのマイニング機械委託、販売、クラウドマイニング賃貸のプラットフォーム'
      };
    },
    data() {
      return {
        expressTotalAmount: '',
        trustTotalAmount: ''
      };
    },
    mounted() {
      // this.expressTotalAmount = this.$route.query.expressTotalAmount;
      // this.trustTotalAmount = this.$route.query.trustTotalAmount;
    },
    watch: {
      $route() {
        this.expressTotalAmount = this.$route.query.expressTotalAmount;
        this.trustTotalAmount = this.$route.query.trustTotalAmount;
      }
    }
  };
</script>

<style scoped>
  .container {
    width: 1200px;
    margin: 0 auto;
    padding: 40px 50px;
  }
</style>
