<template>
  <div class="container page-contract">
    <div v-if="trustTotalAmount>0">
      <h2>売買契約・保守管理委託契約書</h2>
      <p>
        買主ならびに委託者である：____________________________（以下「甲」という）と売主ならびに受託者である：フィント株式会社（以下「乙」という）とは、本契約書記載の商品（以下「本商品」とする。）の売買および保守管理委託契約に関し、以下のとおり契約を締結する。</p>
      <h3>第1条 (売買に関する基本合意)</h3>
      <p>
        乙は甲に対し、本商品を甲に売り渡すことを約し、甲はこれを買受けることを約する。ただし、仮想通貨等のマーケットの変動により、本商品の価格は事前の通知なく調整が入る可能性があることを甲は了承する。変動がある際には乙は甲に対し事前に通知を行い、甲はその差額を支払うこととする。</p>
      <h3>第2条 (保守管理業務を委託する場合の引渡し)</h3>
      <p>甲が乙に対し、保守管理業務を委託を希望する場合、乙は甲に対し、次のとおりの条件にて、本件商品を引き渡す。</p>
      <p>1.納入先　：乙の指定するマイニングファーム</p>
      <p>2.納品期日：代金受領日より2ヶ月間以内具体的な日時は申込後に乙より甲に通知する</p>
      <p>3.納品確認：乙は甲の代理として納品確認を行う。なお、甲は乙より提供されるウェブ管理システムにて確認できるものとする</p>
      <h3>第3条（売買代金の支払い）</h3>
      <p>甲は本商品の引渡し場所に関わらず、乙に対し本商品の代金を５営業日以内にクレジットカード、銀行振込またはコンビニ払いなど、乙が提供する決済方式で支払うものとする。なお振込手数料は、甲の負担とする。</p>
      <h3>第4条 （キャンセル及び返金）</h3>
      <p>本商品は、一般的な電子製品ではなく、顧客の要望から特別に製造された製品であるため、甲は本契約締結後はキャンセルはできないものとする。</p>
      <h3>第5条 （保証及びアフターサービス）</h3>
      <p>本商品における保証およびアフターサービスは以下の通りとし、製造元が提供する。乙は保証及びアフターサポートを行う義務は負わない。</p>
      <p>1.納品日より180日間について、通常の方法で使用した製品が保証期間内に故障した場合に、製品を無償で修理または交換する。</p>
      <p>2.以下の状況については、保証及びアフターサポートは対象外である。</p>
      <p class="type">a)故意に本商品を損壊させた場合</p>
      <p class="type">b)本商品を改造、分解、その他部品の交換を行なった場合</p>
      <p class="type">c)落雷、サージ電圧などの電源や電圧により損壊した場合</p>
      <p class="type">d)水分の流入、湿気によるICチップその他電子部品異変・故障、またはそれらが原因で腐食し、本商品が損壊した場合</p>
      <p class="type">e)回路版に焦げ跡が残っている、またはチップが燃えた場合</p>
      <p class="type">f)本商品本来の目的とは異なった使用又は正常な使用を怠った場合</p>
      <h3>第6条 （売買契約に関する違約責任）</h3>
      <p>
        1.甲が本契約に定められた支払い義務の履行しない場合、乙は本商品を回収することができる。また、甲の不履行に起因して生じた、回収費用やそれに限らない経済的損失など、乙が被る全ての損失は違約金として甲は乙に支払うものとする。</p>
      <p>2.乙が本契約通りに本商品の提供ができない場合、乙は納品期限日から50日以内に甲から支払われた金額を返金する。</p>
      <h3>第7条 （遅延損害金）</h3>
      <p>甲が第3条に記載の代金の支払いを怠ったときは、乙に対し、支払期日の翌日から完済の日までに年18%の割合による遅延損害金(年365日の日割計算)を付加して支払わなければならない。</p>
      <h3>第8条 （保守管理の委託をする機器と内容）</h3>
      <p>1.乙は機器について保守管理を行う。</p>
      <p>2.甲は機器をマイニングファームまでの運送、設置、インストレーション等及び保守管理業務を乙に委託し、乙はそれを受託する。</p>
      <p>3.保守管理業務の開始時期は機器の納品日から起算して2ヶ月以内とし、具体的な日時は乙が提供するウェブ管理システムにて確認するものとする。</p>
      <p>4.保守管理業務の期間は業務の開始より2年間とする。</p>
      <h3>第9条 （保守管理業務）</h3>
      <p>
        乙は専門の技術管理人員、電力・電源設備、インターネット設備、セキュリティモニタリング、サーバー等、甲の機器の保守管理業務を行うにあたり、必要なサービス及び環境を提供するものとし、乙は善良なる管理者としての注意をもって、以下の業務を行う。</p>
      <p>1.甲より委託された機器の設置・インストール・システム設定など</p>
      <p>2.甲より委託された機器の定期的な確認</p>
      <p>3.甲より委託された機器が産出した仮想通貨の払出し</p>
      <p>4.甲より委託された機器のトラブル時の対応</p>
      <p>5.甲より委託された機器の保守運営に関わるその他一切の業務</p>
      <h3>第10条 （保守管理業務に関する実費等の費用負担）</h3>
      <p>
        保守管理業務を行うに際し発生した電気代、メンテナンス費、機器修理等のための運送費など必要な費用は甲の負担とする。ただし、乙に重大な過失があり、機器に損傷をもたらした場合は、乙の負担とする。なお、電気代については、機器が産出した仮想通貨で支払うものとする。
      </p>
      <h3>第11条 （保守管理業務委託費用）</h3>
      <p>甲は乙に対して保守管理業務の委託費用を支払うものとする。</p>
      <p>1.甲は乙に対して本機器の保守管理の委託費用として、本機器より産出された仮想通貨の合計数の10%を支払うものとする。</p>
      <p>2.委託費用の支払い時期及び方法は、機器が産出した仮想通貨を払い出す際に差し引くものとする。</p>
      <h3>第12条 （保守管理委託契約の更新）</h3>
      <p>契約の更新は甲または乙の書面による契約解除の申し出がない限り、自動更新とする。</p>
      <h3>第13条 （保守管理委託契約の終了）</h3>
      <p>
        乙の本機器が7日間に渡り、日割りの電力金額に満たない仮想通貨の産出しかできない場合、または事前に甲乙共に本機器の売却に合意した場合、乙は本契約の解除の権利を有するものとし、合意に至った日付にて清算を行う。清算時に甲は本機器の市場価格での売却・処分を乙に委託することができるものとする。</p>
      <h3>第14条 （保守管理委託内容やデータ及び費用などの変動）</h3>
      <p>仮想通貨市場は極めて早いスピードで変化を伴うものであり、ハッシュパワー、運送費、電気代に関するデータ又は費用などは小規模な変動があることを甲は理解し、承諾する。</p>
      <h3>第15条 （保守管理委託に関する免責事項）</h3>
      <p>以下における事項が起こった場合、乙は一切の責任を負わない。</p>
      <p>1.仮想通貨の価格が暴落した場合の経済的損害</p>
      <p>2.仮想通貨関連技術の大幅成長により、本機器からマイニングされる仮想通貨の量が下がった場合の経済的損害</p>
      <p>3.機器の保守管理時の損壊、不慮の事故などでの損壊、運送中などの不可抗力にて損壊した場合</p>
      <p>4.マイニングファームにて、停電、突然の電力遮断などの事故が発生した際に機器が一時的に停止した場合の経済的または物理的な損害</p>
      <p>5.ネット上のシステムダウンや第三者の不正アクセスが原因として生じたデータ消去などによる損害</p>
      <h3>第16条 （反社会的勢力の排除）</h3>
      <p>甲及び乙は、それぞれ相手方に対し、次の各号の事項を確約する</p>
      <p>1.自らが、暴力団、暴力団関係企業、総会屋若しくはこれらに準ずる者又はその構成（以下総称して「反社会的勢力」という）ではないこと。</p>
      <p>2.自らの役員(業務を執行する社員、取締役、執行役又はこれらに準ずる者をいう)が反社会的勢力ではないこと。</p>
      <p>3.反社会的勢力に自己の名義を利用させ、この契約を締結するものでないこと。</p>
      <p>4.本物件の引渡し及び売買代金の全額の支払いのいずれもが終了するまでの間に、自らは第三者を利用して、この契約に関して次の行為をしないこと。</p>
      <p class="type">a) 相手方に対する脅迫的な言動又は暴力を用いる行為</p>
      <p class="type">b) 偽計又は威力を用いて相手方の業務を妨害し、又は信用を毀損する行為</p>
      <h3>第17条 （不可抗力）</h3>
      <p>
        いずれの当事者も、相手方に対し、自己の合理的な支配が及ばない事由（以下「不可抗力」という。）による本契約に基づく自己の義務の不履行または履行遅滞について、責任を負わない。不可抗力には天災、政府または政府機関の行為、法律、規制または命令の遵守、関係当局による立入検査、火災、暴風雨、洪水もしくは地震、戦争（宣戦布告の有無を問わない。）、反乱、革命もしくは暴動、またはストライキもしくはロックアウトを含むが、これらに限定されない。　不可抗力が発生してから３日以内に当事者は相手に対して状況説明を書面にて行うものとする。影響を受けた当事者は、不可抗力による不履行または履行遅滞の影響が軽減されるようあらゆる努力を尽くさなければならない。発生より15日営業日経っても、本契約の一部または全てが履行できない場合は、甲又は乙は本契約の解除、内容の変更または延期について協議する。契約の主要履行責任が180日間の履行困難になった時点で、甲乙いずれの一方も本契約を解除する権利を有し、契約解除による一切の違約責任などは負わないものとする。</p>
      <h3>第18条 （契約解除）</h3>
      <p>1.甲または乙は、他の当事者が次の各号の一つに該当したときは、催告なしにただちに、本契約およびこれにもとづく個別契約の全部または一部を解除することができる。</p>
      <p class="type">a) 本契約あるいは個別契約の条項に違反したとき</p>
      <p class="type">b) 銀行取引停止処分を受けたとき</p>
      <p class="type">c) 第三者から強制執行を受けたとき</p>
      <p class="type">d) 破産・民事再生、または会社更生等の申立があったとき</p>
      <p class="type">e) 信用状態の悪化等あるいはその他契約の解除につき、相当の事由が認められるとき</p>
      <p>2.甲は契約解除等により乙に対して与えた損害を賠償する義務を負う。</p>
      <h3>第19条 (秘密情報の取り扱い) </h3>
      <p>
        1.甲及び乙は、委託業務の遂行に伴い相手方より提供を受けまたは知り得た技術上、営業上その他の業務上の情報、又はマイニングファームの詳細情報(甲の顧客に関する情報を含み媒体を問わない、以下「秘密情報」という。)を、事前に相手方から書面による承諾を受けることなく第三者に開示または漏洩してはならない。ただし、次の各号の何れか一つに該当する情報についてはこの限りでない。 </p>
      <p class="type">a) 相手方から提供を受けたとき、既に公知であった情報</p>
      <p class="type">b) 相手方から提供を受けた後、公知となった情報 </p>
      <p class="type">c) 秘密保持義務を負うことなく、既に保有している情報</p>
      <p>2.秘密情報の提供を受けた甲又は乙は、当該秘密情報の管理に必要な措置を講ずるものとする。 </p>
      <p>3.甲及び乙は、相手方より提供を受けた秘密情報を本契約の目的の範囲内でのみ使用するものとし、当該秘密情報の複製または改変が必要なときには、事前に相手方から書面による承諾を受けるものとする。 </p>
      <p>4.本条の規定は、本契約終了後も存続する。</p>
      <h3>第20条　 (補足)</h3>
      <p>本契約の定めない事項及び本契約の解釈について疑義が生じた事項については、甲乙誠意をもって協議のうえ、解決にあたるものとする。</p>
      <h3>第21条 (管轄裁判所)</h3>
      <p>甲及び乙は、本契約に関連して又は付随して発生した紛争については、その訴額に応じて東京簡易裁判所又は東京地方裁判所を第一審の専属的合意管轄裁判所とすることに合意する。</p>
      <h3>第22条 (準拠法)</h3>
      <p>本契約は、日本国法に準じて解釈される。</p>
      <p>この契約を証するため本書2通を作成し、各自署名捺印の上、各1通を保有する。</p>
      <p class="date"> 年　 月　 日</p>
      <el-row class="company-info">
        <el-col :span="12">
          <p>甲　住所：　</p>
          <p> 氏名：　 </p>
          <p>_________印</p>
        </el-col>
        <el-col :span="12">
          <p>乙　東京都千代田区丸の内1-11-1</p>
          <p> パシフィックセンチュリープレイス丸の内8FF</p>
          <p> フィント株式会社　</p>
          <p>代表取締役　島津　秀和　 印</p>
        </el-col>
      </el-row>
      <table>
        <tr>
          <td>機器名</td>
          <td>単価（円）</td>
          <td>台数</td>
          <td>セットアップ費（円／台）</td>
          <td>小計（円）</td>
        </tr>
        <tr>
          <td></td>
          <td></td>
          <td></td>
          <td></td>
          <td></td>
        </tr>
        <tr>
          <td class="total">合計（円）</td>
          <td colspan="4"></td>
        </tr>
      </table>
    </div>
    <div v-if="expressTotalAmount>0">
      <h2>売　買　契　約　書</h2>
      <table>
        <tr>
          <td>機器名</td>
          <td>単価（円）</td>
          <td>台数</td>
          <td>セットアップ費（円／台）</td>
          <td>小計（円）</td>
        </tr>
        <tr>
          <td></td>
          <td></td>
          <td></td>
          <td></td>
          <td></td>
        </tr>
        <tr>
          <td class="total">合計（円）</td>
          <td colspan="4"></td>
        </tr>
      </table>
      <p>
        買主：____________________________（以下「甲」という）と売主：フィント株式会社 （以下「乙」という）とは、上記記載の商品（以下「本商品」とする。）の売買に関し、以下のとおり契約を締結する。</p>
      <h3>第1条 (基本合意)</h3>
      <p>
        乙は甲に対し、本商品を甲に売り渡すことを約し、甲はこれを買受けることを約する。ただし、仮想通貨等のマーケットの変動により、本商品の価格は事前の通知なく調整が入る可能性があることを甲は了承する。変動がある際には乙は甲に対し事前に通知を行い、甲はその差額を支払うこととする。</p>
      <h3>第2条　 (日本国内での引渡し) </h3>
      <p>甲が日本国内で本商品の引渡しを希望する場合、乙は甲に対し、次のとおりの条件にて、本件商品を引き渡す。 </p>
      <p>1.納入先　：甲の指定する日本国内の住所</p>
      <p>2.納品期日：代金受領日より2ヶ月間以内,具体的な日時は申込後に乙より甲に通知する</p>
      <h3>第3条 （代金の支払い）</h3>
      <p>1.甲は乙に対し本商品の代金を５営業日以内にクレジットカード、銀行振込またはコンビニ払いなど、乙が提供する決済方式で支払うものとする。なお振込手数料は、甲の負担とする。</p>
      <p>2.甲が日本国内での引き渡しを希望した場合、本商品の運送にかかる費用は甲の負担とし、乙は甲に費用を通知する。なお、甲は前項の代金と共に支払うものとする。</p>
      <p>3.甲が日本国内での引き渡しを希望する場合、関税などの本商品の輸入に関する税金については、甲の負担とし、乙は一切の支払い義務を負わない。</p>
      <h3>第4条 （キャンセル及び返金）　</h3>
      <p>本商品は、一般的な電子製品ではなく、顧客の要望から特別に製造された製品であるため、甲は本契約締結後はキャンセルはできないものとする。</p>
      <h3>第5条 （保証及びアフターサービス）</h3>
      <p>本商品における保証およびアフターサービスは以下の通りとし、製造元が提供する。乙は保証及びアフターサポートを行う義務は負わない。</p>
      <p>1.納品日より180日間について、通常の方法で使用した製品が保証期間内に故障
        した場合に、製品を無償で修理または交換する。</p>
      <p>以下の状況については、保証及びアフターサポートは対象外である。</p>
      <p class="type">a)故意に本商品を損壊させた場合</p>
      <p class="type">b)本商品を改造、分解、その他部品の交換を行なった場合</p>
      <p class="type">c)落雷、サージ電圧などの電源や電圧により損壊した場合</p>
      <p class="type">d)水分の流入、湿気によるICチップその他電子部品異変・故障、またはそれらが原因で腐食し、本商品が損壊した場合</p>
      <p class="type">e)回路版に焦げ跡が残っている、またはチップが燃えた場合</p>
      <p class="type">f)本商品本来の目的とは異なった使用又は正常な使用を怠った場合</p>
      <h3>第6条 （違約責任）</h3>
      <p>
        1.甲が本契約に定められた支払い義務の履行しない場合、乙は本商品を回収することができる。また、甲の不履行に起因して生じた、回収費用やそれに限らない経済的損失など、乙が被る全ての損失は違約金として甲は乙に支払うものとする。</p>
      <p>2.乙が本契約通りに本商品の提供ができない場合、乙は納品期限日から50日以
        内に甲から支払われた金額を返金する。</p>
      <h3>第7条 （遅延損害金）</h3>
      <p>甲が第3条に記載の代金の支払いを怠ったときは、乙に対し、支払期日の翌日から完済の日までに年18%の割合による遅延損害金(年365日の日割計算)を付加して支払わなければならない。 </p>
      <h3>第8条 （反社会的勢力の排除）</h3>
      <p>甲及び乙は、それぞれ相手方に対し、次の各号の事項を確約する。 </p>
      <p>1.自らが、暴力団、暴力団関係企業、総会屋若しくはこれらに準ずる者又はその構成（以
        下総称して「反社会的勢力」という）ではないこと。</p>
      <p>2.自らの役員(業務を執行する社員、取締役、執行役又はこれらに準ずる者をいう)が反社会的勢力ではないこと。 </p>
      <p>3.反社会的勢力に自己の名義を利用させ、この契約を締結するものでないこと。</p>
      <p>4.本物件の引渡し及び売買代金の全額の支払いのいずれもが終了するまでの間に、自ら は第三者を利用して、この契約に関して次の行為をしないこと。</p>
      <p class="type">a)相手方に対する脅迫的な言動又は暴力を用いる行為</p>
      <p class="type">b)偽計又は威力を用いて相手方の業務を妨害し、又は信用を毀損する行為 </p>
      <h3>第9条 （不可抗力）</h3>
      <p>
        1.いずれの当事者も、地震、台風、津波その他の天変地異、戦争、暴動、内乱、 政府、地方公共団体の命令規制、法令の改正など当事者の責めに帰すことのできない事情(以下、「不可抗力」という。)による本契約の全部
        または一部が履行不能または履行遅滞となった場合、甲及び乙はその責任を負わないものとし、発生より15日営業日経っても、本契約の一部または全てが履行できない場合は、甲又は乙は本契約の解除、内容の変更または延期について協議する。契約の主要履行責任が180日間の履行困難になった時点で、甲乙いずれの一方も本契約を解除する権利を有し、契約解除による一切の違約責任などは負わないものとする。</p>
      <p>2.前項の不可抗力が発生し、自己の債務が履行不能または履行遅滞になるおそれがある場合には直ちに相手方に書面をもって通知する。</p>
      <h3>第10条 （契約解除）</h3>
      <p>1.甲または乙は、他の当事者が次の各号の一つに該当したときは、催告なしにただちに、本契約およびこれにもとづく個別契約の全部または一部を解除することができる。</p>
      <p class="type">a)本契約あるいは個別契約の条項に違反したとき</p>
      <p class="type">b)銀行取引停止処分を受けたとき</p>
      <p class="type">c)第三者から強制執行を受けたとき</p>
      <p class="type">d)破産・民事再生、または会社更生等の申立があったとき</p>
      <p class="type">e)信用状態の悪化等あるいはその他契約の解除につき、相当の事由が認められるとき</p>
      <p>2.甲は契約解除等により乙に対して与えた損害を賠償する義務を負う。</p>
      <h3>第11条　 (補足)</h3>
      <p>本契約の定めない事項及び本契約の解釈について疑義が生じた事項については、甲乙誠意をもって協議のうえ、解決にあたるものとする。</p>
      <h3>第12条 (管轄裁判所)</h3>
      <p>甲及び乙は、本契約に関連して又は付随して発生した紛争については、その訴額に応じて東京簡易裁判所又は東京地方裁判所を第一審の専属的合意管轄裁判所とすることに合意する。</p>
      <h3>第13条 (準拠法)</h3>
      <p>本契約は、日本国法に準じて解釈される。</p>
      <p>この契約を証するため本書2通を作成し、各自署名捺印の上、各1通を保有する。</p>
      <p class="date"> 年　 月　 日</p>
      <el-row class="company-info">
        <el-col :span="12">
          <p>甲　住所：　</p>
          <p> 氏名：　 </p>
          <p>_________印</p>
        </el-col>
        <el-col :span="12">
          <p>乙　東東京都千代田区丸の内1-11-1</p>
          <p> パシフィックセンチュリープレイス丸の内8F</p>
          <p> フィント株式会社　</p>
          <p>代表取締役　島津　秀和　 印</p>
        </el-col>
      </el-row>
    </div>
  </div>
</template>

<script>
  export default {
    head() {
      return {
        title: '売買契約・保守管理委託契約書_FinTo-ワンストップのマイニング機械委託、販売、クラウドマイニング賃貸のプラットフォーム'
      };
    },
    data() {
      return {
        expressTotalAmount: '',
        trustTotalAmount: ''
      };
    },
    mounted() {
      this.expressTotalAmount = this.$route.query.expressTotalAmount;
      this.trustTotalAmount = this.$route.query.trustTotalAmount;
    },
    watch: {
      $route() {
        this.expressTotalAmount = this.$route.query.expressTotalAmount;
        this.trustTotalAmount = this.$route.query.trustTotalAmount;
      }
    }
  };
</script>

<style scoped>
  .container {
    width: 1200px;
    margin: 0 auto;
    padding: 40px 50px;
  }
</style>
