<template>
  <div class="container">
    <h2>预售合同</h2>
    <p>合同签订地点：上海</p>
    <p>合同签定日期：</p>
    <p>合同编号：WL-XB-1-02</p>
    <p class="seller">代销单位（卖方）：上海挖链科技有限公司</p>
    <p class="buyer">订货单位（买方）：</p>
    <p>根据《中华人民共和国合同法》的规定，本着平等、自愿、诚实信用的原则，卖方作为供货方的代销单位，经与买方友好协商，特订立本协议，以兹双方共同遵守：</p>
    <h3>1) 合同标的：合同标的：本合同标的以附件一《订单详情表》为准，明确展示标的产品的详情及价格等信息。《订单详情表》是本合同不可分割的组成部分，与本合同具有同等的法律效力。</h3>
    <h3>2) 交货方式及运输</h3>
    <p>2.1、交货地点： </p>
    <p>2.2、交货日期： </p>
    <p>2.3、运输方式：货运</p>
    <p>2.4、包装及运杂费：买方承担</p>
    <p>2.5、买方签收人应以收到符合标准的货物的同时验收完成后在货物清单进行签字并盖章确认。</p>
    <h3>3) 结算方式和期限：</h3>
    <p>3.1、买卖双方合同款项结算方式及期限为：</p>
    <table>
      <tr>
        <td>付款时间</td>
        <td>付款金额</td>
        <td>备注</td>
      </tr>
      <tr>
        <td></td>
        <td></td>
        <td>全款</td>
      </tr>
      <tr>
        <td class="total">合计：</td>
        <td></td>
        <td></td>
      </tr>
    </table>
    <p>3.2、卖方收款方式为：</p>
    <p><input type="checkbox" id="pay"/><label for="pay">汇款</label></p>
    <table>
      <tr>
        <td rowspan="3">银行付款信息</td>
        <td>收款人姓名：上海挖链科技有限公司</td>
      </tr>
      <tr>
        <td>收款账户：15000091573845</td>
      </tr>
      <tr>
        <td>开户行：平安银行上海新天地支行</td>
      </tr>
    </table>
    <p><input type="checkbox" id="online"/><label for="online">通过卖方平台线上支付</label></p>
    <p>3.3、结算方式：人民币。若买方需要开票，卖方应提供由供货方开具的正规增值税发票给买方。</p>
    <h3>4) 验收规定：</h3>
    <p>4.1、收货时买方应检查产品各项标识、单据、数量等；若发现与合同规定不符，签收货物时应在签收单上加注，否则视为卖方交货在上述方面符合合同规定。</p>
    <p>
      4.2、配置、规格、型号、质量异议期限为卖方交货后二日内，此期间，买方应逐件仔细检验货物，一旦发现存在与合同不符之地，须立即停止拆包、开箱、开机检验并通知卖方前来联检。若在卖方到达前两件或以上被拆包、开箱或开机的产品被发现存在质量或性能问题，卖方只承担其中一件的、属于最轻责任的产品责任，其余产品概不负责。</p>
    <h3>5) 保修与售后服务：</h3>
    <p>本产品售后政策如下：一旦购买，即视为对本合同的认同。</p>
    <p>5.1、此货物不同于一般的消费类电子产品，而是根据顾客需求特殊定制的产品，付款后不能退款、退货，投资需谨慎。由于市场原因，货物价格可能会随时调整而不做事先通知和价格补偿。</p>
    <p>5.2、保修与售后服务由生产厂商直接提供，与卖方无关。</p>
    <p>5.3、正常情况下（非人为损坏），软、硬件保修期为厂家实际保修为准。</p>
    <p>在保修期外，由厂家向买方提供有偿服务，服务费按厂家标准执行。以下情况会使保修失效：</p>
    <p>1) 、机器本身被拆卸，私自改动，更换元器件；</p>
    <p>2) 、雷击，电压浪涌，劣质电源等造成的损坏；</p>
    <p>3) 、进水、电路板和元器件受潮、出现腐蚀造成的损坏；</p>
    <p>4) 、电路板存在烧毁痕迹的或者芯片被烧毁的。</p>
    <p>5.4、卖方在保修期和售后服务另有承诺的，应当另外书面约定，作为本合同的附件，否则适用上款。</p>
    <h3>6) 所有权与风险转移：</h3>
    <p>6.1、买方支付全部货款前，货物的所有权归卖方所有。</p>
    <p>6.2、买方已经将货物出售给第三方，则卖方可以直接对第三方享有债权。</p>
    <p>6.3、货物的风险责任由卖方发出货物或买方提货之日起转移至买方承担。</p>
    <h3>7) 违约责任：</h3>
    <p>7.1、如买方未按合同约定的付款期限履行付款义务，卖方有权以任何方式将货物收回，买方须承担因违约而给卖方造成的经济损失，包括但不限于违约金、收回货物的运费及其他费用等。卖方无需退回货款给买方且买方先前所付订金不予退回。</p>
    <p>7.2、若因厂家不能供货致使卖方不能按本合同交货时，不视为卖方违约。卖方在交货期限后三日内金额退回买方已支付的订金或货款。</p>
    <h3>8) 不可抗力：</h3>
    <p>
      因地震、暴风雨、洪水、水灾、其它自然事件、战争、暴乱、内战、公众骚乱、公众敌对事件等不可抗力事件的发生，导致合同不能全部或部分履行（或适当履行）的，免除相应的违约责任，受影响的一方，应立即将情况通知对方，并在15个工作偿提供事件详情以及合同不能履行、或部分不能履行、或需要延期履行的理由的有效证明文件，按不可抗力事件对履行本合同的影响程度，由双方协商决定是否解除合同、部分免除或变更合同责任，或延期履行合同。若受不可抗力事件影响，使本合同主要义务之履行延迟的时间超过180天，则任何一方均有权解除合同而不承担任何后果，也可由双方协商采取补救措施。</p>
    <h3>9) 争议解决：</h3>
    <p>若履行本合同产生的任何争议，双方应通过友好协商解决，协商不成的，双方约定任何一方可通过向签约地法院诉讼解决。</p>
    <h3>10) 其他说明：</h3>
    <p>10.1、合同附件是本合同不可分割的重要组成部分，与本合同具有同等的法律效力。</p>
    <p>10.2、若合同有其他相关补充说明，则可经双方协商一致，签订补充协议，与合同具有同等法律效力；若与本合同中的相应条款发生冲突，则以补充协议条款规定为准。</p>
    <h3>11) 生效：</h3>
    <p>
      本合同经双方代表签字盖章后即视为生效，本合同一式贰份，买卖双方各执壹份，具有同等效力。若本合同采用电子文本形式在线签署，则经买方通过平台电子合同签署系统在线点击确认后即视为生效，并留存于卖方平台为此设立的专用服务器上备查，甲、乙双方均确认本合同的真实性并认可合同的法律效力。</p>
    <el-row class="company-info">
      <el-col :span="12">
        <p>卖方：上海挖链科技有限公司</p>
        <p>公司（盖章）签字：</p>
        <p>地址：上海市徐汇区云锦路500号</p>
        <p class="address">绿地汇中心B座12楼</p>
        <p>电话：021-60514706</p>
        <p>日期：</p>
      </el-col>
      <el-col :span="12">
        <p>买方：</p>
        <p>公司（盖章）签字：</p>
        <p>地址：</p>
        <p>&nbsp</p>
        <p>电话：</p>
        <p>日期：</p>
      </el-col>
    </el-row>
    <h3>附件一：《订单详情表》</h3>
    <table>
      <tr>
        <td>型号</td>
        <td>数量</td>
        <td>单价</td>
        <td>金额</td>
        <td>备注</td>
      </tr>
      <tr>
        <td>雪豹A1 49T超级计算机</td>
        <td></td>
        <td></td>
        <td></td>
        <td>含电源+电源线</td>
      </tr>
      <tr>
        <td>雪豹E3 230M超级计算机</td>
        <td></td>
        <td></td>
        <td></td>
        <td></td>
      </tr>
      <tr>
        <td>iBeLink_DSM 6T超级计算机</td>
        <td></td>
        <td></td>
        <td></td>
        <td></td>
      </tr>
      <tr>
        <td>实际结算合计：</td>
        <td colspan="4">__________（人民币：______________）</td>
      </tr>
    </table>
    <p>备注：本次销售价格为含税价格</p>
  </div>
</template>

<script>
  export default {
    data() {
      return {};
    }
  };
</script>

<style scoped>
  .container {
    width: 1200px;
    margin: 0 auto 50px;
    padding-top: 40px;
  }

  h2 {
    font-size: 20px;
    text-align: center;
    margin-bottom: 20px;
  }

  h3 {
    font-size: 14px;
    color: #303137;
    margin-bottom: 10px;
    margin-top: 30px;
  }

  p {
    font-size: 14px;
    color: #151515;
    margin-bottom: 10px;
  }

  .seller {
    margin-top: 30px;
  }

  .buyer {
    margin-bottom: 30px;
  }

  table {
    margin: 20px auto;
    width: 100%;
    font-size: 14px;
    color: #151515;
    border-collapse: collapse;
  }

  th, td {
    border: 1px solid #151515;
    padding: 14px;
  }

  .total {
    text-align: right;
  }

  input[type=checkbox] {
    vertical-align: middle;
    margin-right: 5px;
  }

  .company-info {
    margin-top: 30px;
  }

  .address {
    text-indent: 42px;
  }
</style>
