<template>
  <div class="protocol">
    <div class="inner">
      <div class="close" @click="close"></div>
      <div v-if="type==='credit'" id="credit">
        <h3>征信调查授权协议</h3>
        <p>
          征信调查授权协议（以下简称“本协议”）由上海小虫智能科技有限公司（以下简称“本公司”）和您方签订。请仔细阅读本协议条款（尤其是粗体字条款），如您方点击选择同意本协议将视为授权本公司向第三方提交您方的征信信息、授权本公司通过对您方提交的信息通过查询进行信用评估，并将视为已阅读并理解本协议的全部内容，您方不得以未认真阅读为由进行任何实体或程序的反驳。如果您方在任何时候对任何条款存在疑惑，请您方立即联系我们（联系电话：400-016-6868），以便我们对相关内容进行说明与解释，从而帮助您方更好地决定是否接受本协议以及使用我们的服务。</p>
        <h4>一、授权条款</h4>
        <p>
          （一）您方理解并同意，在您方注册或使用小虫快租时，本公司将可能依据《征信业管理条例》及相关法律法规，向第三方合法了解、查询、获取、核实您方的征信信息。所获取的征信信息仅在小虫快租业务中使用，且不向其他机构、提供或披露。您方同意我们可向其合法了解、查询、获取、核实您方的征信信息的第三方包括但不限于：金融机构、类金融机构、电子商务公司、电信运营商、金融信用信息基础数据库、政府公共信用信息平台以及事业单位等一切盈利性、非赢利性、公共、民间的机构和组织。您方同意我们合法了解、查询、获取、核实的征信信息包括但不限于：您方的基本信息，如名称、企业营业执照、企业人民银行征信报告、经营场所证明、企业近半年社保/公积金缴纳记录、公司对公流水、近一年的资产负债表、近一年的利润表、近一年的现金流表等；金融和借贷信息，社会公共信息，比如是否有法院判决、是否偷税漏税等。</p>
        <p>
          （二）您方理解并同意，在您方注册或使用小虫快租时，本公司将可能依据《征信业管理条例》及相关法律法规，向上述第三方提交您方在本公司业务中产生的相关信息，包括但不限于基本信息、免押额度变更信息、租赁申请信息、租赁合同信息以及支付租金行为信息等，并记录在上述机构建设的信用信息数据库中。您方充分理解并知晓本公司向第三方依法提交上述信息可能产生的风险，例如上述信息由本公司依法提供给第三方后被不当利用等。</p>
        <p>
          （三）您方理解并同意，当第三方向本公司查询您方的相关信息时，该第三方应事先征得您方的书面同意并在约定范围内使用，但相关法律法规规定可以不经您方授权的除外，如您方希望我们能及时向第三方提供您方的相关信息，您方应作出明确的授权，否则可能导致本公司拒绝提供相关信息；当您方终止第三方的服务时或希望终止第三方的征信授权，您方应及时确认撤销第三方的征信授权，否则由此带来的影响和损失，本公司不承担责任，并由您方自身承担该等责任和损失。</p>
        <p>
          （四）您方理解并同意，如您方使用了小虫快租平台的产品租赁服务，则应当依据租赁协议中约定之日期按期进行支付租金，本公司将通过短信、电话、社交账号等途径对您方进行付款提醒服务。您方理解并同意，如您方未按期支付租金，您方的逾期信息将可能向第三方进行分享或公布，记录在您方的信用信息数据库中。请您方珍视自身的信用记录，按时履行支付租金义务。</p>
        <p>（五）您方理解并同意，您方应当对您方的信息变动履行及时告知义务。若您方的联系方式发生变化，应及时通知本公司，否则由此带来的影响和损失，本公司不承担责任，并由您方自身承担该等责任和损失。</p>

        <h4>二、保密条款</h4>
        <p>
          （一）本公司重视对用户隐私的保护。因收集您方的信息是出于遵守国家法律法规的规定以及向您方提供服务及提升服务质量的目的，本公司对您方的信用信息承担保密义务，不会为满足第三方的营销目的而向其出售或出租您方的任何信息。</p>
        <p>（二）本公司会在下列情况下才将您方的信用信息与第三方共享：</p>
        <p>1、获得您方的同意或授权。</p>

        <p>2、某些情况下，只有共享您方的信息，才能提供您方需要的服务和（或）产品，或处理您方与他人的交易纠纷或争议。</p>
        <p>3、某些服务和（或）产品由本公司的合作伙伴提供或由本公司与合作伙伴共同提供，本公司会与其共享提供服务和（或）产品需要的信息。</p>
        <p>4、本公司与第三方进行联合推广活动，本公司可能与其共享活动过程中产生的、为完成活动所必要的信息。</p>
        <p>5、根据法律法规的规定及有权机关的要求。</p>
        <p>6、为维护本公司和其他小虫快租用户的合法权益。</p>
        <p>
          7、根据法律规定及合理商业习惯，在本公司计划与其他公司合并或被其收购或进行其他资本市场活动（包括但不限于IPO，债券发行）时，以及其他情形下本公司需要接受来自其他主体的尽职调查时，本公司会把您方的信息提供给必要的主体，但本公司会通过和这些主体签署保密协议等方式要求其对您方的信息采取合理的保密措施。</p>
        <h4>三、用户义务及免责声明</h4>
        <p>
          （一）您方保证，您方所提供的信息均为您方的真实信息，不可为他人的信息或虚假信息，若涉嫌恶意信息作假或盗用他人信息，将可能记入网络征信系统，影响您方的征信记录，同时本公司将保留追究您方相应法律责任的权利，对本公司和其他小虫快租用户造成损失的，您方应负责赔偿。</p>
        <p>
          （二）如您方所提供的信息中的全部或部分信息为他人信息或虚假信息，本公司将有权暂停或终止与您方的全部或部分服务协议，由此行为所产生的全部法律责任将由您方承担，本公司将不对此承担法律责任，对本公司和其他小虫快租用户造成损失的，您方应负责赔偿。</p>
        <h4>四、其他</h4>
        <p>
          本公司有权根据需要不时地制定、修改本协议，如本协议有任何变更，本公司将在本公司网站（网址：【www.xiaochong.cn】）中显示公告，供您方查阅。如您方不同意相关变更，应注销小虫快租账号并停止使用小虫快租服务，则本协议自行终止。新的协议一经在本公司网站（网址：【www.xiaochong.cn】）公布后，立即生效，并对继续使用小虫快租服务的有法律约束力。</p>
        <p> 本协议没有约定或者约定不明的，以《小虫快租平台注册使用协议》中的相关约定为准。</p>
        <p>如因履行本协议发生纠纷，由上海小虫智能科技有限公司经营所在地人民法院管辖。</p>

      </div>
      <div id="register" v-if="type==='register'">
        <h3>小虫智能平台注册使用协议</h3>
        <h3>前言</h3>
        <p><i> 本网站由上海小虫智能科技有限公司（下称“小虫智能平台”或“本公司”）所有和负责运营。本网站特别提醒用户在注册时仔细查看本协议内容，尤其是协议中用“蓝色、加粗、倾斜、下划线”标识的文字内容。</i></p>
        <p><i>本网站还特别提醒用户：如在本网站注册成功并通过本网站平台推荐到其他合作平台的，须另行签署相关租赁合同，合同将采取电子文本的形式制成，并采取电子签名的方式签署，用户有义务在租赁前向本网站提供其电子签名样式备档。如用户在本网站完成注册的，视为同意本协议的全部内容。</i>
        </p>
        <p>
          本使用协议双方为小虫智能平台与本网站注册用户（下称“用户”或“您”），本协议具有合同效力，适用于您在本网站的全部活动。请您在注册成为本网站用户前务必仔细阅读本协议，若您不同意本协议的任何内容，或者无法准确理解小虫智能平台对条款的解释，请您立即停止注册或使用本网站的服务，并无权访问或成为本网站用户；若您继续访问本网站并继续注册成为本网站用户，则表示您对本协议的全部内容已充分阅读并认可和同意遵守。同时，承诺遵守中国法律、法规、规章及其他政府规范性文件规定，如有违反而造成任何法律后果，您将以本人名义独立承担所有相应的法律责任。</p>
        <p>本协议内容包括以下条款及本网站已经发布的或将来可能发布的各类规则。本网站发布的所有规则为本协议不可分割的一部分，与协议正文具有同等法律效力。</p>
        <p>
          小虫智能平台有权根据需要不定时地制定、修改本协议或各类规则，对于本网站用户适用的协议或各类规则应以用户在本网站注册时适用的协议或规则内容为准。本网站将随时刊载并公告本协议及规则变更情况。经修订的协议、规则一经公布，立即自动生效，对新协议、规则生效之后注册的用户发生法律效力。对于协议、规则生效之前注册的用户，若用户在新规则生效后继续使用本网站提供的各项服务，则表明用户已充分阅读并认可和同意遵守新的协议或规则。若用户拒绝接受新的协议和规则，用户有权放弃或终止继续使用本网站提供的各项服务，但该用户应承担在本网站已经进行的交易下所应承担的任何法律责任，且应遵循该用户发生交易时有效的协议或规则内容。</p>
        <h3>用户须知</h3>
        <p>（1）您使用小虫快租平台产品的租赁服务，均须遵守本《小虫智能平台注册使用协议》。</p>
        <p>（2）用户一经注册小虫快租帐号，用户有权利用该帐号使用小虫快租平台产品的租赁服务，当用户使用小虫快租平台产品的租赁服务时，用户的使用行为视为其对该平台产品的租赁服务条款。</p>
        <p>
          （3）对于用户使用小虫快租账号享受小虫快租平台产品的租赁服务时产生的一切数据，包括但不限于产品登录记录、信用评估、消费记录及其他产品日志、产品客户服务记录、用户在产品中创造的社会网络内容等，均归上海小虫智能科技有限公司所有。发生争议时，用户同意以上海小虫智能科技有限公司系统数据为准。</p>
        <h3>一、注册规则</h3>
        <h4>1、注册与用户定义</h4>
        <p>
          用户注册是指欲申请成为本网站用户的人员登录本平台网站，并按要求填写相关信息并确认同意履行相关用户协议的过程。个人用户是指通过本网站完成全部注册程序后，使用本网站服务，并且符合中华人民共和国法律规定的具有完全民事行为能力（18周岁以上的自然人），能够独立承担民事责任的自然人。机构用户是指通过本网站完成全部注册程序后，使用本网站服务，并且依据中华人民共和国法律在中华人民共和国境内（香港、台湾、澳门除外）设立的，具有民事行为能力，能够独立承担民事责任的法人或其他组织。</p>
        <h4> 2、注册资料要求</h4>
        <p>
          为了您能安全高效地使用本服务，除本协议另有规定或相关产品另有规则外，您须注册并进行身份校验，注册成功后将取得您在小虫智能平台的专有账户，您在注册时设置的账户名称和密码将作为本网站识别用户身份的唯一有效标识及合法有效的电子签名。同时，您必须按照申请注册用户的表格填写您的资料，并遵守如下要求：</p>
        <p>
          （1）您注册成功后，您注册所用手机号即成为本网站的账户，并由您自行设置账户的密码。您保证您注册的账户对应的是您本人，本公司在发现您试图注册多个本人账户（例如用您的居民身份证和护照注册了不同的账户），或您同时持有多个使用中的本网站的账户时，本公司有权随时将相关账户进行调整和合并，并视情况暂停、中止或终止向您提供的部分或全部服务。本公司对此调整或合并行为无需承担任何责任。</p>
        <p>（2）您必须提供真实、最新、有效及完整的资料，并且授予小虫智能平台基于提供网站服务的目的，对您提供的资料及数据信息拥有全球通用的、永久的、免费的使用权利。
          您有义务维持并更新注册的用户资料，确保其为真实、最新、有效及完整的资料,包括但不限于身份信息、电子邮件地址、联系方式、邮政编码等联系方式等。如因您未及时更新基本资料，导致小虫智能平台服务无法提供或提供时发生任何错误，您不得将此作为取消交易或拒绝付款的理由，小虫智能平台亦不承担任何责任，所有后果应由您承担。</p>
        <p>
          （3）若您提供任何错误、虚假、过时或不完整的资料，或者小虫智能平台依其独立判断怀疑资料为错误、虚假、过时或不完整的，小虫智能平台有权暂停或终止您在本网站的注册账号，并拒绝您使用本网站服务的部分或全部功能。在此情况下，小虫智能平台不承担任何责任，您同意承担因此所产生的直接或间接的任何支出或损失。</p>
        <p>
          （4）在下列任意情况出现时，如本公司要求，您须积极配合提供您的有效身份证明文件或其他必要文件，并允许本公司留存该等文件的彩色扫描件，否则您对本网站服务的使用可能会受到部分或全部的限制、暂停、中止或终止，且本公司对此不承担任何责任：A、您要求变更身份信息或您的身份证明文件已过有效期的；B、本公司认为您使用本网站的行为或相关情况出现异常的；C、本公司认为您的身份资料存在疑点的；D、本公司认为有必要核对或留存您身份证明文件或其他必要文件的其他情形。</p>
        <p>
          （5）您在此同意并授权：本公司可以通过电信运营商、银行、或其他可以提供用户身份校验服务或提供可用于身份校验信息的主体，按照该第三方的规则对您的身份加以校验；或是以本公司认为适当的方式中的一种或多种来对您进行身份校验。</p>
        <h4>3、用户名及登录密码的使用</h4>
        <p>
          您拥有在本网站的用户名及登录密码，并有权使用自己的用户名及密码随时登录本网站，您不得以任何形式擅自转让或授权他人使用自己的用户名及密码。小虫智能平台通过用户的注册用户名及密码来识别用户的指令。用户确认，使用用户名和密码登录后在本网站的一切行为均代表用户本人。用户注册操作所产生的电子信息记录均为用户行为的有效凭证，并由用户本人承担由此产生的全部责任。有鉴于此，您应当：对该等能够登录、使用您的账户的，使用本服务的，或验证您身份的一切信息和设备进行妥善保管，使之处于您的安全掌控之下。对于因这些信息或设备的披露、泄露、遗失或非授权使用所致的损失，由您自行承担。</p>
        <p>
          您一旦发现上述信息或设备遗失，或存在被他人冒用、盗用，或发生其他可能危及到您的账户安全或您的用户信息安全的情形时，您应立即以有效方式通知到本公司，向本公司申请采取相关措施，同时，您理解本公司对您的请求采取行动需要合理期限，在此之前，本公司对已执行或未执行的指令及（或）所导致的损失不承担任何责任。本公司发现前述情形或本公司有合理理由怀疑针对本服务的操作并非出自于您本人的，本公司可以暂停或中止向您提供相关服务，包括但不限于拒绝向第三方提供您的用户信息。对于因黑客行为或用户的保管疏忽等非因本公司原因导致账号、密码遭他人非法使用，本公司不承担任何责任。</p>
        <p>
          您同意，您应自行对您的账户负责，只有您本人方可登录、使用该账户，本公司不对登录您账户的主体负有审核义务，您自行承担审慎注意义务。该账户不可转让、不可赠与、不可继承。在您决定不再使用该账户时，应按本公司规定流程向本公司申请注销该账户。</p>
        <h4>4、注销</h4>
        <p>用户决定不再使用注册用户名时，应首先清偿所有应付款项（包括但不限于租金等）以及退还相关租赁设备等，并向小虫智能平台申请注销该注册用户名。在本公司决定终止向您提供本服务时，本公司亦可注销您的账户。就此，您同意：</p>
        <p>1、您所申请注销的账户应当是您依照本协议的约定注册并由本公司提供给您本人的账户。您应当依照本公司规定的程序进行账户注销。</p>
        <p>2、账户的注销将导致本公司终止为您提供本服务，本协议约定的双方的权利义务终止（依本协议其他条款另行约定不得终止的或依其性质不能终止的除外）。</p>
        <p>3、您的账户注销后，您不可撤销地授权本公司仍将继续持有、保留您的用户信息及您使用本服务的记录。</p>
        <h3> 二、用户的义务</h3>
        <h4>信息发布真实有效</h4>
        <p>用户承诺，其通过本网站发布的信息均真实有效，其向小虫智能平台提交的任何资料均真实、有效、完整、准确。如因违背上述承诺，造成小虫智能平台或本网站其他用户损失的，用户将承担相应责任。</p>
        <h4> 禁止对网站数据进行商业性利用</h4>
        <p> 用户承诺，不对本网站上的任何数据作商业性利用，包括但不限于在未经小虫智能平台事先书面同意的情况下，以复制、传播等任何方式使用本站上展示的资料。</p>
        <h4> 遵守法律法规</h4>
        <p>用户在接受小虫智能平台服务时必须遵守中国法律、法规、规章以及政府规范性文件，不得做出违法违规的行为，具体如下：</p>
        <p>（1）发表、传送、传播、储存侵害他人知识产权、商业秘密等合法权利的内容。</p>
        <p>（2）制造虚假身份、发布虚假信息等误导、欺骗他人，或违背小虫智能平台页面公布之活动规则进行虚假交易。</p>
        <p>（3）进行危害计算机网络安全的行为。包括但不限于在您所发布的信息中含有蓄意毁坏、恶意干扰、秘密地截取 或侵占任何系统、数据或个人资料的任何病毒、伪装破坏程序、电脑蠕虫、定时程序炸弹或其他电脑程序。</p>
        <p>（4）发布违法违规或违反本协议及各类规则的信息。
        </p>
        <h3> 三、通知及送达
        </h3><h4> 1、通知方式
      </h4>
        <p>
          本协议条款及任何其他的协议、告示或其他关于您使用本服务账号及服务的通知，您同意本网站使用电子方式或通过向您在注册时预留的通讯地址邮寄文件资料的方式通知您。电子方式包括但不限于以电子邮件方式、或于本网站或者合作网站上公布、或无线通讯装置通知等方式。</p>
        <h4>2、送达</h4>
        <p>
          网站的通知如以公示方式做出，一经在本网站公示即视为已经送达。除此之外，其他向您个人发布的具有专属性的通知将由本网站在您注册时或者注册后变更用户信息时向本网站提供的电子邮箱、通讯地址或用户注册后在本网站绑定的手机号码发送，一经发送即视为已经送达。请您密切关注用户的电子邮箱、注意接收邮寄至通讯地址的邮件以及手机中的短信信息。因信息传输等非因本公司的原因导致您未在前述通知发出当日收到该等通知的，本网站不承担责任。</p>
        <h4>3、通知内容</h4>
        <p>您同意小虫智能平台利用在本网站登记的联系方式与您联络并向您传递相关的信息，包括但不限于行政管理方面的通知、产品信息、合同履行过程中的通知、有关您使用本网站的通讯以及针对性的广告条等。</p>
        <h3>四、服务提供与租金支付方式</h3><h4> 1、服务内容</h4>
        <p>本网站服务内容主要包括专业计算机及办公设备租赁服务；具体详情以小虫智能平台当时公布的服务内容为准。</p>
        <h4>2、租金支付方式</h4>
        <p>
          当用户使用本网站产品租赁服务时，小虫智能平台将向用户收取相应租金。各项租金标准请详见网站上公布的业务定价及有关规则。用户承诺按照小虫智能平台公布的租金等费用表（详见《小虫智能平台租赁费用表》）的规定向小虫智能平台支付租金费用。</p>
        <p>本协议的终止意味您在本公司的服务的即时终止。</p>
        <p>本协议的终止并不能当然的被认为免除用户在本协议生效期间应履行和尚未履行完成的相关付款义务;并不意味着终止前所发生的未完成客户指令的撤销，也不能消除因终止前的交易所帯来的法律后果。</p>
        <p> 本公司保留在不事先通知用户的情况下随时中止或终止部分或全部服务的权利，对于所有服务的中止或终止而造成的任何损失，本公司无需对用户或任何第三方承担任何责任。</p>
        <h3>五、隐私条款</h3>
        <h4> 1、账号及信息的安全</h4>
        <p>小虫智能平台将竭尽所能保护所有用户信息安全，不会向任何无关第三方提供、出售、分享和注册用户的个人账号及信息。</p>
        <p>用户应保管好用户名与密码，不得向其他任何人泄露用户的用户名和密码，亦不可使用其他任何人的用户名和密码。因黑客、病毒或用户的保管疏忽等非小虫智能平台原因导致账号遭他人非法使用的，小虫智能平台不承担任何责任。</p>
        <p>
          冒用他人账号的，小虫智能平台及其合法授权主体保留追究实际使用人责任的权利。小虫智能平台将严格采取相应技术措施保护用户的账号安全，包括但不限于对用户密码加密的方式。同时，小虫智能平台将运用相关安全技术确保其掌握的信息不丢失、不被滥用和变造。但请注意，尽管小虫智能平台将竭尽全力保护用户的账号及信息安全，但在互联网情况下不存在绝对安全的保障措施。</p>
        <h4> 2、信息资料的来源</h4>
        <p>（1）小虫智能平台收集用户的任何资料旨在保障用户顺利、有效、安全地进行交易等行为。</p>
        <p>（2）除用户向小虫智能平台自愿提供的资料外，用户同意小虫智能平台以下列方式收集并核对用户的信息：</p>
        <p>（a）通过公开及私人资料来源收集用户的额外资料。</p>
        <p>（b）小虫智能平台根据用户在本网站上的行为自动追踪关于用户的相关资料。小虫智能平台将合理利用该相关资料进行本 网站用户的人数统计及行为的内部研究，以更好地了解您以及本网站的其他用户，从而提供更好、更完善的服务。</p>
        <p>（c）若其他用户或第三方向小虫智能平台发出关于用户在本网站上活动或登录事项的信息，小虫智能平台可以将这些资料 收集、整理在用户的专门档案中。</p>
        <h4>3、信息披露和使用</h4>
        <p>在如下情况发生时，用户同意小虫智能平台披露或使用用户的个人信息：</p>
        <p>（1）用户同意小虫智能平台利用用户的联系方式与用户联络，并向用户传递与用户相关的信息，包括但不限于行政管理方面的通知、产品提供、有关用户使用小虫智能平台的服务、通讯以及针对性的广告条；</p>
        <p>
          （2）您注册使用平台服务时，即授权本公司根据您所提供的各项信息及本公司独立获得的信息评定您在本公司所拥有的个人信用风险，或决定是否审核通过您的免押金租赁申请。您向本公司提交有关信息和资料的行为，均应视为已合法授权本公司因提供本服务的需要，而对用户的相关信息进行采集、储存、整理、加工，并按照本服务条款的约定向第三方提交相关资料。在不透露单个用户的具体信息内容的前提下，本公司有权对整个用户数据库进行分析，您对此不持任何异议，也永久放弃向本公司主张任何形式的赔偿或补偿。</p>
        <p>
          （3）您理解并同意，在您注册或使用本平台时，本公司将可能依据《征信业管理条例》及相关法律法规，向第三方支付/征信/金融机构合法了解、获取、核实您的信用信息。所获取的个人信用信息仅在小虫智能平台业务中使用，且不向其他机构、个人提供或披露。</p>
        <p>
          （4）为了分析本网站的使用率、改善本网站的内容和产品推广形式，并使本网站的内容、设计和服务更能符合用 户的要求，用户同意小虫智能平台使用用户的个人信息。小虫智能平台对个人信息的合理使用能使用户在使用本网站服务时得到更为顺利、有效、安全的体验。</p>
        <p>（5）小虫智能平台有义务根据有关法律要求向司法机关和政府部门提供用户的个人信息。</p>
        <p>（6）为了保护用户的合法权益或为防止严重侵害他人合法权益或为了公共利益的需要，小虫智能平台将善意地披露用户的个人信息。</p>
        <p>
          （7）经国家生效法律文书或行政处罚决定确认用户存在违法行为，或者小虫智能平台有足够事实依据可以认定用户存在违法或违反本注册协议的行为或者租金逾期未还的，该用户同意并授权小虫智能平台在本网站及互联网络上公布您的违法、违约行为，并将该内容记入任何与您相关的信用资料和档案。</p>
        <p>（8）用户无权要求小虫智能平台提供其他用户的个人信息，除非司法机关或政府部门根据法律法规要求小虫智能平台提供。</p>
        <h4>4、保密义务</h4>
        <p>
          小虫智能平台及本网站所有用户应当履行保密义务。对在文件签署过程中所获取的对方的商业秘密以及相关权益（包括但不限于客户资料、策划方案、产品知识产权、协议合同、技术文档、账号密码），非经相关权利人许可，不得向第三方披露。关于被授权使用的有关资料、商业秘密等信息，只能在授权指定的范围使用，不得用于其他目的。</p>
        <h3>六、知识产权</h3><h4>1、知识产权之内容</h4>
        <p>
          无论是否明示，小虫智能平台对本网站内所有非公有领域或非他方专有的信息内容享有知识产权（包括但不限于商标权、专利权、著作权、商业秘密等），信息内容包括但不限于文字、图片、软件、音频、视频、数据、源代码、设计、专有技术等。</p>
        <h4>2、侵犯之禁止</h4>
        <p>
          非经小虫智能平台授权同意及法律规定，任何其他组织或个人都不得使用属于小虫智能平台的信息内容。本网站所有的产品、技术及程序等信息内容均由小虫智能平台享有知识产权或被授权使用；未经小虫智能平台授权许可，任何其他组织或个人不得擅自使用（包括但不限于以非法的方式打印、复制、传播、展示、下载等）。否则，小虫智能平台将依法追究其法律责任。</p>
        <h3>七、违约责任</h3>
        <p>
          1、当用户的行为涉嫌违反法律法规或违反本协议和规则的，小虫智能平台有权采取相应措施，包括但不限于直接屏蔽、删除侵权信息，或直接停止提供服务。如使小虫智能平台遭受任何损失的（包括但不限于受到第三方的索赔、受到行政管理部门的处罚等），用户还应当赔偿或补偿小虫智能平台遭受的损失及（或）发生的费用，包括诉讼费、律师费、保全费等。</p>
        <p>
          2、由于违反本协议，或违反其在本网站上签订的协议或文件，或由于用户使用本网站服务违反了任何法律或侵害第三方权利而导致任何第三方向小虫智能平台提出任何补偿申请或要求（包括律师费用），用户应对小虫智能平台给予全额补偿并使之不受损害。</p>
        <p>3、如因小虫智能平台违反有关法律、法规或本协议项下的任何条款而给用户造成损失，小虫智能平台同意承担由此造成的损害赔偿责任。</p>
        <h3>八、免责声明</h3>
        <h4>1、风险免责</h4>
        <p>（1）小虫智能平台不对任何用户及（或）任何租赁行为提供任何明示或默示的担保。平台向用户提供的各种信息及资料仅为参考，用户应依其独立判断做出决策。</p>
        <p>（2）因业务发展需要，本公司保留单方面对本服务全部或部分内容变更、暂停、中止、终止或撤销的权利，您需承担此风险 。</p>
        <h4>2、互联网自身不稳定性免责</h4>
        <p>
          由于互联网本身所具有的不稳定性，小虫智能平台无法保证服务不会中断。系统因有关状况无法正常运作，使用户无法使用任何本网站服务或使用本网站服务受到任何影响时，小虫智能平台对用户或第三方不负任何责任，前述状况包括但不限于：</p>
        <p>（1）本网站系统停机维护期间。</p>
        <p>（2）电信设备出现故障不能进行数据传输的。</p>
        <p>（3）包括但不限于由于黑客攻击、网络供应商技术调整或故障、网站升级、银行方面的问题等原因而造成的本网站服务中断或延迟。</p>

        <h4>3、不可抗力免责</h4>
        <p>
          对于因小虫智能平台合理控制范围以外的原因，包括但不限于自然灾害（台风、地震、海啸、洪水）、罢工或骚乱、物质短缺或定量配给、暴动、战争行为、政府行为、通讯或其他设施故障或严重伤亡事故等，致使小虫智能平台延迟或未能履约的，小虫智能平台不对用户承担任何责任。</p>
        <h4>4、用户自身过错免责</h4>
        <p>
          1、因用户的过错导致的任何损失，该过错包括但不限于：决策失误、操作不当、遗忘或泄露密码、密码被他人破解、用户使用的计算机系统被第三方侵入、用户委托他人代理交易时他人恶意或不当操作而造成的损失。</p>
        <p>2、若因个人失误，被他人获取账户信息或信息被利用造成租赁行为，缴纳租金结果和逾期所造成的一切损失和法律责任由本人承担。</p>

        <p>3、若您涉嫌恶意信息作假或盗用他人信息，您的行为将可能记入网络征信系统，影响您的征信记录，同时本公司将保留追究您相应法律责任的权利。</p>

        <h3>九、争议解决适用法律及管辖</h3>
        <p>1、 本协议的订立、变更、执行和解释，以及与本协议有关的争议解决，均应适用中华人民共和国法律。如与本协议有关的某一特定事项没有法律规定或规定不明确，则应参照通用的国际商业惯例和行业惯例。</p>
        <p>2、 如因本协议或因小虫智能平台服务所引起或与其有关的任何争议各方先协商解决，如协商不成，应选择如下 （2） 式解决：</p>

        <p>（1）提交仲裁委员会按其仲裁规则仲裁，仲裁裁决是终局的，对双方均有约束力。本合同项下任何仲裁中的守约方有权要求对方支付其合理律师费，仲裁费用和其他费用。</p>
        <p>（2）向上海小虫智能科技有限公司经营所在地人民法院提起诉讼。</p>
        <h4>十、其他</h4>
        <p>
          1、 本协议自用户同意勾选或网上签署并成功注册成为本网站用户之日起生效，除非上海小虫智能科技有限公司终止本服务协议或者用户丧失本网站用户资格，否则本服务协议始终有效。本服务协议终止并不免除用户根据本服务协议或其他有关协议、规则所应承担的义务和责任。</p>
        <p>2、 本服务协议部分条款被认定为无效时，不影响本服务协议其他条款的效力。</p>
        <p>3、 小虫智能平台在法律许可范围内对本服务协议享有最终的解释权。</p>
      </div>
    </div>

  </div>

</template>

<script>
  export default {
    name: 'protocol',
    data () {
      return {
        msg: ''
      }
    },
    methods: {
      close(){
        this.$emit('listenOption', 'close')
      }
    },
    props: {
      type: String
    }
  }
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
  .close {
    width: 15px;
    height: 15px;
    background: url('../../assets/images/icon_close.png');
    float: right;
    margin-top: -20px;
    cursor: pointer;

  }

  .protocol {
    width: 80%;
    height: 100vh;
    background: #fff;
    margin: 0 auto;
    padding: 50px;
    overflow: scroll;
    position: relative;
    z-index: 999;
    line-height: 1.5;
    color: #333333;


  }

  .protocol .inner {
    width: 100%;
    padding-bottom: 200px;
    height: auto;
  }

  h3, h4 {
    font-weight: bold;
  }
</style>
