<template>
  <div class="page page-contract">
    <h2>特定商取引法に基づく表記</h2>
    <p>■販売業者名</p>
    <p>フィント株式会社</p>
    <p>■代表者</p>
    <p>島津　秀和</p>
    <p>■所在地</p>
    <p>〒106-6013　東京都千代田区丸の内1-11-1 パシフィックセンチュリープレイス丸の内8F</p>
    <p>■電話番号</p>
    <p>03-3560-6606</p>
    <p>■受付時間</p>
    <p>月〜金　10:30〜18:00(日・祝日 年末年始を除く)</p>
    <p>■販売価格</p>
    <p>商品毎に記載</p>
    <p>■販売価格以外に必要な費用</p>
    <p>消費税/配送料/セットアップ費用</p>
    <p>■支払方法</p>
    <p>クレジットカード/銀行振込/コンビニ支払</p>
    <p>■引渡し期間</p>
    <p>お客様がご注文を確定した後、2カ月以内に発送致します。</p>
    <p>それ以上遅れる場合についてはメールもしくはお電話にてご報告致します。</p>
    <p>■返品について</p>
    <p>商品の品質については万全の注意を払っておりますが、初期不良や起動不良が生じた際は、商品お届け後7日以内にご連絡下さい。送料当社負担にて交換させて頂きます。</p>
    <p>また、配送中の事故等で「破損」や「起動不良」が生じた場合についても、商品お届け後7日以内にご連絡下さい。運送会社と協議の上、交換させて頂きます。</p>
    <p>一度ご使用になった商品やお客様の責任による「破損」や「起動不良」については返品・交換は一切お受け出来ませんので予めご了承下さい。</p>
  </div>
</template>

<script>
  export default {
    name: 'business'
  };
</script>

<style scoped>
  .page {
    width: 1200px;
    margin: 0 auto;
    padding: 40px 50px;
  }
</style>
