<template>
  <div class="page  page-contract">
    <h2>アカウント規約</h2>
    <p>フィント株式会社（以下「当社」といいます）は、アカウント規約（以下「本規約」といいます）を以下のとおり定めます。</p>
    <h3>第1章　総則</h3>
    <p class="bold">第1条　定義</p>
    <p>1.「アカウント」とは、お客様が対象サービスを利用するために必要な個人認証システムである「フィント アカウント」をいいます。</p>
    <p>2.「お客様」又は「アカウント所持者」とは、本規約に同意の上、当社が定める手続きに従いアカウントの登録を行った方をいいます。</p>
    <p>3.「当社グループ会社」とは、将来設立されるものも含めて、当社によって所有又はコントロールされる全ての会社をいいます。</p>
    <p>4.「第三者」とは、当社及びお客様以外の法人又は個人（他のアカウント所持者を含みます）をいいます。</p>
    <p>5.「ＩＤ」とは、当社がお客様を識別し管理するために、アカウントごとにお客様に設定して頂く識別コードをいいます。</p>
    <p>6.「パスワード」とは、アカウントの利用にあたり、お客様を認証するためにお客様に設定して頂く英文字、記号及び数字の組み合わせをいいます。</p>
    <p>7.「ＩＤ等」とは、ＩＤとパスワードを併せていいます。</p>
    <p>8.「対象サービス」とは、フィントアカウントによって利用可能な、当社又は当社の指定する第三者のサーバに開設する当社が対象サービスとして指定するサービスをいいます。</p>
    <p>9.「専用サイト」とは、当社又は当社の指定する第三者のサーバに開設する、アカウント専用のWebサイトをいいます。</p>
    <p>10.「アカウント情報」とは、フィントアカウント登録申請の際、当社が提示を要求する氏名、住所、メールアドレス、パスワード、その他個人情報を含む情報をいいます。</p>
    <p>11.「個人情報」とは、個人に関する情報であって、氏名、生年月日等特定の個人を識別できる情報（他の情報と容易に照合することができ、それにより特定の個人を識別することができることとなるものを含みます）をいいます。</p>
    <p>12.「書込情報」とは、対象サービスの利用に際してお客様が専用サイト又はメールにおいて当社に提供した情報（ID等及びアカウント情報を除きます）の一切をいいます。</p>
    <p>13.「データ等」とは、アカウントを利用することにより、発生・記録・蓄積された情報の一切をいいます。データ等には、書込情報も含まれます。</p>
    <p>14.「メールニュース」とは、当社がお客様に対し配信する重要な通知メール又はお客様の選択により配信するメールニュース等をいいます。</p>
    <p>15.「登録解除」とは、アカウントの登録を解除することをいいます。</p>
    <p class="bold">第2条　規約の適用</p>
    <p>1.本規約は、お客様がアカウントを利用する一切の場合に適用されます。</p>
    <p>2.お客様は、アカウントの利用に当たっては、本規約を遵守するものとします。</p>
    <p class="bold">第3条　本規約の範囲</p>
    <p>1.当社が、本規約の他に別途定めるご利用上の注意等の一切についても、その名目の如何に関わらず、本規約の一部を構成するものとします。</p>
    <p>2.特段の規定のある場合を除き、各対象サービスの利用にあたっては、本規約が各対象サービスの規約より優先して適用されるものとします。</p>
    <p class="bold">第4条　規約の通知・変更</p>
    <p>
      1.当社がお客様に対して通知する諸規定は、専用サイト、メールニュースに掲載・記載するかその他の方法によるかを問わず、本規約の一部をなすものとします。通知は、別途指定された場合を除いて、専用サイト上に掲載した時点で効力が発生するものとします。</p>
    <p>
      2.当社は、必要に応じて本規約の内容を随時任意に変更することができるものとします。本規約を変更した場合は、専用サイト又はニュースメールに掲載することでお客様に通知するものとし、別途規定のある場合を除いて、変更後の規約が専用サイトに掲載された時点から、フィントアカウントの利用条件は変更後の規約に拠るものとします。尚、お客様は、アカウントの利用を継続される限り、変更を承諾したものとします。</p>
    <p class="bold">第5条　アカウントの登録</p>
    <p>1.アカウントの登録を希望する方は、本規約のすべてに同意した上で、本規約及び当社が定める方法に従い登録の申請を行うものとします。本規約の全てに同意するほか、当社が別途定める条件を満たした場合にのみご登録できます。</p>
    <p>2. 20歳未満の未成年者の方は、保護者の方が同意された場合のみ登録のお申し込みをすることができ、14歳以下のお子様の場合は、保護者の方と一緒に申し込みの手続きを行うものとします。</p>
    <p>3.アカウントの登録のお申し込みがあった場合は、本規約のすべてに同意されたものとみなし、未成年者の方の場合は、保護者の方の同意があったものとみなします。</p>
    <p>
      4.当社は当社の完全なる裁量により登録の可否を判断するものとし、当社が不適切と認めた場合の他、当社が必要と判断した場合その他理由の如何を問わず、登録及び再登録を留保又は拒否できるものとします。前記に加え、当社が選択する技術的手段等によっては、お客様はアカウントの登録を受けられない場合もあります。当社は登録の可否の判断について一切責任を負わず、またその理由について一切開示義務を負わないものとします。</p>
    <p class="bold">第6条　アカウント登録の解除</p>
    <p>1.お客様は、サイトから当社所定の手続きを行い、いつでもアカウントの登録を解除することができます。</p>
    <p>
      2.アカウントの登録を解除すると、当該アカウントにより利用可能だった対象サービスは一切利用できなくなることにお客様は承諾したものとみなします。当社はアカウント登録の解除に伴い、当該アカウントに係るデータの一切（対象サービスにおいて保存されているデータの一切を含みます）を抹消することができるものとし、また、当社の裁量により一定期間、又はお客様からの削除請求のあるまでの間、保存することができるものとします。一度登録解除されたアカウント及びそれに係るデータ等を復元等することはできません。</p>
    <p>3.システムの都合上、お客様による登録抹消の手続が完了してから、その手続がシステム上反映されるまで所定の時間を必要とし、お客様はこれを承諾するものとします。</p>
    <p>4.当社は、一定期間使用されていないアカウントにつき、当社の裁量により登録解除することができるものとします。当社は当該期間について、専用サイト上に掲載するものとします。</p>
    <h3>第2章　対象サービス</h3>
    <p class="bold">第7条　対象サービスの内容</p>
    <p>1.お客様は、アカウントにより対象サービスを利用する場合は、本規約のほか、各対象サービスの規約等を遵守するものとします。</p>
    <p>2.対象サービスの内容（種類、態様、頻度、提供期間その他対象サービスに係る一切の事項を含みます。以下同じ）は、当社の任意の判断により決定します。</p>
    <p>
      3.当社は、当社が別途規定する場合を除き、理由の如何を問わず、お客様への事前又は事後の承諾や通知なく、フィントアカウントにより利用できる対象サービスの種類・内容等を随時任意に変更できるものとし、お客様が利用できる対象サービスは、当社がその時点で提供可能なサービスとします。当社は、各対象サービスの一部又は全部を中断、中止できるものとし、その継続について一切保証しないものとします。</p>
    <h3>第3章　お客様の義務等</h3>
    <p class="bold">第8条　費用負担</p>
    <p>1.お客様は、フィントアカウント及び対象サービスを利用するために必要なハードウェア、回線その他の一切を、自己の責任と費用をもって準備するものとします。</p>
    <p>
      2.お客様は、対象サービスの利用等において必要な料金及び前項により必要な費用の他、電話代等の通信費用、インターネットへの接続費用、電気代、その他アカウント及び対象サービスを利用するために必要な費用がかかることを了承し、これを負担するものとします。</p>
    <p class="bold">第9条　アカウント情報変更の届出</p>
    <p>お客様は、メールアドレス、住所、氏名等、当社への届け出内容に変更があった場合、当社所定の手続きに従い変更を行うか又は当社へ届け出るものとします。</p>
    <p>変更の届け出はサイトにて行うことができます。</p>
    <p class="bold">第10条　アカウントの登録解除・一時停止等</p>
    <p>
      1.お客様が、以下のいずれかの事由に該当し、又はそのおそれがあるものと当社が判断した場合、当社は、事前に通知又は催告することなしに、お客様のアカウント登録を解除し、アカウントの利用を一時停止し、又は対象サービスにおいて当社が適切と判断する措置をとることができるものとします。当社は、上記判断について何人に対しても一切の責任を負いません。</p>
    <p>(1) フィントアカウントの運営又は対象サービスの運営を妨害した場合。</p>
    <p>(2) 本章に定めるお客様の義務、第7章に定める禁止事項その他本規約、対象サービスの規約等のいずれかの条項に違反した場合。</p>
    <p>(3)当社又は当社グループ会社の信用を毀損した場合。</p>
    <p>(4) 住所、氏名等、アカウント登録の情報に関して、虚偽の申告があったことが判明した場合、又は、登録しているメールアドレスが機能していないと判断される場合。</p>
    <p>(5)お客様が、過去に当社からアカウント登録の解除若しくは一時停止処分を受け又は本規約に違反したことのあることが判明した場合。</p>
    <p>(6)お客様が、過去に対象サービスその他当社及び当社グループの提供するサービスにおいて会員資格等を取り消し若しくは一時停止され、または適用される規約等に違反したことのあることが判明した場合。</p>
    <p>(7)お客様側のメールサーバの受信拒否又は受信障害等により、メールニュースの配信に著しい障害があった場合。</p>
    <p>
      (8)当社又は他のお客様、その他対象サービスを利用している他のユーザ等とトラブルを起こしたり、迷惑行為を行った場合、他のお客様や対象サービスを利用している他のユーザを含む第三者から当該指摘を受けた場合又は当社がそのように認定した場合。</p>
    <p>(9)その他当社が、アカウント所持者又は対象サービス利用者として不適当と判断した場合。</p>
    <p>2.お客様が前項各号のいずれかに該当することにより、当社が損害を被った場合、お客様は当社に対して損害額全額を支払う責任を負うものとします。</p>
    <h3>第4章　お客様の責任</h3>
    <p class="bold">第11条　お客様の自己責任</p>
    <p>1.お客様は、フィントアカウント及び対象サービスを自己の責任において利用するものとし、また、これらの利用に際して他者又は当社に対して損害を与えた場合、自己の責任と費用をもって当該損害を賠償するものとします。</p>
    <p>2.お客様は、アカウント利用にあたり、常に専用サイト上、その他当社が指定するサイト、当社からのメールニュース等により通知される当社からの通知を確認するものとします。</p>
    <p>
      3.お客様はアカウント及び各対象サービスの利用により他のアカウント所持者との思わぬトラブルに巻き込まれる危険性があることを十分に理解し、他のアカウント所持者との接触に十分に注意するものとします。かかるトラブルに対し、お客様は自己責任の原則をもって、アカウント所持者間で解決にあたるものとし、当社は一切責任を負わないものとします。</p>
    <p>
      4.アカウント所持者は各対象サービスの利用等において自己の発信する情報が、第三者の著作権、商標権、肖像権、パブリシティ権等の権利を侵害し、また、第三者のプライバシー、名誉、信用を毀損する危険性があることを十分に認識するとともに、かかる侵害を発生させることがないよう、情報の発信に際しては十分に注意するものとします。</p>
    <p class="bold">第12条　アカウント情報等の管理責任</p>
    <p>
      1.お客様は、自己のID等を含むアカウント情報を他者に使用させず、他者と共有しないとともに、自己の過失の有無を問わず、それらの使用（自己が行なったか否かに関わらず）及び管理について一切の責任を負うものとします。当社はお客様のID等のアカウント情報の他者による不正使用等に対しお客様に一切責任を負いません。</p>
    <p>2.お客様は、自己のID等により各対象サービスが利用された結果について、その行為を自己が行ったか否かに関らず、責任を負うものとします。</p>
    <h3>第5章　情報管理</h3>
    <p class="bold">第13条　個人情報の取扱い</p>
    <p>1.当社は、アカウント情報の登録、変更、および対象サービスの利用の際などにお客様から提供を受けた個人情報を適切に取り扱うものとします。</p>
    <p>2.お客様は、本規約への同意とともに、プライバシーポリシーにも同意したものとします。尚、プライバシーポリシーと本規約との間に矛盾が生じる場合は、本規約の定めが優先して適用されるものとします。</p>
    <p>3.当社は、お客様の個人情報を、以下の目的にのみ利用するものとし、お客様はこれに同意するものとします。なお、統計資料等、個人を特定できない形式に加工された情報は個人情報に含みません。</p>
    <p>(1)フィントアカウントの運用及び対象サービスの実施目的。</p>
    <p>(2)カスタマーサポートの目的。</p>
    <p>(3)メールや郵便物により当社、当社の関連会社及び当社のパートナー企業の商品・サービス・イベント開催・アンケート実施等について案内する目的。</p>
    <p>(4)アンケート調査の実施、ならびにアンケートに基づく商品・サービス及び販売企画上の統計資料等を作成する目的。</p>
    <p>(5)プレゼント、景品、商品等を配送する目的。</p>
    <p>(6)本規約及び各対象サービスの規約に別途規定する目的。</p>
    <p>(7)上記以外に、当社がお客様から個別に同意を得た目的。</p>
    <p>4.当社は、お客様の個人情報を、以下のいずれかに該当する場合を除いて、第三者に開示、提供しないものとします。</p>
    <p>(1)前項各号の目的のために、当社グループ間で個人情報を共有する場合</p>
    <p>(2)企業等が従うべき法的義務遂行のために必要な場合</p>
    <p>(3)裁判所、検察庁、警察、弁護士会、消費者センター又はこれらに準じた機関その他の団体・個人から、法令、諸規定に基づき提供・開示を求められた場合</p>
    <p>(4)当社、公衆若しくは他のお客様の生命身体財産又は名誉信用の保護のために必要と認められる等の相当の事由がある場合</p>
    <p>(5)お客様にお知らせした使用目的のために事業協力会社または提携先企業に対する開示が必要な場合</p>
    <p>
      (6)クレジットカード等による代金決済を行う場合に、クレジットカード等の有効性を確認するため、当社およびクレジットカード会社間で個人情報の交換を行う場合、その他決済会社や業務を委託している委託会社との間で個人情報の交換を行う場合。また、クレジットカード会社、その他決済会社または金融機関から、個人情報の開示要請があり、かつ開示が必要であると当社が判断した場合</p>
    <p>(7)上記以外に、当社がお客様から個別に同意を得た場合</p>
    <p>5.当社は、個人情報について不正アクセス・改ざん・破壊・紛失・漏えい等が生じないよう合理的な管理体制のもとで保管し、安全性の確保に努めるものとします。また、個人情報は当社が必要と判断する期間、保管するものとします。</p>
    <p>6.お客様は、当社が別途定める手続きに従い、自己の個人情報の開示、訂正および利用停止を請求することができ、当社は、速やかに対応するものとします。</p>
    <p>7.お客様は、収集された個人情報が、本条に規定する目的のため、お客様への事前の通知等なく海外に転送される場合があることにあらかじめ同意します。</p>
    <h3>第6章　運営一般事項</h3>
    <p class="bold">第14条　運営の委託</p>
    <p>当社は、フィントアカウントの運営に関する権利、義務の全部若しくは一部（それに伴う個人情報を含む）を他者に譲渡し又はフィントアカウントの運営の全部若しくは一部を他者に委託することができるものとします。</p>
    <p class="bold">第15条　内容の変更</p>
    <p>当社は、お客様への事前の通知なしに、フィントアカウントの運営内容を変更することがあります。</p>
    <p class="bold">第16条　運営の一時中断</p>
    <p>当社は、以下のいずれかの事由が生じた場合には、お客様に事前に通知することなく、一時的に運営を中断することがあります。</p>
    <p>(1)フィントアカウントの運営用設備等の保守を定期的又は緊急に行なう場合。</p>
    <p>(2)地震、洪水、津波等の天災により運営ができなくなった場合。</p>
    <p>(3)火災、停電その他の不慮の事故により運営ができなくなった場合。</p>
    <p>(4)戦争、紛争、動乱、暴動、騒乱、労働争議等によりサービスの提供ができなくなった場合。</p>
    <p>(5)その他、運営上又は技術上、当社が運営の一時的な中断を必要と判断した場合。</p>
    <p class="bold">第17条　運営の中止</p>
    <p>当社は、専用サイト等で事前に通知をした上で、フィントアカウントの運営の全部又は一部を中止することがあります。</p>
    <h3>第7章　禁止事項</h3>
    <p class="bold">第18条　禁止行為の中止</p>
    <p>お客様は、本章に定める禁止事項に該当し、またそのおそれのある行為を行なったと当社又は他者から通知がなされたときは、当該行為を直ちに中止するものとします。</p>
    <p class="bold">第19条　資格の譲渡の禁止</p>
    <p>お客様の資格は、お客様本人のみに与えられたものであり、お客様として有するいかなる権利も他者に譲渡、移転したり、売買、名義変更、質権その他の担保に供する等の行為はできないものとします。</p>
    <p class="bold">第20条　複製・販売等の禁止</p>
    <p>
      お客様は、当社が別途規定又は許諾した場合を除き、フィントアカウント及び対象サービスを通じて入手したデータ、文章、発言等の情報及びソフトウェア等の一切を、著作権法で認められた私的利用の範囲を超えて、複製、販売、頒布、出版等することはできないものとします。</p>
    <p class="bold">第21条　営業活動の禁止</p>
    <p>お客様は、フィントアカウントまたは対象サービスを利用して営業活動をしたり、営利目的又はその準備を目的としてフィントアカウントや対象サービスを利用することはできないものとします。</p>
    <p class="bold">第22条　その他の禁止行為</p>
    <p>その他、お客様はフィントアカウントの利用や対象サービスにおいて以下の行為を行なってはならないものとします。</p>
    <p>(1)当社若しくは他者の著作権、商標権等の知的所有権を侵害する行為又は侵害するおそれのある行為。</p>
    <p>(2)他者の財産、プライバシー若しくは肖像権を侵害する行為又は侵害するおそれのある行為。</p>
    <p>
      (3)他者を差別（コミュニティ等内で差別を扇動するグループを組織する行為等を含む）、侮辱若しくは誹謗中傷し、他者の名誉若しくは信用を毀損する行為、又はハラスメント行為（特定人物やグループを攻撃し、精神的な苦痛を与えると当社が判断する行為）。</p>
    <p>(4)詐欺等の犯罪に結びつく又は結びつくおそれのある行為。</p>
    <p>(5)わいせつ、児童ポルノ若しくは児童虐待に相当する画像、文書等または残虐その他第三者に不快感を与える画像、文書等を送信又は表示する行為その他第三者が不快と感じる行為。</p>
    <p>(6)無限連鎖講ないしそれに準ずる組織を開設し又はこれを勧誘する行為。</p>
    <p>(7)アクセス可能な当社又は他者の情報を改ざん、消去する行為。</p>
    <p>(8)他者になりすまして、フィントアカウント、対象サービスを利用する行為。</p>
    <p>(9)当社の役員、社員又は当社が指定したカスタマーサポート要員になりすます行為。</p>
    <p>(10)選挙の事前運動、選挙運動又はこれらに類似する行為及び公職選挙法に抵触する行為。</p>
    <p>(11)宗教活動、これらに類似する行為、宗教団体への勧誘行為。</p>
    <p>(12)政治活動、これらに類似する行為、政治団体への勧誘行為。</p>
    <p>(13)他者に対する広告、宣伝、勧誘行為又は他者による情報の送受信を妨害する行為。</p>
    <p>(14)マルチ投稿、ジャンクメール、スパムメール、チェーンメール等迷惑メールの送信行為、転送の依頼行為又は依頼に応じた送信行為</p>
    <p>(15)他者の設備や、フィントアカウント、対象サービス提供のために用意した設備への不正アクセス、大量の情報送信等、フィントアカウントや対象サービスの運営に支障を与える行為。</p>
    <p>(16)他者のサーバに接続して、フィントアカウント又は対象サービスと同一又は類似のサービスを利用する行為。</p>
    <p>(17)ウィルス等の有害なコンピュータープログラム等若しくは迷惑メールを送信し又は他者が受信可能な状態にしておく行為。</p>
    <p>(18)自動的に特定の行為を繰り返させるプログラムやツールを用いて対象サービスの各コンテンツや各サービス（コミュニティを含む）を利用する行為</p>
    <p>(19)何らかの道具を用いて自動的に特定の行為を繰り返す様態により対象サービスの各コンテンツや各サービス（コミュニティも含む）を利用する行為</p>
    <p>(20)プログラム等の改変、リバースエンジニアリング、解析、ユーティリティの作成・頒布等の行為。</p>
    <p>(21)当社が設計した通りに動かないプログラム（バグ等）を故意に利用し、自己の利益を得る行為又は他者に不利益を与える行為。</p>
    <p>(22)他者を扇動し、フィントアカウント、対象サービスに係るサポート運営の負担を増大させる行為。</p>
    <p>(23)他者又は当社との信頼関係を破壊するような行為。</p>
    <p>(24)法令に基づいた監督官庁等への届け出、許認可の取得等の手続きが義務付けられている場合に、当該手続きを履行せず、その他当該法令に違反する又は違反するおそれのある行為。</p>
    <p>(25)本人の同意を得ることなく又は詐欺的な手段により、他者の個人情報を収集、開示する行為。</p>
    <p>(26)違法なツール等の情報共有等を目的とするコミュニティやグループの組織、情報の提供（書き込みを含む）、情報を提供するサイトへの勧誘（そのようなサイト、情報サイトへのリンクやバナー掲載等を含む）</p>
    <p>(27)各認証システム、セキュリティ機能を回避する、あるいは回避しようと試みる行為</p>
    <p>(28)上記各号の他、法令、本規約若しくは公序良俗に違反する行為、当社の信用を毀損し若しくは当社の財産を侵害する行為、又は他者若しくは当社に不利益を与える行為。</p>
    <p>(29)上記各号のいずれかに該当する行為が行なわれているデータ等へ当該行為を助長する目的でリンクを張る行為。</p>
    <h3>第8章　免責事項</h3>
    <p class="bold">第23条　免責事項一般</p>
    <p>1.本規約第4章第12条に定める登録情報の変更届けがなされなかったことによりお客様が不利益を被ったとしても、当社は一切責任を負わないものとします。</p>
    <p>2.当社は、お客様のID等が他者に使用されたことによってお客様又は他者が被る損害については、お客様の故意過失の有無に関わらず、一切責任を負いません。</p>
    <p>3.当社は、各対象サービスの内容、利用者に提供する情報、利用者が記録する情報の内容の正確さ、有用さについて及びそれらの情報の対象サービス上での表示が完全、正確であることについて、いかなる保証も行なわないものとします。</p>
    <p>
      4.お客様は、フィントアカウント及び対象サービスの利用に伴い、お客様に対して他者から問い合わせ、クレーム等がある場合、又は他者の行為に対する要望、疑問若しくはクレーム等がある場合、自己の責任と費用をもって処理解決するものとし、当社は一切の責任義務を負わないものとします。</p>
    <p>
      5.当社は、第6章第16条に定める運営の中断事由又はその他の事由により、フィントアカウント又は対象サービスの提供の遅延、又は中断等が発生したとしても、これに起因してお客様又は他者が被った損害について一切責任を負わないものとします。</p>
    <p>6.当社は、第6章第17条により運営の提供を中止する場合であっても、中止に伴うお客様又は他者の損害について一切責任を負わないものとします。</p>
    <p>7.当社はフィントアカウント、対象サービス上のエラーや、ウイルスの侵入、お客様に対するウィルスの頒布がないこと、その他安全なゲーム進行等に関して一切保証しないものとします。</p>
    <p>8.当社は、フィントアカウントの利用に起因して発生したお客様又は他者の損害に対していかなる責任も負わないものとし、当該損害を賠償する等の義務はないものとします。</p>
    <p>9.当社は、電気通信事業者、電気事業者その他当社以外の第三者の作為・不作為により生じるお客様の不利益について、一切の責任を負わないものとします。</p>
    <p>10.当社は、お客様がフィントアカウント、対象サービスにおいて、日本国又は他国の法令に違反した場合、一切責任を負わないものとします。</p>
    <p>
      11.本条ないし本規約の他の定めにもかかわらず、何らかの事由により、当社がフィントアカウントに関しお客様に対して過失によって責任を負うとされる場合であっても、当社はお客様に対し、①100円、②損害の生じた対象サービスにおいてお客様が当該損害の生じた日の属する月に消費した金員のいずれか高い額を超えては責任を負いません。但し、当社の故意又は重過失による場合はこの限りではありません。</p>
    <p>
      12.上記に規定するほか、お客様自身の作為・不作為（第25条列挙事由を含むが、これに限定されない）によって、お客様が、対象サービスその他当社がフィントアカウントを通じて提供するあらゆるサービスに関連して、何らかの不利益を被ったとしても、当社は一切責任を負わないものとします。</p>
    <p>13.当社の個人情報に関する義務は、当社が当社プライバシーポリシー及び本規約に従って、お客様の個人情報を善管注意義務をもって取り扱うことに限られます。</p>
    <h3>第9章　合意管轄等</h3>
    <p class="bold">第24条　通知</p>
    <p>
      当社が、本規約の解除その他の意思表示をアカウント登録者へ行なう場合には、書面又はメール等、当社が定める方法にて行なうものとします。メールの場合、アカウント登録者が登録しているメールアドレス宛てに、当該メールを発信した時点で、当該意思表示が到達したものとします。ホームページその他インターネットでアクセスできる画面により通知するときは、その画面に当該意思表示をアップロードした時点で、当該意思表示が到達したものとします。</p>
    <p class="bold">第25条　準拠法</p>
    <p>本規約は、成立、効力、解釈及び履行を含め、全ての事項について日本国法令に従うものとします。</p>
    <p class="bold">第26条　協議解決・合意管轄</p>
    <p>
      お客様と当社の間で、フィントアカウント及び各対象サービスに関連して紛争が生じた場合は、当該当事者間で信義に従いながら、協議解決を図るものとし、協議により解決に至らなかった場合、東京地方裁判所をお客様と当社の第一審の専属的合意管轄裁判所とします。</p>
    <p>附則</p>
    <p>本規約は2018年8月1日より実施するものとします。</p>
  </div>
</template>

<script>
  export default {};
</script>

<style scoped>
  .page {
    width: 1200px;
    margin: 0 auto;
    padding: 40px 50px;
  }

  h3 {
    font-size: 16px;
  }

  .bold {
    font-weight: bold;
  }
</style>
