angular.module('app')
    .factory('cityservice', function () {
        var cityjson = [
            {
                "t1name": "北京市",
                "t2": [
                    {
                        "t2name": "通州区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "房山区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "昌平区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "顺义区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "怀柔区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "大兴区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "密云县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "平谷区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "延庆县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "东城区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "崇文区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "西城区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "朝阳区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "宣武区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "石景山",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "丰台区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "门头沟",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "海淀区",
                        "t3": [

                        ]
                    }
                ]
            },
            {
                "t1name": "上海市",
                "t2": [
                    {
                        "t2name": "普陀区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "闸北区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "虹口区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "杨浦区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "卢湾区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "徐汇区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "长宁区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "静安区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "黄浦区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "金山区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "浦东新区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "嘉定区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "闵行区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "宝山区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "南汇区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "青浦区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "松江区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "奉贤区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "崇明县",
                        "t3": [

                        ]
                    }
                ]
            },
            {
                "t1name": "天津市",
                "t2": [
                    {
                        "t2name": "武清区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "河东区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "和平区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "西青区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "津南区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "大港区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "东丽区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "塘沽区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "汉沽区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "河北区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "红桥区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "河西区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "南开区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "蓟县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "宁河县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "静海县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "宝坻区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "北辰区",
                        "t3": [

                        ]
                    }
                ]
            },
            {
                "t1name": "重庆市",
                "t2": [
                    {
                        "t2name": "开县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "江北区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "沙坪坝区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "九龙坡区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "南岸区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "北碚区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "万盛区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "双桥区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "渝北区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "巴南区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "黔江区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "垫江县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "武隆县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "巫山县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "巫溪县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "云阳县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "奉节县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "忠县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "梁平县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "璧山区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "荣昌县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "大足区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "铜梁区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "潼南县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "綦江区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "长寿区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "彭水苗族",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "酉阳县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "合川区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "江津区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "南川区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "永川区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "丰都县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "城口县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "大渡口区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "渝中区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "涪陵区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "万州区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "石柱县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "秀山县",
                        "t3": [

                        ]
                    }
                ]
            },
            {
                "t1name": "浙江省",
                "t2": [
                    {
                        "t2name": "丽水市",
                        "t3": [
                            {
                                "t3name": "莲都区"
                            },
                            {
                                "t3name": "青田县"
                            },
                            {
                                "t3name": "缙云县"
                            },
                            {
                                "t3name": "龙泉市"
                            },
                            {
                                "t3name": "景宁畲族自治县"
                            },
                            {
                                "t3name": "庆元县"
                            },
                            {
                                "t3name": "云和县"
                            },
                            {
                                "t3name": "遂昌县"
                            },
                            {
                                "t3name": "松阳县"
                            }
                        ]
                    },
                    {
                        "t2name": "舟山市",
                        "t3": [
                            {
                                "t3name": "普陀区"
                            },
                            {
                                "t3name": "定海区"
                            },
                            {
                                "t3name": "嵊泗县"
                            },
                            {
                                "t3name": "岱山县"
                            }
                        ]
                    },
                    {
                        "t2name": "宁波市",
                        "t3": [
                            {
                                "t3name": "鄞州区"
                            },
                            {
                                "t3name": "象山县"
                            },
                            {
                                "t3name": "北仑区"
                            },
                            {
                                "t3name": "镇海区"
                            },
                            {
                                "t3name": "慈溪市"
                            },
                            {
                                "t3name": "奉化市"
                            },
                            {
                                "t3name": "宁海县"
                            },
                            {
                                "t3name": "海曙区"
                            },
                            {
                                "t3name": "江东区"
                            },
                            {
                                "t3name": "江北区"
                            },
                            {
                                "t3name": "余姚市"
                            }
                        ]
                    },
                    {
                        "t2name": "衢州市",
                        "t3": [
                            {
                                "t3name": "常山县"
                            },
                            {
                                "t3name": "开化县"
                            },
                            {
                                "t3name": "柯城区"
                            },
                            {
                                "t3name": "衢江区"
                            },
                            {
                                "t3name": "江山市"
                            },
                            {
                                "t3name": "龙游县"
                            }
                        ]
                    },
                    {
                        "t2name": "温州市",
                        "t3": [
                            {
                                "t3name": "鹿城区"
                            },
                            {
                                "t3name": "龙湾区"
                            },
                            {
                                "t3name": "乐清市"
                            },
                            {
                                "t3name": "文成县"
                            },
                            {
                                "t3name": "苍南县"
                            },
                            {
                                "t3name": "瑞安市"
                            },
                            {
                                "t3name": "泰顺县"
                            },
                            {
                                "t3name": "洞头县"
                            },
                            {
                                "t3name": "瓯海区"
                            },
                            {
                                "t3name": "平阳县"
                            },
                            {
                                "t3name": "永嘉县"
                            }
                        ]
                    },
                    {
                        "t2name": "杭州市",
                        "t3": [
                            {
                                "t3name": "萧山区"
                            },
                            {
                                "t3name": "余杭区"
                            },
                            {
                                "t3name": "桐庐县"
                            },
                            {
                                "t3name": "淳安县"
                            },
                            {
                                "t3name": "拱墅区"
                            },
                            {
                                "t3name": "江干区"
                            },
                            {
                                "t3name": "下城区"
                            },
                            {
                                "t3name": "上城区"
                            },
                            {
                                "t3name": "临安市"
                            },
                            {
                                "t3name": "滨江区"
                            },
                            {
                                "t3name": "西湖区"
                            },
                            {
                                "t3name": "建德市"
                            },
                            {
                                "t3name": "富阳市"
                            }
                        ]
                    },
                    {
                        "t2name": "台州市",
                        "t3": [
                            {
                                "t3name": "玉环县"
                            },
                            {
                                "t3name": "路桥区"
                            },
                            {
                                "t3name": "三门县"
                            },
                            {
                                "t3name": "天台县"
                            },
                            {
                                "t3name": "仙居县"
                            },
                            {
                                "t3name": "温岭市"
                            },
                            {
                                "t3name": "黄岩区"
                            },
                            {
                                "t3name": "椒江区"
                            },
                            {
                                "t3name": "临海市"
                            }
                        ]
                    },
                    {
                        "t2name": "嘉兴市",
                        "t3": [
                            {
                                "t3name": "秀城区"
                            },
                            {
                                "t3name": "秀洲区"
                            },
                            {
                                "t3name": "嘉善县"
                            },
                            {
                                "t3name": "海盐县"
                            },
                            {
                                "t3name": "海宁市"
                            },
                            {
                                "t3name": "平湖市"
                            },
                            {
                                "t3name": "桐乡市"
                            }
                        ]
                    },
                    {
                        "t2name": "绍兴市",
                        "t3": [
                            {
                                "t3name": "新昌县"
                            },
                            {
                                "t3name": "绍兴县"
                            },
                            {
                                "t3name": "越城区"
                            },
                            {
                                "t3name": "嵊州市"
                            },
                            {
                                "t3name": "上虞市"
                            },
                            {
                                "t3name": "诸暨市"
                            }
                        ]
                    },
                    {
                        "t2name": "金华市",
                        "t3": [
                            {
                                "t3name": "东阳市"
                            },
                            {
                                "t3name": "永康市"
                            },
                            {
                                "t3name": "兰溪市"
                            },
                            {
                                "t3name": "义乌市"
                            },
                            {
                                "t3name": "浦江县"
                            },
                            {
                                "t3name": "磐安县"
                            },
                            {
                                "t3name": "武义县"
                            },
                            {
                                "t3name": "金东区"
                            },
                            {
                                "t3name": "婺城区"
                            }
                        ]
                    },
                    {
                        "t2name": "湖州市",
                        "t3": [
                            {
                                "t3name": "德清县"
                            },
                            {
                                "t3name": "长兴县"
                            },
                            {
                                "t3name": "安吉县"
                            },
                            {
                                "t3name": "吴兴区"
                            },
                            {
                                "t3name": "南浔区"
                            }
                        ]
                    }
                ]
            },
            {
                "t1name": "广东省",
                "t2": [
                    {
                        "t2name": "珠海市",
                        "t3": [
                            {
                                "t3name": "香洲区"
                            },
                            {
                                "t3name": "斗门区"
                            },
                            {
                                "t3name": "金湾区"
                            }
                        ]
                    },
                    {
                        "t2name": "惠州市",
                        "t3": [
                            {
                                "t3name": "博罗县"
                            },
                            {
                                "t3name": "惠城区"
                            },
                            {
                                "t3name": "龙门县"
                            },
                            {
                                "t3name": "惠东县"
                            },
                            {
                                "t3name": "惠阳区"
                            }
                        ]
                    },
                    {
                        "t2name": "清远市",
                        "t3": [
                            {
                                "t3name": "连山壮族瑶族自治县"
                            },
                            {
                                "t3name": "阳山县"
                            },
                            {
                                "t3name": "佛冈县"
                            },
                            {
                                "t3name": "清城区"
                            },
                            {
                                "t3name": "连南瑶族自治县"
                            },
                            {
                                "t3name": "清新县"
                            },
                            {
                                "t3name": "英德市"
                            },
                            {
                                "t3name": "连州市"
                            }
                        ]
                    },
                    {
                        "t2name": "韶关市",
                        "t3": [
                            {
                                "t3name": "南雄市"
                            },
                            {
                                "t3name": "乐昌市"
                            },
                            {
                                "t3name": "浈江区"
                            },
                            {
                                "t3name": "武江区"
                            },
                            {
                                "t3name": "翁源县"
                            },
                            {
                                "t3name": "仁化县"
                            },
                            {
                                "t3name": "始兴县"
                            },
                            {
                                "t3name": "曲江区"
                            },
                            {
                                "t3name": "新丰县"
                            },
                            {
                                "t3name": "乳源瑶族自治县"
                            }
                        ]
                    },
                    {
                        "t2name": "江门市",
                        "t3": [
                            {
                                "t3name": "台山市"
                            },
                            {
                                "t3name": "开平市"
                            },
                            {
                                "t3name": "江海区"
                            },
                            {
                                "t3name": "新会区"
                            },
                            {
                                "t3name": "蓬江区"
                            },
                            {
                                "t3name": "鹤山市"
                            },
                            {
                                "t3name": "恩平市"
                            }
                        ]
                    },
                    {
                        "t2name": "揭阳市",
                        "t3": [
                            {
                                "t3name": "普宁市"
                            },
                            {
                                "t3name": "惠来县"
                            },
                            {
                                "t3name": "榕城区"
                            },
                            {
                                "t3name": "揭东县"
                            },
                            {
                                "t3name": "揭西县"
                            }
                        ]
                    },
                    {
                        "t2name": "云浮市",
                        "t3": [
                            {
                                "t3name": "郁南县"
                            },
                            {
                                "t3name": "云安县"
                            },
                            {
                                "t3name": "云城区"
                            },
                            {
                                "t3name": "新兴县"
                            },
                            {
                                "t3name": "罗定市"
                            }
                        ]
                    },
                    {
                        "t2name": "佛山市",
                        "t3": [
                            {
                                "t3name": "南海区"
                            },
                            {
                                "t3name": "禅城区"
                            },
                            {
                                "t3name": "三水区"
                            },
                            {
                                "t3name": "顺德区"
                            },
                            {
                                "t3name": "高明区"
                            }
                        ]
                    },
                    {
                        "t2name": "广州市",
                        "t3": [
                            {
                                "t3name": "海珠区"
                            },
                            {
                                "t3name": "天河区"
                            },
                            {
                                "t3name": "花都区"
                            },
                            {
                                "t3name": "番禺区"
                            },
                            {
                                "t3name": "黄埔区"
                            },
                            {
                                "t3name": "白云区"
                            },
                            {
                                "t3name": "从化市"
                            },
                            {
                                "t3name": "增城市"
                            },
                            {
                                "t3name": "荔湾区"
                            },
                            {
                                "t3name": "越秀区"
                            },
                            {
                                "t3name": "萝岗区"
                            },
                            {
                                "t3name": "南沙区"
                            }
                        ]
                    },
                    {
                        "t2name": "深圳市",
                        "t3": [
                            {
                                "t3name": "南山区"
                            },
                            {
                                "t3name": "宝安区"
                            },
                            {
                                "t3name": "龙岗区"
                            },
                            {
                                "t3name": "盐田区"
                            },
                            {
                                "t3name": "福田区"
                            },
                            {
                                "t3name": "罗湖区"
                            }
                        ]
                    },
                    {
                        "t2name": "河源市",
                        "t3": [
                            {
                                "t3name": "源城区"
                            },
                            {
                                "t3name": "紫金县"
                            },
                            {
                                "t3name": "龙川县"
                            },
                            {
                                "t3name": "连平县"
                            },
                            {
                                "t3name": "东源县"
                            },
                            {
                                "t3name": "和平县"
                            }
                        ]
                    },
                    {
                        "t2name": "汕头市",
                        "t3": [
                            {
                                "t3name": "龙湖区"
                            },
                            {
                                "t3name": "潮阳区"
                            },
                            {
                                "t3name": "金平区"
                            },
                            {
                                "t3name": "潮南区"
                            },
                            {
                                "t3name": "濠江区"
                            },
                            {
                                "t3name": "南澳县"
                            },
                            {
                                "t3name": "澄海区"
                            }
                        ]
                    },
                    {
                        "t2name": "汕尾市",
                        "t3": [
                            {
                                "t3name": "陆河县"
                            },
                            {
                                "t3name": "陆丰市"
                            },
                            {
                                "t3name": "城区"
                            },
                            {
                                "t3name": "海丰县"
                            }
                        ]
                    },
                    {
                        "t2name": "茂名市",
                        "t3": [
                            {
                                "t3name": "化州市"
                            },
                            {
                                "t3name": "高州市"
                            },
                            {
                                "t3name": "信宜市"
                            },
                            {
                                "t3name": "电白县"
                            },
                            {
                                "t3name": "茂港区"
                            },
                            {
                                "t3name": "茂南区"
                            }
                        ]
                    },
                    {
                        "t2name": "肇庆市",
                        "t3": [
                            {
                                "t3name": "四会市"
                            },
                            {
                                "t3name": "端州区"
                            },
                            {
                                "t3name": "鼎湖区"
                            },
                            {
                                "t3name": "广宁县"
                            },
                            {
                                "t3name": "怀集县"
                            },
                            {
                                "t3name": "封开县"
                            },
                            {
                                "t3name": "德庆县"
                            },
                            {
                                "t3name": "高要市"
                            }
                        ]
                    },
                    {
                        "t2name": "东莞市",
                        "t3": [
                            {
                                "t3name": "厚街"
                            },
                            {
                                "t3name": "樟木头"
                            },
                            {
                                "t3name": "石龙"
                            },
                            {
                                "t3name": "长安"
                            },
                            {
                                "t3name": "虎门"
                            }
                        ]
                    },
                    {
                        "t2name": "湛江市",
                        "t3": [
                            {
                                "t3name": "遂溪县"
                            },
                            {
                                "t3name": "赤坎区"
                            },
                            {
                                "t3name": "霞山区"
                            },
                            {
                                "t3name": "雷州市"
                            },
                            {
                                "t3name": "廉江市"
                            },
                            {
                                "t3name": "徐闻县"
                            },
                            {
                                "t3name": "麻章区"
                            },
                            {
                                "t3name": "吴川市"
                            },
                            {
                                "t3name": "坡头区"
                            }
                        ]
                    },
                    {
                        "t2name": "潮州市",
                        "t3": [
                            {
                                "t3name": "湘桥区"
                            },
                            {
                                "t3name": "潮安县"
                            },
                            {
                                "t3name": "饶平县"
                            }
                        ]
                    },
                    {
                        "t2name": "阳江市",
                        "t3": [
                            {
                                "t3name": "阳春市"
                            },
                            {
                                "t3name": "阳东县"
                            },
                            {
                                "t3name": "阳西县"
                            },
                            {
                                "t3name": "江城区"
                            }
                        ]
                    },
                    {
                        "t2name": "中山市",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "梅州市",
                        "t3": [
                            {
                                "t3name": "蕉岭县"
                            },
                            {
                                "t3name": "兴宁市"
                            },
                            {
                                "t3name": "梅县"
                            },
                            {
                                "t3name": "梅江区"
                            },
                            {
                                "t3name": "丰顺县"
                            },
                            {
                                "t3name": "大埔县"
                            },
                            {
                                "t3name": "平远县"
                            },
                            {
                                "t3name": "五华县"
                            }
                        ]
                    }
                ]
            },
            {
                "t1name": "江苏省",
                "t2": [
                    {
                        "t2name": "连云港",
                        "t3": [
                            {
                                "t3name": "连云区"
                            },
                            {
                                "t3name": "新浦区"
                            },
                            {
                                "t3name": "灌云县"
                            },
                            {
                                "t3name": "东海县"
                            },
                            {
                                "t3name": "海州区"
                            },
                            {
                                "t3name": "赣榆县"
                            },
                            {
                                "t3name": "灌南县"
                            }
                        ]
                    },
                    {
                        "t2name": "盐城市",
                        "t3": [
                            {
                                "t3name": "滨海县"
                            },
                            {
                                "t3name": "阜宁县"
                            },
                            {
                                "t3name": "射阳县"
                            },
                            {
                                "t3name": "建湖县"
                            },
                            {
                                "t3name": "亭湖区"
                            },
                            {
                                "t3name": "盐都区"
                            },
                            {
                                "t3name": "响水县"
                            },
                            {
                                "t3name": "东台市"
                            },
                            {
                                "t3name": "大丰市"
                            }
                        ]
                    },
                    {
                        "t2name": "无锡市",
                        "t3": [
                            {
                                "t3name": "江阴市"
                            },
                            {
                                "t3name": "滨湖区"
                            },
                            {
                                "t3name": "惠山区"
                            },
                            {
                                "t3name": "锡山区"
                            },
                            {
                                "t3name": "北塘区"
                            },
                            {
                                "t3name": "南长区"
                            },
                            {
                                "t3name": "崇安区"
                            },
                            {
                                "t3name": "宜兴市"
                            }
                        ]
                    },
                    {
                        "t2name": "宿迁市",
                        "t3": [
                            {
                                "t3name": "泗洪县"
                            },
                            {
                                "t3name": "泗阳县"
                            },
                            {
                                "t3name": "沭阳县"
                            },
                            {
                                "t3name": "宿豫区"
                            },
                            {
                                "t3name": "宿城区"
                            }
                        ]
                    },
                    {
                        "t2name": "扬州市",
                        "t3": [
                            {
                                "t3name": "邗江区"
                            },
                            {
                                "t3name": "广陵区"
                            },
                            {
                                "t3name": "宝应县"
                            },
                            {
                                "t3name": "维扬区"
                            },
                            {
                                "t3name": "高邮市"
                            },
                            {
                                "t3name": "仪征市"
                            },
                            {
                                "t3name": "江都市"
                            }
                        ]
                    },
                    {
                        "t2name": "镇江市",
                        "t3": [
                            {
                                "t3name": "丹徒区"
                            },
                            {
                                "t3name": "润州区"
                            },
                            {
                                "t3name": "句容市"
                            },
                            {
                                "t3name": "丹阳市"
                            },
                            {
                                "t3name": "扬中市"
                            },
                            {
                                "t3name": "京口区"
                            }
                        ]
                    },
                    {
                        "t2name": "南京市",
                        "t3": [
                            {
                                "t3name": "浦口区"
                            },
                            {
                                "t3name": "栖霞区"
                            },
                            {
                                "t3name": "雨花台区"
                            },
                            {
                                "t3name": "江宁区"
                            },
                            {
                                "t3name": "秦淮区"
                            },
                            {
                                "t3name": "建邺区"
                            },
                            {
                                "t3name": "鼓楼区"
                            },
                            {
                                "t3name": "下关区"
                            },
                            {
                                "t3name": "六合区"
                            },
                            {
                                "t3name": "高淳县"
                            },
                            {
                                "t3name": "白下区"
                            },
                            {
                                "t3name": "玄武区"
                            },
                            {
                                "t3name": "溧水县"
                            }
                        ]
                    },
                    {
                        "t2name": "徐州市",
                        "t3": [
                            {
                                "t3name": "鼓楼区"
                            },
                            {
                                "t3name": "邳州市"
                            },
                            {
                                "t3name": "新沂市"
                            },
                            {
                                "t3name": "泉山区"
                            },
                            {
                                "t3name": "贾汪区"
                            },
                            {
                                "t3name": "九里区"
                            },
                            {
                                "t3name": "云龙区"
                            },
                            {
                                "t3name": "睢宁县"
                            },
                            {
                                "t3name": "铜山县"
                            },
                            {
                                "t3name": "沛县"
                            },
                            {
                                "t3name": "丰县"
                            }
                        ]
                    },
                    {
                        "t2name": "泰州市",
                        "t3": [
                            {
                                "t3name": "姜堰市"
                            },
                            {
                                "t3name": "靖江市"
                            },
                            {
                                "t3name": "泰兴市"
                            },
                            {
                                "t3name": "高港区"
                            },
                            {
                                "t3name": "兴化市"
                            },
                            {
                                "t3name": "海陵区"
                            }
                        ]
                    },
                    {
                        "t2name": "南通市",
                        "t3": [
                            {
                                "t3name": "启东市"
                            },
                            {
                                "t3name": "如皋市"
                            },
                            {
                                "t3name": "海安县"
                            },
                            {
                                "t3name": "如东县"
                            },
                            {
                                "t3name": "通州市"
                            },
                            {
                                "t3name": "海门市"
                            },
                            {
                                "t3name": "港闸区"
                            },
                            {
                                "t3name": "崇川区"
                            }
                        ]
                    },
                    {
                        "t2name": "常州市",
                        "t3": [
                            {
                                "t3name": "天宁区"
                            },
                            {
                                "t3name": "钟楼区"
                            },
                            {
                                "t3name": "戚墅堰区"
                            },
                            {
                                "t3name": "新北区"
                            },
                            {
                                "t3name": "武进区"
                            },
                            {
                                "t3name": "溧阳市"
                            },
                            {
                                "t3name": "金坛市"
                            }
                        ]
                    },
                    {
                        "t2name": "淮安市",
                        "t3": [
                            {
                                "t3name": "涟水县"
                            },
                            {
                                "t3name": "清浦区"
                            },
                            {
                                "t3name": "淮阴区"
                            },
                            {
                                "t3name": "楚州区"
                            },
                            {
                                "t3name": "清河区"
                            },
                            {
                                "t3name": "盱眙县"
                            },
                            {
                                "t3name": "洪泽县"
                            },
                            {
                                "t3name": "金湖县"
                            }
                        ]
                    },
                    {
                        "t2name": "苏州市",
                        "t3": [
                            {
                                "t3name": "吴江市"
                            },
                            {
                                "t3name": "平江区"
                            },
                            {
                                "t3name": "金阊区"
                            },
                            {
                                "t3name": "昆山市"
                            },
                            {
                                "t3name": "张家港市"
                            },
                            {
                                "t3name": "太仓市"
                            },
                            {
                                "t3name": "沧浪区"
                            },
                            {
                                "t3name": "吴中区"
                            },
                            {
                                "t3name": "虎丘区"
                            },
                            {
                                "t3name": "常熟市"
                            },
                            {
                                "t3name": "相城区"
                            }
                        ]
                    }
                ]
            },
            {
                "t1name": "山东省",
                "t2": [
                    {
                        "t2name": "淄博市",
                        "t3": [
                            {
                                "t3name": "淄川区"
                            },
                            {
                                "t3name": "博山区"
                            },
                            {
                                "t3name": "张店区"
                            },
                            {
                                "t3name": "周村区"
                            },
                            {
                                "t3name": "临淄区"
                            },
                            {
                                "t3name": "沂源县"
                            },
                            {
                                "t3name": "桓台县"
                            },
                            {
                                "t3name": "高青县"
                            }
                        ]
                    },
                    {
                        "t2name": "烟台市",
                        "t3": [
                            {
                                "t3name": "芝罘区"
                            },
                            {
                                "t3name": "福山区"
                            },
                            {
                                "t3name": "牟平区"
                            },
                            {
                                "t3name": "莱山区"
                            },
                            {
                                "t3name": "招远市"
                            },
                            {
                                "t3name": "蓬莱市"
                            },
                            {
                                "t3name": "莱州市"
                            },
                            {
                                "t3name": "莱阳市"
                            },
                            {
                                "t3name": "海阳市"
                            },
                            {
                                "t3name": "长岛县"
                            },
                            {
                                "t3name": "龙口市"
                            },
                            {
                                "t3name": "栖霞市"
                            }
                        ]
                    },
                    {
                        "t2name": "日照市",
                        "t3": [
                            {
                                "t3name": "莒县"
                            },
                            {
                                "t3name": "五莲县"
                            },
                            {
                                "t3name": "岚山区"
                            },
                            {
                                "t3name": "东港区"
                            }
                        ]
                    },
                    {
                        "t2name": "荷泽市",
                        "t3": [
                            {
                                "t3name": "鄄城县"
                            },
                            {
                                "t3name": "东明县"
                            },
                            {
                                "t3name": "郓城县"
                            },
                            {
                                "t3name": "巨野县"
                            },
                            {
                                "t3name": "成武县"
                            },
                            {
                                "t3name": "单县"
                            },
                            {
                                "t3name": "曹县"
                            },
                            {
                                "t3name": "牡丹区"
                            },
                            {
                                "t3name": "定陶县"
                            }
                        ]
                    },
                    {
                        "t2name": "潍坊市",
                        "t3": [
                            {
                                "t3name": "寒亭区"
                            },
                            {
                                "t3name": "潍城区"
                            },
                            {
                                "t3name": "临朐县"
                            },
                            {
                                "t3name": "昌乐县"
                            },
                            {
                                "t3name": "高密市"
                            },
                            {
                                "t3name": "昌邑市"
                            },
                            {
                                "t3name": "寿光市"
                            },
                            {
                                "t3name": "诸城市"
                            },
                            {
                                "t3name": "安丘市"
                            },
                            {
                                "t3name": "奎文区"
                            },
                            {
                                "t3name": "坊子区"
                            },
                            {
                                "t3name": "青州市"
                            }
                        ]
                    },
                    {
                        "t2name": "济南市",
                        "t3": [
                            {
                                "t3name": "平阴县"
                            },
                            {
                                "t3name": "长清区"
                            },
                            {
                                "t3name": "历下区"
                            },
                            {
                                "t3name": "商河县"
                            },
                            {
                                "t3name": "章丘市"
                            },
                            {
                                "t3name": "历城区"
                            },
                            {
                                "t3name": "天桥区"
                            },
                            {
                                "t3name": "槐荫区"
                            },
                            {
                                "t3name": "市中区"
                            },
                            {
                                "t3name": "济阳县"
                            }
                        ]
                    },
                    {
                        "t2name": "济宁市",
                        "t3": [
                            {
                                "t3name": "梁山县"
                            },
                            {
                                "t3name": "邹城市"
                            },
                            {
                                "t3name": "兖州市"
                            },
                            {
                                "t3name": "泗水县"
                            },
                            {
                                "t3name": "汶上县"
                            },
                            {
                                "t3name": "市中区"
                            },
                            {
                                "t3name": "任城区"
                            },
                            {
                                "t3name": "鱼台县"
                            },
                            {
                                "t3name": "微山县"
                            },
                            {
                                "t3name": "嘉祥县"
                            },
                            {
                                "t3name": "金乡县"
                            },
                            {
                                "t3name": "曲阜市"
                            }
                        ]
                    },
                    {
                        "t2name": "青岛市",
                        "t3": [
                            {
                                "t3name": "李沧区"
                            },
                            {
                                "t3name": "城阳区"
                            },
                            {
                                "t3name": "即墨市"
                            },
                            {
                                "t3name": "胶州市"
                            },
                            {
                                "t3name": "胶南市"
                            },
                            {
                                "t3name": "平度市"
                            },
                            {
                                "t3name": "市南区"
                            },
                            {
                                "t3name": "市北区"
                            },
                            {
                                "t3name": "四方区"
                            },
                            {
                                "t3name": "黄岛区"
                            },
                            {
                                "t3name": "崂山区"
                            },
                            {
                                "t3name": "莱西市"
                            }
                        ]
                    },
                    {
                        "t2name": "临沂市",
                        "t3": [
                            {
                                "t3name": "沂南县"
                            },
                            {
                                "t3name": "河东区"
                            },
                            {
                                "t3name": "罗庄区"
                            },
                            {
                                "t3name": "兰山区"
                            },
                            {
                                "t3name": "蒙阴县"
                            },
                            {
                                "t3name": "临沭县"
                            },
                            {
                                "t3name": "平邑县"
                            },
                            {
                                "t3name": "莒南县"
                            },
                            {
                                "t3name": "苍山县"
                            },
                            {
                                "t3name": "费县"
                            },
                            {
                                "t3name": "郯城县"
                            },
                            {
                                "t3name": "沂水县"
                            }
                        ]
                    },
                    {
                        "t2name": "威海市",
                        "t3": [
                            {
                                "t3name": "荣成市"
                            },
                            {
                                "t3name": "乳山市"
                            },
                            {
                                "t3name": "环翠区"
                            },
                            {
                                "t3name": "文登市"
                            }
                        ]
                    },
                    {
                        "t2name": "莱芜市",
                        "t3": [
                            {
                                "t3name": "钢城区"
                            },
                            {
                                "t3name": "莱城区"
                            }
                        ]
                    },
                    {
                        "t2name": "泰安市",
                        "t3": [
                            {
                                "t3name": "泰山区"
                            },
                            {
                                "t3name": "岱岳区"
                            },
                            {
                                "t3name": "宁阳县"
                            },
                            {
                                "t3name": "东平县"
                            },
                            {
                                "t3name": "新泰市"
                            },
                            {
                                "t3name": "肥城市"
                            }
                        ]
                    },
                    {
                        "t2name": "东营市",
                        "t3": [
                            {
                                "t3name": "东营区"
                            },
                            {
                                "t3name": "河口区"
                            },
                            {
                                "t3name": "垦利县"
                            },
                            {
                                "t3name": "利津县"
                            },
                            {
                                "t3name": "广饶县"
                            }
                        ]
                    },
                    {
                        "t2name": "聊城市",
                        "t3": [
                            {
                                "t3name": "冠县"
                            },
                            {
                                "t3name": "东昌府区"
                            },
                            {
                                "t3name": "高唐县"
                            },
                            {
                                "t3name": "临清市"
                            },
                            {
                                "t3name": "阳谷县"
                            },
                            {
                                "t3name": "莘县"
                            },
                            {
                                "t3name": "茌平县"
                            },
                            {
                                "t3name": "东阿县"
                            }
                        ]
                    },
                    {
                        "t2name": "枣庄市",
                        "t3": [
                            {
                                "t3name": "滕州市"
                            },
                            {
                                "t3name": "市中区"
                            },
                            {
                                "t3name": "台儿庄区"
                            },
                            {
                                "t3name": "山亭区"
                            },
                            {
                                "t3name": "薛城区"
                            },
                            {
                                "t3name": "峄城区"
                            }
                        ]
                    },
                    {
                        "t2name": "滨州市",
                        "t3": [
                            {
                                "t3name": "惠民县"
                            },
                            {
                                "t3name": "阳信县"
                            },
                            {
                                "t3name": "滨城区"
                            },
                            {
                                "t3name": "邹平县"
                            },
                            {
                                "t3name": "博兴县"
                            },
                            {
                                "t3name": "沾化县"
                            },
                            {
                                "t3name": "无棣县"
                            }
                        ]
                    },
                    {
                        "t2name": "德州市",
                        "t3": [
                            {
                                "t3name": "庆云县"
                            },
                            {
                                "t3name": "宁津县"
                            },
                            {
                                "t3name": "齐河县"
                            },
                            {
                                "t3name": "临邑县"
                            },
                            {
                                "t3name": "夏津县"
                            },
                            {
                                "t3name": "平原县"
                            },
                            {
                                "t3name": "乐陵市"
                            },
                            {
                                "t3name": "武城县"
                            },
                            {
                                "t3name": "禹城市"
                            },
                            {
                                "t3name": "德城区"
                            },
                            {
                                "t3name": "陵县"
                            }
                        ]
                    }
                ]
            },
            {
                "t1name": "福建省",
                "t2": [
                    {
                        "t2name": "南平市",
                        "t3": [
                            {
                                "t3name": "松溪县"
                            },
                            {
                                "t3name": "政和县"
                            },
                            {
                                "t3name": "顺昌县"
                            },
                            {
                                "t3name": "光泽县"
                            },
                            {
                                "t3name": "建瓯市"
                            },
                            {
                                "t3name": "建阳市"
                            },
                            {
                                "t3name": "邵武市"
                            },
                            {
                                "t3name": "武夷山市"
                            },
                            {
                                "t3name": "浦城县"
                            },
                            {
                                "t3name": "延平区"
                            }
                        ]
                    },
                    {
                        "t2name": "厦门市",
                        "t3": [
                            {
                                "t3name": "湖里区"
                            },
                            {
                                "t3name": "集美区"
                            },
                            {
                                "t3name": "同安区"
                            },
                            {
                                "t3name": "翔安区"
                            },
                            {
                                "t3name": "思明区"
                            },
                            {
                                "t3name": "海沧区"
                            }
                        ]
                    },
                    {
                        "t2name": "福州市",
                        "t3": [
                            {
                                "t3name": "闽清县"
                            },
                            {
                                "t3name": "罗源县"
                            },
                            {
                                "t3name": "连江县"
                            },
                            {
                                "t3name": "闽侯县"
                            },
                            {
                                "t3name": "晋安区"
                            },
                            {
                                "t3name": "马尾区"
                            },
                            {
                                "t3name": "仓山区"
                            },
                            {
                                "t3name": "台江区"
                            },
                            {
                                "t3name": "鼓楼区"
                            },
                            {
                                "t3name": "平潭县"
                            },
                            {
                                "t3name": "永泰县"
                            },
                            {
                                "t3name": "福清市"
                            },
                            {
                                "t3name": "长乐市"
                            }
                        ]
                    },
                    {
                        "t2name": "宁德市",
                        "t3": [
                            {
                                "t3name": "周宁县"
                            },
                            {
                                "t3name": "屏南县"
                            },
                            {
                                "t3name": "福安市"
                            },
                            {
                                "t3name": "福鼎市"
                            },
                            {
                                "t3name": "蕉城区"
                            },
                            {
                                "t3name": "古田县"
                            },
                            {
                                "t3name": "霞浦县"
                            },
                            {
                                "t3name": "寿宁县"
                            },
                            {
                                "t3name": "柘荣县"
                            }
                        ]
                    },
                    {
                        "t2name": "龙岩市",
                        "t3": [
                            {
                                "t3name": "漳平市"
                            },
                            {
                                "t3name": "新罗区"
                            },
                            {
                                "t3name": "长汀县"
                            },
                            {
                                "t3name": "上杭县"
                            },
                            {
                                "t3name": "永定县"
                            },
                            {
                                "t3name": "连城县"
                            },
                            {
                                "t3name": "武平县"
                            }
                        ]
                    },
                    {
                        "t2name": "莆田市",
                        "t3": [
                            {
                                "t3name": "仙游县"
                            },
                            {
                                "t3name": "城厢区"
                            },
                            {
                                "t3name": "涵江区"
                            },
                            {
                                "t3name": "荔城区"
                            },
                            {
                                "t3name": "秀屿区"
                            }
                        ]
                    },
                    {
                        "t2name": "漳州市",
                        "t3": [
                            {
                                "t3name": "龙文区"
                            },
                            {
                                "t3name": "云霄县"
                            },
                            {
                                "t3name": "东山县"
                            },
                            {
                                "t3name": "长泰县"
                            },
                            {
                                "t3name": "诏安县"
                            },
                            {
                                "t3name": "漳浦县"
                            },
                            {
                                "t3name": "龙海市"
                            },
                            {
                                "t3name": "华安县"
                            },
                            {
                                "t3name": "平和县"
                            },
                            {
                                "t3name": "芗城区"
                            },
                            {
                                "t3name": "南靖县"
                            }
                        ]
                    },
                    {
                        "t2name": "泉州市",
                        "t3": [
                            {
                                "t3name": "安溪县"
                            },
                            {
                                "t3name": "永春县"
                            },
                            {
                                "t3name": "德化县"
                            },
                            {
                                "t3name": "金门县"
                            },
                            {
                                "t3name": "石狮市"
                            },
                            {
                                "t3name": "晋江市"
                            },
                            {
                                "t3name": "南安市"
                            },
                            {
                                "t3name": "鲤城区"
                            },
                            {
                                "t3name": "洛江区"
                            },
                            {
                                "t3name": "丰泽区"
                            },
                            {
                                "t3name": "惠安县"
                            },
                            {
                                "t3name": "泉港区"
                            }
                        ]
                    },
                    {
                        "t2name": "三明市",
                        "t3": [
                            {
                                "t3name": "将乐县"
                            },
                            {
                                "t3name": "沙县"
                            },
                            {
                                "t3name": "建宁县"
                            },
                            {
                                "t3name": "清流县"
                            },
                            {
                                "t3name": "宁化县"
                            },
                            {
                                "t3name": "三元区"
                            },
                            {
                                "t3name": "明溪县"
                            },
                            {
                                "t3name": "梅列区"
                            },
                            {
                                "t3name": "永安市"
                            },
                            {
                                "t3name": "泰宁县"
                            },
                            {
                                "t3name": "大田县"
                            },
                            {
                                "t3name": "尤溪县"
                            }
                        ]
                    }
                ]
            },
            {
                "t1name": "安徽省",
                "t2": [
                    {
                        "t2name": "淮南市",
                        "t3": [
                            {
                                "t3name": "大通区"
                            },
                            {
                                "t3name": "谢家集区"
                            },
                            {
                                "t3name": "田家庵区"
                            },
                            {
                                "t3name": "潘集区"
                            },
                            {
                                "t3name": "八公山区"
                            },
                            {
                                "t3name": "凤台县"
                            }
                        ]
                    },
                    {
                        "t2name": "黄山市",
                        "t3": [
                            {
                                "t3name": "黄山区"
                            },
                            {
                                "t3name": "屯溪区"
                            },
                            {
                                "t3name": "歙县"
                            },
                            {
                                "t3name": "徽州区"
                            },
                            {
                                "t3name": "黟县"
                            },
                            {
                                "t3name": "休宁县"
                            },
                            {
                                "t3name": "祁门县"
                            }
                        ]
                    },
                    {
                        "t2name": "蚌埠市",
                        "t3": [
                            {
                                "t3name": "固镇县"
                            },
                            {
                                "t3name": "龙子湖区"
                            },
                            {
                                "t3name": "蚌山区"
                            },
                            {
                                "t3name": "淮上区"
                            },
                            {
                                "t3name": "禹会区"
                            },
                            {
                                "t3name": "五河县"
                            },
                            {
                                "t3name": "怀远县"
                            }
                        ]
                    },
                    {
                        "t2name": "合肥市",
                        "t3": [
                            {
                                "t3name": "包河区"
                            },
                            {
                                "t3name": "蜀山区"
                            },
                            {
                                "t3name": "庐阳区"
                            },
                            {
                                "t3name": "瑶海区"
                            },
                            {
                                "t3name": "肥西县"
                            },
                            {
                                "t3name": "肥东县"
                            },
                            {
                                "t3name": "长丰县"
                            }
                        ]
                    },
                    {
                        "t2name": "宿州市",
                        "t3": [
                            {
                                "t3name": "灵璧县"
                            },
                            {
                                "t3name": "泗县"
                            },
                            {
                                "t3name": "萧县"
                            },
                            {
                                "t3name": "砀山县"
                            },
                            {
                                "t3name": "埇桥区"
                            }
                        ]
                    },
                    {
                        "t2name": "六安市",
                        "t3": [
                            {
                                "t3name": "金安区"
                            },
                            {
                                "t3name": "裕安区"
                            },
                            {
                                "t3name": "寿县"
                            },
                            {
                                "t3name": "霍山县"
                            },
                            {
                                "t3name": "金寨县"
                            },
                            {
                                "t3name": "舒城县"
                            },
                            {
                                "t3name": "霍邱县"
                            }
                        ]
                    },
                    {
                        "t2name": "池州市",
                        "t3": [
                            {
                                "t3name": "东至县"
                            },
                            {
                                "t3name": "贵池区"
                            },
                            {
                                "t3name": "石台县"
                            },
                            {
                                "t3name": "青阳县"
                            }
                        ]
                    },
                    {
                        "t2name": "芜湖市",
                        "t3": [
                            {
                                "t3name": "弋江区"
                            },
                            {
                                "t3name": "鸠江区"
                            },
                            {
                                "t3name": "镜湖区"
                            },
                            {
                                "t3name": "繁昌县"
                            },
                            {
                                "t3name": "南陵县"
                            },
                            {
                                "t3name": "三山区"
                            },
                            {
                                "t3name": "芜湖县"
                            }
                        ]
                    },
                    {
                        "t2name": "宣城市",
                        "t3": [
                            {
                                "t3name": "宁国市"
                            },
                            {
                                "t3name": "绩溪县"
                            },
                            {
                                "t3name": "旌德县"
                            },
                            {
                                "t3name": "广德县"
                            },
                            {
                                "t3name": "泾县"
                            },
                            {
                                "t3name": "宣州区"
                            },
                            {
                                "t3name": "郎溪县"
                            }
                        ]
                    },
                    {
                        "t2name": "巢湖市",
                        "t3": [
                            {
                                "t3name": "居巢区"
                            },
                            {
                                "t3name": "庐江县"
                            },
                            {
                                "t3name": "无为县"
                            },
                            {
                                "t3name": "含山县"
                            },
                            {
                                "t3name": "和县"
                            }
                        ]
                    },
                    {
                        "t2name": "亳州市",
                        "t3": [
                            {
                                "t3name": "涡阳县"
                            },
                            {
                                "t3name": "谯城区"
                            },
                            {
                                "t3name": "利辛县"
                            },
                            {
                                "t3name": "蒙城县"
                            }
                        ]
                    },
                    {
                        "t2name": "阜阳市",
                        "t3": [
                            {
                                "t3name": "太和县"
                            },
                            {
                                "t3name": "临泉县"
                            },
                            {
                                "t3name": "颍泉区"
                            },
                            {
                                "t3name": "颍东区"
                            },
                            {
                                "t3name": "界首市"
                            },
                            {
                                "t3name": "颍上县"
                            },
                            {
                                "t3name": "阜南县"
                            },
                            {
                                "t3name": "颍州区"
                            }
                        ]
                    },
                    {
                        "t2name": "铜陵市",
                        "t3": [
                            {
                                "t3name": "狮子山区"
                            },
                            {
                                "t3name": "郊区"
                            },
                            {
                                "t3name": "铜官山区"
                            },
                            {
                                "t3name": "铜陵县"
                            }
                        ]
                    },
                    {
                        "t2name": "淮北市",
                        "t3": [
                            {
                                "t3name": "烈山区"
                            },
                            {
                                "t3name": "相山区"
                            },
                            {
                                "t3name": "杜集区"
                            },
                            {
                                "t3name": "濉溪县"
                            }
                        ]
                    },
                    {
                        "t2name": "滁州市",
                        "t3": [
                            {
                                "t3name": "明光市"
                            },
                            {
                                "t3name": "南谯区"
                            },
                            {
                                "t3name": "来安县"
                            },
                            {
                                "t3name": "琅琊区"
                            },
                            {
                                "t3name": "凤阳县"
                            },
                            {
                                "t3name": "天长市"
                            },
                            {
                                "t3name": "全椒县"
                            },
                            {
                                "t3name": "定远县"
                            }
                        ]
                    },
                    {
                        "t2name": "马鞍山市",
                        "t3": [
                            {
                                "t3name": "当涂县"
                            },
                            {
                                "t3name": "雨山区"
                            },
                            {
                                "t3name": "花山区"
                            },
                            {
                                "t3name": "金家庄区"
                            }
                        ]
                    },
                    {
                        "t2name": "安庆市",
                        "t3": [
                            {
                                "t3name": "望江县"
                            },
                            {
                                "t3name": "宿松县"
                            },
                            {
                                "t3name": "桐城市"
                            },
                            {
                                "t3name": "岳西县"
                            },
                            {
                                "t3name": "潜山县"
                            },
                            {
                                "t3name": "太湖县"
                            },
                            {
                                "t3name": "大观区"
                            },
                            {
                                "t3name": "宜秀区"
                            },
                            {
                                "t3name": "怀宁县"
                            },
                            {
                                "t3name": "枞阳县"
                            },
                            {
                                "t3name": "迎江区"
                            }
                        ]
                    }
                ]
            },
            {
                "t1name": "四川省",
                "t2": [
                    {
                        "t2name": "宜宾市",
                        "t3": [
                            {
                                "t3name": "翠屏区"
                            },
                            {
                                "t3name": "宜宾县"
                            },
                            {
                                "t3name": "南溪县"
                            },
                            {
                                "t3name": "屏山县"
                            },
                            {
                                "t3name": "兴文县"
                            },
                            {
                                "t3name": "筠连县"
                            },
                            {
                                "t3name": "珙县"
                            },
                            {
                                "t3name": "高县"
                            },
                            {
                                "t3name": "长宁县"
                            },
                            {
                                "t3name": "江安县"
                            }
                        ]
                    },
                    {
                        "t2name": "巴中市",
                        "t3": [
                            {
                                "t3name": "巴州区"
                            },
                            {
                                "t3name": "南江县"
                            },
                            {
                                "t3name": "通江县"
                            },
                            {
                                "t3name": "平昌县"
                            }
                        ]
                    },
                    {
                        "t2name": "南充市",
                        "t3": [
                            {
                                "t3name": "高坪区"
                            },
                            {
                                "t3name": "顺庆区"
                            },
                            {
                                "t3name": "南部县"
                            },
                            {
                                "t3name": "嘉陵区"
                            },
                            {
                                "t3name": "蓬安县"
                            },
                            {
                                "t3name": "营山县"
                            },
                            {
                                "t3name": "西充县"
                            },
                            {
                                "t3name": "仪陇县"
                            },
                            {
                                "t3name": "阆中市"
                            }
                        ]
                    },
                    {
                        "t2name": "成都市",
                        "t3": [
                            {
                                "t3name": "成华区"
                            },
                            {
                                "t3name": "龙泉驿区"
                            },
                            {
                                "t3name": "金牛区"
                            },
                            {
                                "t3name": "武侯区"
                            },
                            {
                                "t3name": "锦江区"
                            },
                            {
                                "t3name": "青羊区"
                            },
                            {
                                "t3name": "都江堰市"
                            },
                            {
                                "t3name": "温江区"
                            },
                            {
                                "t3name": "邛崃市"
                            },
                            {
                                "t3name": "彭州市"
                            },
                            {
                                "t3name": "新津县"
                            },
                            {
                                "t3name": "郫县"
                            },
                            {
                                "t3name": "青白江区"
                            },
                            {
                                "t3name": "新都区"
                            },
                            {
                                "t3name": "双流县"
                            },
                            {
                                "t3name": "大邑县"
                            },
                            {
                                "t3name": "崇州市"
                            },
                            {
                                "t3name": "蒲江县"
                            },
                            {
                                "t3name": "金堂县"
                            }
                        ]
                    },
                    {
                        "t2name": "凉山彝族",
                        "t3": [
                            {
                                "t3name": "普格县"
                            },
                            {
                                "t3name": "宁南县"
                            },
                            {
                                "t3name": "会东县"
                            },
                            {
                                "t3name": "会理县"
                            },
                            {
                                "t3name": "喜德县"
                            },
                            {
                                "t3name": "金阳县"
                            },
                            {
                                "t3name": "西昌市"
                            },
                            {
                                "t3name": "木里"
                            },
                            {
                                "t3name": "盐源县"
                            },
                            {
                                "t3name": "德昌县"
                            },
                            {
                                "t3name": "越西县"
                            },
                            {
                                "t3name": "布拖县"
                            },
                            {
                                "t3name": "雷波县"
                            },
                            {
                                "t3name": "甘洛县"
                            },
                            {
                                "t3name": "美姑县"
                            },
                            {
                                "t3name": "冕宁县"
                            },
                            {
                                "t3name": "昭觉县"
                            }
                        ]
                    },
                    {
                        "t2name": "眉山市",
                        "t3": [
                            {
                                "t3name": "青神县"
                            },
                            {
                                "t3name": "洪雅县"
                            },
                            {
                                "t3name": "丹棱县"
                            },
                            {
                                "t3name": "仁寿县"
                            },
                            {
                                "t3name": "彭山县"
                            },
                            {
                                "t3name": "东坡区"
                            }
                        ]
                    },
                    {
                        "t2name": "阿坝市",
                        "t3": [
                            {
                                "t3name": "壤塘县"
                            },
                            {
                                "t3name": "马尔康县"
                            },
                            {
                                "t3name": "黑水县"
                            },
                            {
                                "t3name": "小金县"
                            },
                            {
                                "t3name": "金川县"
                            },
                            {
                                "t3name": "理县"
                            },
                            {
                                "t3name": "茂县"
                            },
                            {
                                "t3name": "阿坝县"
                            },
                            {
                                "t3name": "汶川县"
                            },
                            {
                                "t3name": "红原县"
                            },
                            {
                                "t3name": "松潘县"
                            },
                            {
                                "t3name": "九寨沟县"
                            },
                            {
                                "t3name": "若尔盖县"
                            }
                        ]
                    },
                    {
                        "t2name": "乐山市",
                        "t3": [
                            {
                                "t3name": "峨眉山市"
                            },
                            {
                                "t3name": "马边彝族"
                            },
                            {
                                "t3name": "沐川县"
                            },
                            {
                                "t3name": "峨边彝族"
                            },
                            {
                                "t3name": "市中区"
                            },
                            {
                                "t3name": "沙湾区"
                            },
                            {
                                "t3name": "五通桥区"
                            },
                            {
                                "t3name": "金口河区"
                            },
                            {
                                "t3name": "犍为县"
                            },
                            {
                                "t3name": "井研县"
                            },
                            {
                                "t3name": "夹江县"
                            }
                        ]
                    },
                    {
                        "t2name": "绵阳市",
                        "t3": [
                            {
                                "t3name": "盐亭县"
                            },
                            {
                                "t3name": "安县"
                            },
                            {
                                "t3name": "游仙区"
                            },
                            {
                                "t3name": "三台县"
                            },
                            {
                                "t3name": "涪城区"
                            },
                            {
                                "t3name": "北川羌族"
                            },
                            {
                                "t3name": "梓潼县"
                            },
                            {
                                "t3name": "江油市"
                            },
                            {
                                "t3name": "平武县"
                            }
                        ]
                    },
                    {
                        "t2name": "广安市",
                        "t3": [
                            {
                                "t3name": "广安区"
                            },
                            {
                                "t3name": "邻水县"
                            },
                            {
                                "t3name": "华蓥市"
                            },
                            {
                                "t3name": "武胜县"
                            },
                            {
                                "t3name": "岳池县"
                            }
                        ]
                    },
                    {
                        "t2name": "广元市",
                        "t3": [
                            {
                                "t3name": "元坝区"
                            },
                            {
                                "t3name": "市中区"
                            },
                            {
                                "t3name": "旺苍县"
                            },
                            {
                                "t3name": "朝天区"
                            },
                            {
                                "t3name": "苍溪县"
                            },
                            {
                                "t3name": "剑阁县"
                            },
                            {
                                "t3name": "青川县"
                            }
                        ]
                    },
                    {
                        "t2name": "德阳市",
                        "t3": [
                            {
                                "t3name": "广汉市"
                            },
                            {
                                "t3name": "什邡市"
                            },
                            {
                                "t3name": "中江县"
                            },
                            {
                                "t3name": "罗江县"
                            },
                            {
                                "t3name": "绵竹市"
                            },
                            {
                                "t3name": "旌阳区"
                            }
                        ]
                    },
                    {
                        "t2name": "资阳市",
                        "t3": [
                            {
                                "t3name": "安岳县"
                            },
                            {
                                "t3name": "乐至县"
                            },
                            {
                                "t3name": "雁江区"
                            },
                            {
                                "t3name": "简阳市"
                            }
                        ]
                    },
                    {
                        "t2name": "达州市",
                        "t3": [
                            {
                                "t3name": "宣汉县"
                            },
                            {
                                "t3name": "开江县"
                            },
                            {
                                "t3name": "大竹县"
                            },
                            {
                                "t3name": "渠县"
                            },
                            {
                                "t3name": "通川区"
                            },
                            {
                                "t3name": "达县"
                            },
                            {
                                "t3name": "万源市"
                            }
                        ]
                    },
                    {
                        "t2name": "泸州市",
                        "t3": [
                            {
                                "t3name": "古蔺县"
                            },
                            {
                                "t3name": "纳溪区"
                            },
                            {
                                "t3name": "江阳区"
                            },
                            {
                                "t3name": "叙永县"
                            },
                            {
                                "t3name": "合江县"
                            },
                            {
                                "t3name": "泸县"
                            },
                            {
                                "t3name": "龙马潭区"
                            }
                        ]
                    },
                    {
                        "t2name": "自贡市",
                        "t3": [
                            {
                                "t3name": "自流井区"
                            },
                            {
                                "t3name": "贡井区"
                            },
                            {
                                "t3name": "大安区"
                            },
                            {
                                "t3name": "沿滩区"
                            },
                            {
                                "t3name": "荣县"
                            },
                            {
                                "t3name": "富顺县"
                            }
                        ]
                    },
                    {
                        "t2name": "遂宁市",
                        "t3": [
                            {
                                "t3name": "蓬溪县"
                            },
                            {
                                "t3name": "安居区"
                            },
                            {
                                "t3name": "船山区"
                            },
                            {
                                "t3name": "大英县"
                            },
                            {
                                "t3name": "射洪县"
                            }
                        ]
                    },
                    {
                        "t2name": "甘孜藏族",
                        "t3": [
                            {
                                "t3name": "色达县"
                            },
                            {
                                "t3name": "理塘县"
                            },
                            {
                                "t3name": "巴塘县"
                            },
                            {
                                "t3name": "乡城县"
                            },
                            {
                                "t3name": "稻城县"
                            },
                            {
                                "t3name": "得荣县"
                            },
                            {
                                "t3name": "丹巴县"
                            },
                            {
                                "t3name": "九龙县"
                            },
                            {
                                "t3name": "雅江县"
                            },
                            {
                                "t3name": "道孚县"
                            },
                            {
                                "t3name": "炉霍县"
                            },
                            {
                                "t3name": "甘孜县"
                            },
                            {
                                "t3name": "新龙县"
                            },
                            {
                                "t3name": "德格县"
                            },
                            {
                                "t3name": "白玉县"
                            },
                            {
                                "t3name": "石渠县"
                            },
                            {
                                "t3name": "泸定县"
                            },
                            {
                                "t3name": "康定县"
                            }
                        ]
                    },
                    {
                        "t2name": "雅安市",
                        "t3": [
                            {
                                "t3name": "名山县"
                            },
                            {
                                "t3name": "芦山县"
                            },
                            {
                                "t3name": "天全县"
                            },
                            {
                                "t3name": "宝兴县"
                            },
                            {
                                "t3name": "荥经县"
                            },
                            {
                                "t3name": "雨城区"
                            },
                            {
                                "t3name": "石棉县"
                            },
                            {
                                "t3name": "汉源县"
                            }
                        ]
                    },
                    {
                        "t2name": "内江市",
                        "t3": [
                            {
                                "t3name": "隆昌县"
                            },
                            {
                                "t3name": "资中县"
                            },
                            {
                                "t3name": "威远县"
                            },
                            {
                                "t3name": "东兴区"
                            },
                            {
                                "t3name": "市中区"
                            }
                        ]
                    },
                    {
                        "t2name": "攀枝花市",
                        "t3": [
                            {
                                "t3name": "西区"
                            },
                            {
                                "t3name": "仁和区"
                            },
                            {
                                "t3name": "盐边县"
                            },
                            {
                                "t3name": "米易县"
                            },
                            {
                                "t3name": "东区"
                            }
                        ]
                    }
                ]
            },
            {
                "t1name": "湖北省",
                "t2": [
                    {
                        "t2name": "咸宁市",
                        "t3": [
                            {
                                "t3name": "嘉鱼县"
                            },
                            {
                                "t3name": "咸安区"
                            },
                            {
                                "t3name": "崇阳县"
                            },
                            {
                                "t3name": "通城县"
                            },
                            {
                                "t3name": "赤壁市"
                            },
                            {
                                "t3name": "通山县"
                            }
                        ]
                    },
                    {
                        "t2name": "宜昌市",
                        "t3": [
                            {
                                "t3name": "西陵区"
                            },
                            {
                                "t3name": "枝江市"
                            },
                            {
                                "t3name": "当阳市"
                            },
                            {
                                "t3name": "兴山县"
                            },
                            {
                                "t3name": "远安县"
                            },
                            {
                                "t3name": "长阳"
                            },
                            {
                                "t3name": "秭归县"
                            },
                            {
                                "t3name": "点军区"
                            },
                            {
                                "t3name": "伍家岗区"
                            },
                            {
                                "t3name": "夷陵区"
                            },
                            {
                                "t3name": "猇亭区"
                            },
                            {
                                "t3name": "宜都市"
                            },
                            {
                                "t3name": "五峰"
                            }
                        ]
                    },
                    {
                        "t2name": "黄冈市",
                        "t3": [
                            {
                                "t3name": "武穴市"
                            },
                            {
                                "t3name": "黄州区"
                            },
                            {
                                "t3name": "团风县"
                            },
                            {
                                "t3name": "红安县"
                            },
                            {
                                "t3name": "罗田县"
                            },
                            {
                                "t3name": "英山县"
                            },
                            {
                                "t3name": "浠水县"
                            },
                            {
                                "t3name": "麻城市"
                            },
                            {
                                "t3name": "黄梅县"
                            },
                            {
                                "t3name": "蕲春县"
                            }
                        ]
                    },
                    {
                        "t2name": "荆州市",
                        "t3": [
                            {
                                "t3name": "江陵县"
                            },
                            {
                                "t3name": "石首市"
                            },
                            {
                                "t3name": "洪湖市"
                            },
                            {
                                "t3name": "松滋市"
                            },
                            {
                                "t3name": "荆州区"
                            },
                            {
                                "t3name": "沙市区"
                            },
                            {
                                "t3name": "监利县"
                            },
                            {
                                "t3name": "公安县"
                            }
                        ]
                    },
                    {
                        "t2name": "孝感市",
                        "t3": [
                            {
                                "t3name": "应城市"
                            },
                            {
                                "t3name": "云梦县"
                            },
                            {
                                "t3name": "大悟县"
                            },
                            {
                                "t3name": "孝昌县"
                            },
                            {
                                "t3name": "汉川市"
                            },
                            {
                                "t3name": "安陆市"
                            },
                            {
                                "t3name": "孝南区"
                            }
                        ]
                    },
                    {
                        "t2name": "荆门市",
                        "t3": [
                            {
                                "t3name": "京山县"
                            },
                            {
                                "t3name": "沙洋县"
                            },
                            {
                                "t3name": "东宝区"
                            },
                            {
                                "t3name": "掇刀区"
                            },
                            {
                                "t3name": "钟祥市"
                            }
                        ]
                    },
                    {
                        "t2name": "十堰市",
                        "t3": [
                            {
                                "t3name": "丹江口市"
                            },
                            {
                                "t3name": "张湾区"
                            },
                            {
                                "t3name": "郧县"
                            },
                            {
                                "t3name": "茅箭区"
                            },
                            {
                                "t3name": "竹溪县"
                            },
                            {
                                "t3name": "房县"
                            },
                            {
                                "t3name": "郧西县"
                            },
                            {
                                "t3name": "竹山县"
                            }
                        ]
                    },
                    {
                        "t2name": "鄂州市",
                        "t3": [
                            {
                                "t3name": "华容区"
                            },
                            {
                                "t3name": "鄂城区"
                            },
                            {
                                "t3name": "梁子湖区"
                            }
                        ]
                    },
                    {
                        "t2name": "天门市",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "潜江市",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "恩施土家",
                        "t3": [
                            {
                                "t3name": "来凤县"
                            },
                            {
                                "t3name": "鹤峰县"
                            },
                            {
                                "t3name": "恩施市"
                            },
                            {
                                "t3name": "利川市"
                            },
                            {
                                "t3name": "宣恩县"
                            },
                            {
                                "t3name": "咸丰县"
                            },
                            {
                                "t3name": "建始县"
                            },
                            {
                                "t3name": "巴东县"
                            }
                        ]
                    },
                    {
                        "t2name": "武汉市",
                        "t3": [
                            {
                                "t3name": "蔡甸区"
                            },
                            {
                                "t3name": "汉南区"
                            },
                            {
                                "t3name": "洪山区"
                            },
                            {
                                "t3name": "东西湖区"
                            },
                            {
                                "t3name": "新洲区"
                            },
                            {
                                "t3name": "黄陂区"
                            },
                            {
                                "t3name": "江夏区"
                            },
                            {
                                "t3name": "江岸区"
                            },
                            {
                                "t3name": "江汉区"
                            },
                            {
                                "t3name": "硚口区"
                            },
                            {
                                "t3name": "汉阳区"
                            },
                            {
                                "t3name": "武昌区"
                            },
                            {
                                "t3name": "青山区"
                            }
                        ]
                    },
                    {
                        "t2name": "仙桃市",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "神农架林",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "随州市",
                        "t3": [
                            {
                                "t3name": "曾都区"
                            },
                            {
                                "t3name": "广水市"
                            }
                        ]
                    },
                    {
                        "t2name": "黄石市",
                        "t3": [
                            {
                                "t3name": "大冶市"
                            },
                            {
                                "t3name": "阳新县"
                            },
                            {
                                "t3name": "铁山区"
                            },
                            {
                                "t3name": "下陆区"
                            },
                            {
                                "t3name": "西塞山区"
                            },
                            {
                                "t3name": "黄石港区"
                            }
                        ]
                    },
                    {
                        "t2name": "襄樊市",
                        "t3": [
                            {
                                "t3name": "枣阳市"
                            },
                            {
                                "t3name": "老河口市"
                            },
                            {
                                "t3name": "樊城区"
                            },
                            {
                                "t3name": "襄城区"
                            },
                            {
                                "t3name": "南漳县"
                            },
                            {
                                "t3name": "襄阳区"
                            },
                            {
                                "t3name": "保康县"
                            },
                            {
                                "t3name": "谷城县"
                            },
                            {
                                "t3name": "宜城市"
                            }
                        ]
                    }
                ]
            },
            {
                "t1name": "河北省",
                "t2": [
                    {
                        "t2name": "张家口市",
                        "t3": [
                            {
                                "t3name": "怀来县"
                            },
                            {
                                "t3name": "涿鹿县"
                            },
                            {
                                "t3name": "桥东区"
                            },
                            {
                                "t3name": "万全县"
                            },
                            {
                                "t3name": "宣化区"
                            },
                            {
                                "t3name": "桥西区"
                            },
                            {
                                "t3name": "宣化县"
                            },
                            {
                                "t3name": "下花园区"
                            },
                            {
                                "t3name": "康保县"
                            },
                            {
                                "t3name": "张北县"
                            },
                            {
                                "t3name": "沽源县"
                            },
                            {
                                "t3name": "尚义县"
                            },
                            {
                                "t3name": "怀安县"
                            },
                            {
                                "t3name": "赤城县"
                            },
                            {
                                "t3name": "崇礼县"
                            },
                            {
                                "t3name": "蔚县"
                            },
                            {
                                "t3name": "阳原县"
                            }
                        ]
                    },
                    {
                        "t2name": "邯郸市",
                        "t3": [
                            {
                                "t3name": "成安县"
                            },
                            {
                                "t3name": "大名县"
                            },
                            {
                                "t3name": "邯郸县"
                            },
                            {
                                "t3name": "临漳县"
                            },
                            {
                                "t3name": "复兴区"
                            },
                            {
                                "t3name": "峰峰矿区"
                            },
                            {
                                "t3name": "邯山区"
                            },
                            {
                                "t3name": "丛台区"
                            },
                            {
                                "t3name": "肥乡县"
                            },
                            {
                                "t3name": "魏县"
                            },
                            {
                                "t3name": "永年县"
                            },
                            {
                                "t3name": "鸡泽县"
                            },
                            {
                                "t3name": "涉县"
                            },
                            {
                                "t3name": "磁县"
                            },
                            {
                                "t3name": "邱县"
                            },
                            {
                                "t3name": "曲周县"
                            },
                            {
                                "t3name": "武安市"
                            },
                            {
                                "t3name": "馆陶县"
                            },
                            {
                                "t3name": "广平县"
                            }
                        ]
                    },
                    {
                        "t2name": "邢台市",
                        "t3": [
                            {
                                "t3name": "新河县"
                            },
                            {
                                "t3name": "广宗县"
                            },
                            {
                                "t3name": "清河县"
                            },
                            {
                                "t3name": "桥东区"
                            },
                            {
                                "t3name": "威县"
                            },
                            {
                                "t3name": "临西县"
                            },
                            {
                                "t3name": "平乡县"
                            },
                            {
                                "t3name": "沙河市"
                            },
                            {
                                "t3name": "宁晋县"
                            },
                            {
                                "t3name": "巨鹿县"
                            },
                            {
                                "t3name": "南宫市"
                            },
                            {
                                "t3name": "柏乡县"
                            },
                            {
                                "t3name": "隆尧县"
                            },
                            {
                                "t3name": "任县"
                            },
                            {
                                "t3name": "南和县"
                            },
                            {
                                "t3name": "桥西区"
                            },
                            {
                                "t3name": "邢台县"
                            },
                            {
                                "t3name": "临城县"
                            },
                            {
                                "t3name": "内丘县"
                            }
                        ]
                    },
                    {
                        "t2name": "衡水市",
                        "t3": [
                            {
                                "t3name": "武强县"
                            },
                            {
                                "t3name": "饶阳县"
                            },
                            {
                                "t3name": "故城县"
                            },
                            {
                                "t3name": "安平县"
                            },
                            {
                                "t3name": "枣强县"
                            },
                            {
                                "t3name": "武邑县"
                            },
                            {
                                "t3name": "深州市"
                            },
                            {
                                "t3name": "冀州市"
                            },
                            {
                                "t3name": "阜城县"
                            },
                            {
                                "t3name": "景县"
                            },
                            {
                                "t3name": "桃城区"
                            }
                        ]
                    },
                    {
                        "t2name": "秦皇岛",
                        "t3": [
                            {
                                "t3name": "海港区"
                            },
                            {
                                "t3name": "昌黎县"
                            },
                            {
                                "t3name": "青龙满族自治县"
                            },
                            {
                                "t3name": "北戴河区"
                            },
                            {
                                "t3name": "山海关区"
                            },
                            {
                                "t3name": "卢龙县"
                            },
                            {
                                "t3name": "抚宁县"
                            }
                        ]
                    },
                    {
                        "t2name": "廊坊市",
                        "t3": [
                            {
                                "t3name": "三河市"
                            },
                            {
                                "t3name": "安次区"
                            },
                            {
                                "t3name": "大城县"
                            },
                            {
                                "t3name": "文安县"
                            },
                            {
                                "t3name": "永清县"
                            },
                            {
                                "t3name": "香河县"
                            },
                            {
                                "t3name": "固安县"
                            },
                            {
                                "t3name": "广阳区"
                            },
                            {
                                "t3name": "大厂回族自治县"
                            },
                            {
                                "t3name": "霸州市"
                            }
                        ]
                    },
                    {
                        "t2name": "保定市",
                        "t3": [
                            {
                                "t3name": "涿州市"
                            },
                            {
                                "t3name": "雄县"
                            },
                            {
                                "t3name": "蠡县"
                            },
                            {
                                "t3name": "曲阳县"
                            },
                            {
                                "t3name": "博野县"
                            },
                            {
                                "t3name": "顺平县"
                            },
                            {
                                "t3name": "望都县"
                            },
                            {
                                "t3name": "涞源县"
                            },
                            {
                                "t3name": "易县"
                            },
                            {
                                "t3name": "安新县"
                            },
                            {
                                "t3name": "北市区"
                            },
                            {
                                "t3name": "新市区"
                            },
                            {
                                "t3name": "清苑县"
                            },
                            {
                                "t3name": "涞水县"
                            },
                            {
                                "t3name": "南市区"
                            },
                            {
                                "t3name": "满城县"
                            },
                            {
                                "t3name": "定兴县"
                            },
                            {
                                "t3name": "唐县"
                            },
                            {
                                "t3name": "阜平县"
                            },
                            {
                                "t3name": "徐水县"
                            },
                            {
                                "t3name": "高阳县"
                            },
                            {
                                "t3name": "容城县"
                            },
                            {
                                "t3name": "安国市"
                            },
                            {
                                "t3name": "定州市"
                            },
                            {
                                "t3name": "高碑店市"
                            }
                        ]
                    },
                    {
                        "t2name": "承德市",
                        "t3": [
                            {
                                "t3name": "围场满族蒙古族自治县"
                            },
                            {
                                "t3name": "宽城满族自治县"
                            },
                            {
                                "t3name": "丰宁满族自治县"
                            },
                            {
                                "t3name": "隆化县"
                            },
                            {
                                "t3name": "滦平县"
                            },
                            {
                                "t3name": "平泉县"
                            },
                            {
                                "t3name": "兴隆县"
                            },
                            {
                                "t3name": "承德县"
                            },
                            {
                                "t3name": "鹰手营子矿区"
                            },
                            {
                                "t3name": "双滦区"
                            },
                            {
                                "t3name": "双桥区"
                            }
                        ]
                    },
                    {
                        "t2name": "唐山市",
                        "t3": [
                            {
                                "t3name": "迁安市"
                            },
                            {
                                "t3name": "遵化市"
                            },
                            {
                                "t3name": "唐海县"
                            },
                            {
                                "t3name": "路北区"
                            },
                            {
                                "t3name": "古冶区"
                            },
                            {
                                "t3name": "开平区"
                            },
                            {
                                "t3name": "丰南区"
                            },
                            {
                                "t3name": "丰润区"
                            },
                            {
                                "t3name": "滦县"
                            },
                            {
                                "t3name": "滦南县"
                            },
                            {
                                "t3name": "乐亭县"
                            },
                            {
                                "t3name": "迁西县"
                            },
                            {
                                "t3name": "玉田县"
                            },
                            {
                                "t3name": "路南区"
                            }
                        ]
                    },
                    {
                        "t2name": "沧州市",
                        "t3": [
                            {
                                "t3name": "任丘市"
                            },
                            {
                                "t3name": "黄骅市"
                            },
                            {
                                "t3name": "献县"
                            },
                            {
                                "t3name": "吴桥县"
                            },
                            {
                                "t3name": "河间市"
                            },
                            {
                                "t3name": "肃宁县"
                            },
                            {
                                "t3name": "南皮县"
                            },
                            {
                                "t3name": "泊头市"
                            },
                            {
                                "t3name": "孟村回族自治县"
                            },
                            {
                                "t3name": "青县"
                            },
                            {
                                "t3name": "东光县"
                            },
                            {
                                "t3name": "海兴县"
                            },
                            {
                                "t3name": "盐山县"
                            },
                            {
                                "t3name": "新华区"
                            },
                            {
                                "t3name": "运河区"
                            },
                            {
                                "t3name": "沧县"
                            }
                        ]
                    },
                    {
                        "t2name": "石家庄",
                        "t3": [
                            {
                                "t3name": "藁城市"
                            },
                            {
                                "t3name": "辛集市"
                            },
                            {
                                "t3name": "新乐市"
                            },
                            {
                                "t3name": "晋州市"
                            },
                            {
                                "t3name": "平山县"
                            },
                            {
                                "t3name": "无极县"
                            },
                            {
                                "t3name": "赵县"
                            },
                            {
                                "t3name": "元氏县"
                            },
                            {
                                "t3name": "鹿泉市"
                            },
                            {
                                "t3name": "桥东区"
                            },
                            {
                                "t3name": "长安区"
                            },
                            {
                                "t3name": "新华区"
                            },
                            {
                                "t3name": "桥西区"
                            },
                            {
                                "t3name": "深泽县"
                            },
                            {
                                "t3name": "赞皇县"
                            },
                            {
                                "t3name": "井陉县"
                            },
                            {
                                "t3name": "正定县"
                            },
                            {
                                "t3name": "井陉矿区"
                            },
                            {
                                "t3name": "裕华区"
                            },
                            {
                                "t3name": "灵寿县"
                            },
                            {
                                "t3name": "高邑县"
                            },
                            {
                                "t3name": "栾城县"
                            },
                            {
                                "t3name": "行唐县"
                            }
                        ]
                    }
                ]
            },
            {
                "t1name": "云南省",
                "t2": [
                    {
                        "t2name": "德宏傣族",
                        "t3": [
                            {
                                "t3name": "瑞丽"
                            },
                            {
                                "t3name": "潞西"
                            },
                            {
                                "t3name": "盈江"
                            },
                            {
                                "t3name": "梁河"
                            },
                            {
                                "t3name": "陇川"
                            }
                        ]
                    },
                    {
                        "t2name": "玉溪市",
                        "t3": [
                            {
                                "t3name": "红塔区"
                            },
                            {
                                "t3name": "江川县"
                            },
                            {
                                "t3name": "澄江县"
                            },
                            {
                                "t3name": "通海县"
                            },
                            {
                                "t3name": "华宁县"
                            },
                            {
                                "t3name": "易门县"
                            },
                            {
                                "t3name": "元江"
                            },
                            {
                                "t3name": "新平"
                            },
                            {
                                "t3name": "峨山"
                            }
                        ]
                    },
                    {
                        "t2name": "曲靖市",
                        "t3": [
                            {
                                "t3name": "富源县"
                            },
                            {
                                "t3name": "会泽县"
                            },
                            {
                                "t3name": "沾益县"
                            },
                            {
                                "t3name": "宣威市"
                            },
                            {
                                "t3name": "陆良县"
                            },
                            {
                                "t3name": "马龙县"
                            },
                            {
                                "t3name": "麒麟区"
                            },
                            {
                                "t3name": "罗平县"
                            },
                            {
                                "t3name": "师宗县"
                            }
                        ]
                    },
                    {
                        "t2name": "保山市",
                        "t3": [
                            {
                                "t3name": "腾冲"
                            },
                            {
                                "t3name": "施甸"
                            },
                            {
                                "t3name": "昌宁"
                            },
                            {
                                "t3name": "龙陵"
                            },
                            {
                                "t3name": "隆阳区"
                            }
                        ]
                    },
                    {
                        "t2name": "怒江傈僳",
                        "t3": [
                            {
                                "t3name": "泸水"
                            },
                            {
                                "t3name": "兰坪"
                            },
                            {
                                "t3name": "贡山"
                            },
                            {
                                "t3name": "福贡"
                            }
                        ]
                    },
                    {
                        "t2name": "迪庆藏族",
                        "t3": [
                            {
                                "t3name": "维西"
                            },
                            {
                                "t3name": "德钦"
                            },
                            {
                                "t3name": "香格里拉"
                            }
                        ]
                    },
                    {
                        "t2name": "昭通市",
                        "t3": [
                            {
                                "t3name": "鲁甸"
                            },
                            {
                                "t3name": "昭阳区"
                            },
                            {
                                "t3name": "水富"
                            },
                            {
                                "t3name": "大关"
                            },
                            {
                                "t3name": "永善"
                            },
                            {
                                "t3name": "巧家"
                            },
                            {
                                "t3name": "盐津"
                            },
                            {
                                "t3name": "彝良"
                            },
                            {
                                "t3name": "威信"
                            },
                            {
                                "t3name": "绥江"
                            },
                            {
                                "t3name": "镇雄"
                            }
                        ]
                    },
                    {
                        "t2name": "昆明市",
                        "t3": [
                            {
                                "t3name": "寻甸"
                            },
                            {
                                "t3name": "禄劝"
                            },
                            {
                                "t3name": "嵩明县"
                            },
                            {
                                "t3name": "石林"
                            },
                            {
                                "t3name": "富民县"
                            },
                            {
                                "t3name": "宜良县"
                            },
                            {
                                "t3name": "呈贡县"
                            },
                            {
                                "t3name": "晋宁县"
                            },
                            {
                                "t3name": "西山区"
                            },
                            {
                                "t3name": "东川区"
                            },
                            {
                                "t3name": "盘龙区"
                            },
                            {
                                "t3name": "官渡区"
                            },
                            {
                                "t3name": "五华区"
                            },
                            {
                                "t3name": "安宁市"
                            }
                        ]
                    },
                    {
                        "t2name": "楚雄彝族",
                        "t3": [
                            {
                                "t3name": "武定"
                            },
                            {
                                "t3name": "禄丰"
                            },
                            {
                                "t3name": "沧源"
                            },
                            {
                                "t3name": "双柏"
                            },
                            {
                                "t3name": "楚雄"
                            },
                            {
                                "t3name": "南华"
                            },
                            {
                                "t3name": "牟定"
                            },
                            {
                                "t3name": "大姚"
                            },
                            {
                                "t3name": "姚安"
                            },
                            {
                                "t3name": "元谋"
                            },
                            {
                                "t3name": "永仁"
                            }
                        ]
                    },
                    {
                        "t2name": "文山壮族",
                        "t3": [
                            {
                                "t3name": "广南"
                            },
                            {
                                "t3name": "富宁"
                            },
                            {
                                "t3name": "丘北"
                            },
                            {
                                "t3name": "砚山"
                            },
                            {
                                "t3name": "西畴"
                            },
                            {
                                "t3name": "文山"
                            },
                            {
                                "t3name": "麻栗坡"
                            },
                            {
                                "t3name": "马关"
                            }
                        ]
                    },
                    {
                        "t2name": "西双版纳",
                        "t3": [
                            {
                                "t3name": "景洪"
                            },
                            {
                                "t3name": "勐腊"
                            },
                            {
                                "t3name": "勐海"
                            }
                        ]
                    },
                    {
                        "t2name": "丽江市",
                        "t3": [
                            {
                                "t3name": "古城区"
                            },
                            {
                                "t3name": "宁蒗"
                            },
                            {
                                "t3name": "华坪"
                            },
                            {
                                "t3name": "永胜"
                            },
                            {
                                "t3name": "玉龙"
                            }
                        ]
                    },
                    {
                        "t2name": "红河哈尼",
                        "t3": [
                            {
                                "t3name": "河口"
                            },
                            {
                                "t3name": "绿春县"
                            },
                            {
                                "t3name": "建水"
                            },
                            {
                                "t3name": "石屏"
                            },
                            {
                                "t3name": "蒙自"
                            },
                            {
                                "t3name": "屏边"
                            },
                            {
                                "t3name": "个旧"
                            },
                            {
                                "t3name": "开远"
                            },
                            {
                                "t3name": "元阳"
                            },
                            {
                                "t3name": "红河"
                            },
                            {
                                "t3name": "金平"
                            },
                            {
                                "t3name": "弥勒"
                            },
                            {
                                "t3name": "泸西"
                            }
                        ]
                    },
                    {
                        "t2name": "大理白族",
                        "t3": [
                            {
                                "t3name": "弥渡"
                            },
                            {
                                "t3name": "南涧"
                            },
                            {
                                "t3name": "巍山"
                            },
                            {
                                "t3name": "永平"
                            },
                            {
                                "t3name": "云龙"
                            },
                            {
                                "t3name": "洱源"
                            },
                            {
                                "t3name": "剑川"
                            },
                            {
                                "t3name": "鹤庆"
                            },
                            {
                                "t3name": "漾濞"
                            },
                            {
                                "t3name": "大理"
                            },
                            {
                                "t3name": "宾川"
                            },
                            {
                                "t3name": "祥云"
                            }
                        ]
                    },
                    {
                        "t2name": "临沧市",
                        "t3": [
                            {
                                "t3name": "耿马"
                            },
                            {
                                "t3name": "镇康"
                            },
                            {
                                "t3name": "双江"
                            },
                            {
                                "t3name": "临翔区"
                            },
                            {
                                "t3name": "凤庆"
                            },
                            {
                                "t3name": "云县"
                            },
                            {
                                "t3name": "永德"
                            }
                        ]
                    },
                    {
                        "t2name": "思茅市",
                        "t3": [
                            {
                                "t3name": "镇沅"
                            },
                            {
                                "t3name": "景谷"
                            },
                            {
                                "t3name": "景东"
                            },
                            {
                                "t3name": "墨江"
                            },
                            {
                                "t3name": "普洱"
                            },
                            {
                                "t3name": "翠云"
                            },
                            {
                                "t3name": "江城"
                            },
                            {
                                "t3name": "孟连"
                            },
                            {
                                "t3name": "澜沧"
                            },
                            {
                                "t3name": "西盟"
                            }
                        ]
                    }
                ]
            },
            {
                "t1name": "黑龙江省",
                "t2": [
                    {
                        "t2name": "鹤岗市",
                        "t3": [
                            {
                                "t3name": "向阳区"
                            },
                            {
                                "t3name": "工农区"
                            },
                            {
                                "t3name": "东山区"
                            },
                            {
                                "t3name": "兴山区"
                            },
                            {
                                "t3name": "南山区"
                            },
                            {
                                "t3name": "兴安区"
                            },
                            {
                                "t3name": "萝北县"
                            },
                            {
                                "t3name": "绥滨县"
                            }
                        ]
                    },
                    {
                        "t2name": "大兴安岭",
                        "t3": [
                            {
                                "t3name": "呼玛县"
                            },
                            {
                                "t3name": "漠河县"
                            },
                            {
                                "t3name": "塔河县"
                            }
                        ]
                    },
                    {
                        "t2name": "大庆市",
                        "t3": [
                            {
                                "t3name": "萨尔图区"
                            },
                            {
                                "t3name": "龙凤区"
                            },
                            {
                                "t3name": "杜尔伯特蒙古族自治县"
                            },
                            {
                                "t3name": "林甸县"
                            },
                            {
                                "t3name": "肇源县"
                            },
                            {
                                "t3name": "肇州县"
                            },
                            {
                                "t3name": "大同区"
                            },
                            {
                                "t3name": "红岗区"
                            },
                            {
                                "t3name": "让胡路区"
                            }
                        ]
                    },
                    {
                        "t2name": "七台河市",
                        "t3": [
                            {
                                "t3name": "勃利县"
                            },
                            {
                                "t3name": "新兴区"
                            },
                            {
                                "t3name": "桃山区"
                            },
                            {
                                "t3name": "茄子河区"
                            }
                        ]
                    },
                    {
                        "t2name": "齐齐哈尔",
                        "t3": [
                            {
                                "t3name": "富裕县"
                            },
                            {
                                "t3name": "克山县"
                            },
                            {
                                "t3name": "铁锋区"
                            },
                            {
                                "t3name": "建华区"
                            },
                            {
                                "t3name": "龙沙区"
                            },
                            {
                                "t3name": "依安县"
                            },
                            {
                                "t3name": "泰来县"
                            },
                            {
                                "t3name": "甘南县"
                            },
                            {
                                "t3name": "昂昂溪区"
                            },
                            {
                                "t3name": "富拉尔基区"
                            },
                            {
                                "t3name": "碾子山区"
                            },
                            {
                                "t3name": "梅里斯达斡尔族区"
                            },
                            {
                                "t3name": "龙江县"
                            },
                            {
                                "t3name": "拜泉县"
                            },
                            {
                                "t3name": "克东县"
                            },
                            {
                                "t3name": "讷河市"
                            }
                        ]
                    },
                    {
                        "t2name": "牡丹江市",
                        "t3": [
                            {
                                "t3name": "东宁县"
                            },
                            {
                                "t3name": "西安区"
                            },
                            {
                                "t3name": "爱民区"
                            },
                            {
                                "t3name": "阳明区"
                            },
                            {
                                "t3name": "宁安市"
                            },
                            {
                                "t3name": "海林市"
                            },
                            {
                                "t3name": "绥芬河市"
                            },
                            {
                                "t3name": "林口县"
                            },
                            {
                                "t3name": "东安区"
                            },
                            {
                                "t3name": "穆棱市"
                            }
                        ]
                    },
                    {
                        "t2name": "黑河市",
                        "t3": [
                            {
                                "t3name": "孙吴县"
                            },
                            {
                                "t3name": "北安市"
                            },
                            {
                                "t3name": "爱辉区"
                            },
                            {
                                "t3name": "逊克县"
                            },
                            {
                                "t3name": "五大连池市"
                            },
                            {
                                "t3name": "嫩江县"
                            }
                        ]
                    },
                    {
                        "t2name": "双鸭山市",
                        "t3": [
                            {
                                "t3name": "集贤县"
                            },
                            {
                                "t3name": "友谊县"
                            },
                            {
                                "t3name": "宝清县"
                            },
                            {
                                "t3name": "饶河县"
                            },
                            {
                                "t3name": "尖山区"
                            },
                            {
                                "t3name": "岭东区"
                            },
                            {
                                "t3name": "四方台区"
                            },
                            {
                                "t3name": "宝山区"
                            }
                        ]
                    },
                    {
                        "t2name": "绥化市",
                        "t3": [
                            {
                                "t3name": "海伦市"
                            },
                            {
                                "t3name": "青冈县"
                            },
                            {
                                "t3name": "庆安县"
                            },
                            {
                                "t3name": "绥棱县"
                            },
                            {
                                "t3name": "明水县"
                            },
                            {
                                "t3name": "肇东市"
                            },
                            {
                                "t3name": "安达市"
                            },
                            {
                                "t3name": "望奎县"
                            },
                            {
                                "t3name": "兰西县"
                            },
                            {
                                "t3name": "北林区"
                            }
                        ]
                    },
                    {
                        "t2name": "伊春市",
                        "t3": [
                            {
                                "t3name": "上甘岭区"
                            },
                            {
                                "t3name": "友好区"
                            },
                            {
                                "t3name": "南岔区"
                            },
                            {
                                "t3name": "伊春区"
                            },
                            {
                                "t3name": "嘉荫县"
                            },
                            {
                                "t3name": "铁力市"
                            },
                            {
                                "t3name": "红星区"
                            },
                            {
                                "t3name": "乌马河区"
                            },
                            {
                                "t3name": "汤旺河区"
                            },
                            {
                                "t3name": "金山屯区"
                            },
                            {
                                "t3name": "五营区"
                            },
                            {
                                "t3name": "新青区"
                            },
                            {
                                "t3name": "美溪区"
                            },
                            {
                                "t3name": "西林区"
                            },
                            {
                                "t3name": "翠峦区"
                            },
                            {
                                "t3name": "带岭区"
                            },
                            {
                                "t3name": "乌伊岭区"
                            }
                        ]
                    },
                    {
                        "t2name": "佳木斯市",
                        "t3": [
                            {
                                "t3name": "桦川县"
                            },
                            {
                                "t3name": "汤原县"
                            },
                            {
                                "t3name": "抚远县"
                            },
                            {
                                "t3name": "同江市"
                            },
                            {
                                "t3name": "富锦市"
                            },
                            {
                                "t3name": "向阳区"
                            },
                            {
                                "t3name": "永红区"
                            },
                            {
                                "t3name": "东风区"
                            },
                            {
                                "t3name": "前进区"
                            },
                            {
                                "t3name": "桦南县"
                            },
                            {
                                "t3name": "郊区"
                            }
                        ]
                    },
                    {
                        "t2name": "哈尔滨市",
                        "t3": [
                            {
                                "t3name": "五常市"
                            },
                            {
                                "t3name": "尚志市"
                            },
                            {
                                "t3name": "双城市"
                            },
                            {
                                "t3name": "阿城市"
                            },
                            {
                                "t3name": "延寿县"
                            },
                            {
                                "t3name": "通河县"
                            },
                            {
                                "t3name": "木兰县"
                            },
                            {
                                "t3name": "依兰县"
                            },
                            {
                                "t3name": "方正县"
                            },
                            {
                                "t3name": "松北区"
                            },
                            {
                                "t3name": "呼兰区"
                            },
                            {
                                "t3name": "动力区"
                            },
                            {
                                "t3name": "平房区"
                            },
                            {
                                "t3name": "道外区"
                            },
                            {
                                "t3name": "香坊区"
                            },
                            {
                                "t3name": "南岗区"
                            },
                            {
                                "t3name": "道里区"
                            },
                            {
                                "t3name": "宾县"
                            },
                            {
                                "t3name": "巴彦县"
                            }
                        ]
                    },
                    {
                        "t2name": "鸡西市",
                        "t3": [
                            {
                                "t3name": "虎林市"
                            },
                            {
                                "t3name": "密山市"
                            },
                            {
                                "t3name": "鸡东县"
                            },
                            {
                                "t3name": "麻山区"
                            },
                            {
                                "t3name": "滴道区"
                            },
                            {
                                "t3name": "恒山区"
                            },
                            {
                                "t3name": "城子河区"
                            },
                            {
                                "t3name": "梨树区"
                            },
                            {
                                "t3name": "鸡冠区"
                            }
                        ]
                    }
                ]
            },
            {
                "t1name": "吉林省",
                "t2": [
                    {
                        "t2name": "松原市",
                        "t3": [
                            {
                                "t3name": "宁江区"
                            },
                            {
                                "t3name": "前郭尔罗斯蒙古族自治县"
                            },
                            {
                                "t3name": "长岭县"
                            },
                            {
                                "t3name": "乾安县"
                            },
                            {
                                "t3name": "扶余县"
                            }
                        ]
                    },
                    {
                        "t2name": "四平市",
                        "t3": [
                            {
                                "t3name": "铁西区"
                            },
                            {
                                "t3name": "双辽市"
                            },
                            {
                                "t3name": "伊通满族自治县"
                            },
                            {
                                "t3name": "公主岭市"
                            },
                            {
                                "t3name": "梨树县"
                            },
                            {
                                "t3name": "铁东区"
                            }
                        ]
                    },
                    {
                        "t2name": "白城市",
                        "t3": [
                            {
                                "t3name": "洮南市"
                            },
                            {
                                "t3name": "大安市"
                            },
                            {
                                "t3name": "洮北区"
                            },
                            {
                                "t3name": "镇赉县"
                            },
                            {
                                "t3name": "通榆县"
                            }
                        ]
                    },
                    {
                        "t2name": "白山市",
                        "t3": [
                            {
                                "t3name": "长白朝鲜族自治县"
                            },
                            {
                                "t3name": "靖宇县"
                            },
                            {
                                "t3name": "抚松县"
                            },
                            {
                                "t3name": "八道江区"
                            },
                            {
                                "t3name": "临江市"
                            },
                            {
                                "t3name": "江源县"
                            }
                        ]
                    },
                    {
                        "t2name": "吉林市",
                        "t3": [
                            {
                                "t3name": "舒兰市"
                            },
                            {
                                "t3name": "桦甸市"
                            },
                            {
                                "t3name": "磐石市"
                            },
                            {
                                "t3name": "丰满区"
                            },
                            {
                                "t3name": "船营区"
                            },
                            {
                                "t3name": "蛟河市"
                            },
                            {
                                "t3name": "永吉县"
                            },
                            {
                                "t3name": "龙潭区"
                            },
                            {
                                "t3name": "昌邑区"
                            }
                        ]
                    },
                    {
                        "t2name": "通化市",
                        "t3": [
                            {
                                "t3name": "集安市"
                            },
                            {
                                "t3name": "梅河口市"
                            },
                            {
                                "t3name": "二道江区"
                            },
                            {
                                "t3name": "辉南县"
                            },
                            {
                                "t3name": "东昌区"
                            },
                            {
                                "t3name": "通化县"
                            },
                            {
                                "t3name": "柳河县"
                            }
                        ]
                    },
                    {
                        "t2name": "长春市",
                        "t3": [
                            {
                                "t3name": "二道区"
                            },
                            {
                                "t3name": "朝阳区"
                            },
                            {
                                "t3name": "双阳区"
                            },
                            {
                                "t3name": "绿园区"
                            },
                            {
                                "t3name": "九台市"
                            },
                            {
                                "t3name": "农安县"
                            },
                            {
                                "t3name": "德惠市"
                            },
                            {
                                "t3name": "榆树市"
                            },
                            {
                                "t3name": "南关区"
                            },
                            {
                                "t3name": "宽城区"
                            }
                        ]
                    },
                    {
                        "t2name": "延边朝鲜",
                        "t3": [
                            {
                                "t3name": "图们市"
                            },
                            {
                                "t3name": "延吉市"
                            },
                            {
                                "t3name": "珲春市"
                            },
                            {
                                "t3name": "敦化市"
                            },
                            {
                                "t3name": "和龙市"
                            },
                            {
                                "t3name": "龙井市"
                            },
                            {
                                "t3name": "安图县"
                            },
                            {
                                "t3name": "汪清县"
                            }
                        ]
                    },
                    {
                        "t2name": "辽源市",
                        "t3": [
                            {
                                "t3name": "龙山区"
                            },
                            {
                                "t3name": "东辽县"
                            },
                            {
                                "t3name": "西安区"
                            },
                            {
                                "t3name": "东丰县"
                            }
                        ]
                    }
                ]
            },
            {
                "t1name": "辽宁省",
                "t2": [
                    {
                        "t2name": "铁岭市",
                        "t3": [
                            {
                                "t3name": "银州区"
                            },
                            {
                                "t3name": "清河区"
                            },
                            {
                                "t3name": "调兵山市"
                            },
                            {
                                "t3name": "昌图县"
                            },
                            {
                                "t3name": "西丰县"
                            },
                            {
                                "t3name": "铁岭县"
                            },
                            {
                                "t3name": "开原市"
                            }
                        ]
                    },
                    {
                        "t2name": "葫芦岛市",
                        "t3": [
                            {
                                "t3name": "建昌县"
                            },
                            {
                                "t3name": "兴城市"
                            },
                            {
                                "t3name": "南票区"
                            },
                            {
                                "t3name": "绥中县"
                            },
                            {
                                "t3name": "连山区"
                            },
                            {
                                "t3name": "龙港区"
                            }
                        ]
                    },
                    {
                        "t2name": "营口市",
                        "t3": [
                            {
                                "t3name": "鲅鱼圈区"
                            },
                            {
                                "t3name": "老边区"
                            },
                            {
                                "t3name": "站前区"
                            },
                            {
                                "t3name": "西市区"
                            },
                            {
                                "t3name": "盖州市"
                            },
                            {
                                "t3name": "大石桥市"
                            }
                        ]
                    },
                    {
                        "t2name": "本溪市",
                        "t3": [
                            {
                                "t3name": "平山区"
                            },
                            {
                                "t3name": "溪湖区"
                            },
                            {
                                "t3name": "明山区"
                            },
                            {
                                "t3name": "桓仁满族自治县"
                            },
                            {
                                "t3name": "南芬区"
                            },
                            {
                                "t3name": "本溪满族自治县"
                            }
                        ]
                    },
                    {
                        "t2name": "辽阳市",
                        "t3": [
                            {
                                "t3name": "宏伟区"
                            },
                            {
                                "t3name": "文圣区"
                            },
                            {
                                "t3name": "弓长岭区"
                            },
                            {
                                "t3name": "太子河区"
                            },
                            {
                                "t3name": "白塔区"
                            },
                            {
                                "t3name": "灯塔市"
                            },
                            {
                                "t3name": "辽阳县"
                            }
                        ]
                    },
                    {
                        "t2name": "盘锦市",
                        "t3": [
                            {
                                "t3name": "双台子区"
                            },
                            {
                                "t3name": "兴隆台区"
                            },
                            {
                                "t3name": "大洼县"
                            },
                            {
                                "t3name": "盘山县"
                            }
                        ]
                    },
                    {
                        "t2name": "阜新市",
                        "t3": [
                            {
                                "t3name": "阜新蒙古族自治县"
                            },
                            {
                                "t3name": "细河区"
                            },
                            {
                                "t3name": "彰武县"
                            },
                            {
                                "t3name": "新邱区"
                            },
                            {
                                "t3name": "海州区"
                            },
                            {
                                "t3name": "清河门区"
                            },
                            {
                                "t3name": "太平区"
                            }
                        ]
                    },
                    {
                        "t2name": "朝阳市",
                        "t3": [
                            {
                                "t3name": "喀喇沁左翼蒙古族自治县"
                            },
                            {
                                "t3name": "建平县"
                            },
                            {
                                "t3name": "北票市"
                            },
                            {
                                "t3name": "凌源市"
                            },
                            {
                                "t3name": "朝阳县"
                            },
                            {
                                "t3name": "龙城区"
                            },
                            {
                                "t3name": "双塔区"
                            }
                        ]
                    },
                    {
                        "t2name": "锦州市",
                        "t3": [
                            {
                                "t3name": "凌海市"
                            },
                            {
                                "t3name": "古塔区"
                            },
                            {
                                "t3name": "北镇市"
                            },
                            {
                                "t3name": "黑山县"
                            },
                            {
                                "t3name": "义县"
                            },
                            {
                                "t3name": "太和区"
                            },
                            {
                                "t3name": "凌河区"
                            }
                        ]
                    },
                    {
                        "t2name": "抚顺市",
                        "t3": [
                            {
                                "t3name": "清原满族自治县"
                            },
                            {
                                "t3name": "东洲区"
                            },
                            {
                                "t3name": "新抚区"
                            },
                            {
                                "t3name": "望花区"
                            },
                            {
                                "t3name": "顺城区"
                            },
                            {
                                "t3name": "抚顺县"
                            },
                            {
                                "t3name": "新宾满族自治县"
                            }
                        ]
                    },
                    {
                        "t2name": "丹东市",
                        "t3": [
                            {
                                "t3name": "凤城市"
                            },
                            {
                                "t3name": "东港市"
                            },
                            {
                                "t3name": "宽甸满族自治县"
                            },
                            {
                                "t3name": "振安区"
                            },
                            {
                                "t3name": "振兴区"
                            },
                            {
                                "t3name": "元宝区"
                            }
                        ]
                    },
                    {
                        "t2name": "沈阳市",
                        "t3": [
                            {
                                "t3name": "新民市"
                            },
                            {
                                "t3name": "康平县"
                            },
                            {
                                "t3name": "法库县"
                            },
                            {
                                "t3name": "沈河区"
                            },
                            {
                                "t3name": "和平区"
                            },
                            {
                                "t3name": "东陵区"
                            },
                            {
                                "t3name": "新城子区"
                            },
                            {
                                "t3name": "于洪区"
                            },
                            {
                                "t3name": "辽中县"
                            },
                            {
                                "t3name": "大东区"
                            },
                            {
                                "t3name": "皇姑区"
                            },
                            {
                                "t3name": "铁西区"
                            },
                            {
                                "t3name": "苏家屯区"
                            }
                        ]
                    },
                    {
                        "t2name": "鞍山市",
                        "t3": [
                            {
                                "t3name": "铁东区"
                            },
                            {
                                "t3name": "立山区"
                            },
                            {
                                "t3name": "铁西区"
                            },
                            {
                                "t3name": "台安县"
                            },
                            {
                                "t3name": "千山区"
                            },
                            {
                                "t3name": "海城市"
                            },
                            {
                                "t3name": "岫岩满族自治县"
                            }
                        ]
                    },
                    {
                        "t2name": "大连市",
                        "t3": [
                            {
                                "t3name": "庄河市"
                            },
                            {
                                "t3name": "瓦房店市"
                            },
                            {
                                "t3name": "普兰店市"
                            },
                            {
                                "t3name": "金州区"
                            },
                            {
                                "t3name": "长海县"
                            },
                            {
                                "t3name": "甘井子区"
                            },
                            {
                                "t3name": "旅顺口区"
                            },
                            {
                                "t3name": "西岗区"
                            },
                            {
                                "t3name": "沙河口区"
                            },
                            {
                                "t3name": "中山区"
                            }
                        ]
                    }
                ]
            },
            {
                "t1name": "海南省",
                "t2": [
                    {
                        "t2name": "保亭县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "澄迈县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "南沙群岛",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "陵水黎族",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "中沙群岛",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "屯昌县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "昌江黎族",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "乐东黎族",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "琼海市",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "儋州市",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "文昌市",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "万宁市",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "白沙黎族",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "海口市",
                        "t3": [
                            {
                                "t3name": "琼山区"
                            },
                            {
                                "t3name": "龙华区"
                            },
                            {
                                "t3name": "秀英区"
                            },
                            {
                                "t3name": "美兰区"
                            }
                        ]
                    },
                    {
                        "t2name": "三亚市",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "五指山市",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "琼中县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "东方市",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "定安县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "西沙群岛",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "临高县",
                        "t3": [

                        ]
                    }
                ]
            },
            {
                "t1name": "湖南省",
                "t2": [
                    {
                        "t2name": "郴州市",
                        "t3": [
                            {
                                "t3name": "北湖区"
                            },
                            {
                                "t3name": "安仁县"
                            },
                            {
                                "t3name": "资兴市"
                            },
                            {
                                "t3name": "嘉禾县"
                            },
                            {
                                "t3name": "临武县"
                            },
                            {
                                "t3name": "汝城县"
                            },
                            {
                                "t3name": "桂东县"
                            },
                            {
                                "t3name": "苏仙区"
                            },
                            {
                                "t3name": "桂阳县"
                            },
                            {
                                "t3name": "宜章县"
                            },
                            {
                                "t3name": "永兴县"
                            }
                        ]
                    },
                    {
                        "t2name": "岳阳市",
                        "t3": [
                            {
                                "t3name": "君山区"
                            },
                            {
                                "t3name": "云溪区"
                            },
                            {
                                "t3name": "岳阳楼区"
                            },
                            {
                                "t3name": "平江县"
                            },
                            {
                                "t3name": "湘阴县"
                            },
                            {
                                "t3name": "华容县"
                            },
                            {
                                "t3name": "岳阳县"
                            },
                            {
                                "t3name": "临湘市"
                            },
                            {
                                "t3name": "汨罗市"
                            }
                        ]
                    },
                    {
                        "t2name": "怀化市",
                        "t3": [
                            {
                                "t3name": "通道侗族自治县"
                            },
                            {
                                "t3name": "靖州苗族侗族自治县"
                            },
                            {
                                "t3name": "洪江市"
                            },
                            {
                                "t3name": "新晃侗族自治县"
                            },
                            {
                                "t3name": "芷江侗族自治县"
                            },
                            {
                                "t3name": "中方县"
                            },
                            {
                                "t3name": "沅陵县"
                            },
                            {
                                "t3name": "鹤城区"
                            },
                            {
                                "t3name": "会同县"
                            },
                            {
                                "t3name": "麻阳苗族自治县"
                            },
                            {
                                "t3name": "辰溪县"
                            },
                            {
                                "t3name": "溆浦县"
                            }
                        ]
                    },
                    {
                        "t2name": "娄底市",
                        "t3": [
                            {
                                "t3name": "新化县"
                            },
                            {
                                "t3name": "双峰县"
                            },
                            {
                                "t3name": "涟源市"
                            },
                            {
                                "t3name": "冷水江市"
                            },
                            {
                                "t3name": "娄星区"
                            }
                        ]
                    },
                    {
                        "t2name": "张家界市",
                        "t3": [
                            {
                                "t3name": "慈利县"
                            },
                            {
                                "t3name": "武陵源区"
                            },
                            {
                                "t3name": "桑植县"
                            },
                            {
                                "t3name": "永定区"
                            }
                        ]
                    },
                    {
                        "t2name": "益阳市",
                        "t3": [
                            {
                                "t3name": "沅江市"
                            },
                            {
                                "t3name": "资阳区"
                            },
                            {
                                "t3name": "南县"
                            },
                            {
                                "t3name": "赫山区"
                            },
                            {
                                "t3name": "安化县"
                            },
                            {
                                "t3name": "桃江县"
                            }
                        ]
                    },
                    {
                        "t2name": "湘西土家",
                        "t3": [
                            {
                                "t3name": "凤凰县"
                            },
                            {
                                "t3name": "花垣县"
                            },
                            {
                                "t3name": "保靖县"
                            },
                            {
                                "t3name": "古丈县"
                            },
                            {
                                "t3name": "泸溪县"
                            },
                            {
                                "t3name": "吉首市"
                            },
                            {
                                "t3name": "龙山县"
                            },
                            {
                                "t3name": "永顺县"
                            }
                        ]
                    },
                    {
                        "t2name": "常德市",
                        "t3": [
                            {
                                "t3name": "津市市"
                            },
                            {
                                "t3name": "桃源县"
                            },
                            {
                                "t3name": "石门县"
                            },
                            {
                                "t3name": "澧县"
                            },
                            {
                                "t3name": "临澧县"
                            },
                            {
                                "t3name": "安乡县"
                            },
                            {
                                "t3name": "汉寿县"
                            },
                            {
                                "t3name": "武陵区"
                            },
                            {
                                "t3name": "鼎城区"
                            }
                        ]
                    },
                    {
                        "t2name": "湘潭市",
                        "t3": [
                            {
                                "t3name": "岳塘区"
                            },
                            {
                                "t3name": "雨湖区"
                            },
                            {
                                "t3name": "湘乡市"
                            },
                            {
                                "t3name": "湘潭县"
                            },
                            {
                                "t3name": "韶山市"
                            }
                        ]
                    },
                    {
                        "t2name": "永州市",
                        "t3": [
                            {
                                "t3name": "江华瑶族自治县"
                            },
                            {
                                "t3name": "新田县"
                            },
                            {
                                "t3name": "蓝山县"
                            },
                            {
                                "t3name": "宁远县"
                            },
                            {
                                "t3name": "江永县"
                            },
                            {
                                "t3name": "道县"
                            },
                            {
                                "t3name": "双牌县"
                            },
                            {
                                "t3name": "东安县"
                            },
                            {
                                "t3name": "祁阳县"
                            },
                            {
                                "t3name": "冷水滩区"
                            },
                            {
                                "t3name": "零陵区"
                            }
                        ]
                    },
                    {
                        "t2name": "衡阳市",
                        "t3": [
                            {
                                "t3name": "珠晖区"
                            },
                            {
                                "t3name": "祁东县"
                            },
                            {
                                "t3name": "耒阳市"
                            },
                            {
                                "t3name": "衡山县"
                            },
                            {
                                "t3name": "衡东县"
                            },
                            {
                                "t3name": "衡阳县"
                            },
                            {
                                "t3name": "衡南县"
                            },
                            {
                                "t3name": "蒸湘区"
                            },
                            {
                                "t3name": "南岳区"
                            },
                            {
                                "t3name": "石鼓区"
                            },
                            {
                                "t3name": "雁峰区"
                            },
                            {
                                "t3name": "常宁市"
                            }
                        ]
                    },
                    {
                        "t2name": "株洲市",
                        "t3": [
                            {
                                "t3name": "醴陵市"
                            },
                            {
                                "t3name": "炎陵县"
                            },
                            {
                                "t3name": "攸县"
                            },
                            {
                                "t3name": "茶陵县"
                            },
                            {
                                "t3name": "芦淞区"
                            },
                            {
                                "t3name": "石峰区"
                            },
                            {
                                "t3name": "天元区"
                            },
                            {
                                "t3name": "株洲县"
                            },
                            {
                                "t3name": "荷塘区"
                            }
                        ]
                    },
                    {
                        "t2name": "长沙市",
                        "t3": [
                            {
                                "t3name": "长沙县"
                            },
                            {
                                "t3name": "雨花区"
                            },
                            {
                                "t3name": "开福区"
                            },
                            {
                                "t3name": "岳麓区"
                            },
                            {
                                "t3name": "天心区"
                            },
                            {
                                "t3name": "芙蓉区"
                            },
                            {
                                "t3name": "望城县"
                            },
                            {
                                "t3name": "宁乡县"
                            },
                            {
                                "t3name": "浏阳市"
                            }
                        ]
                    },
                    {
                        "t2name": "邵阳市",
                        "t3": [
                            {
                                "t3name": "大祥区"
                            },
                            {
                                "t3name": "北塔区"
                            },
                            {
                                "t3name": "邵东县"
                            },
                            {
                                "t3name": "新邵县"
                            },
                            {
                                "t3name": "邵阳县"
                            },
                            {
                                "t3name": "隆回县"
                            },
                            {
                                "t3name": "洞口县"
                            },
                            {
                                "t3name": "绥宁县"
                            },
                            {
                                "t3name": "新宁县"
                            },
                            {
                                "t3name": "城步苗族自治县"
                            },
                            {
                                "t3name": "武冈市"
                            },
                            {
                                "t3name": "双清区"
                            }
                        ]
                    }
                ]
            },
            {
                "t1name": "河南省",
                "t2": [
                    {
                        "t2name": "南阳市",
                        "t3": [
                            {
                                "t3name": "桐柏县"
                            },
                            {
                                "t3name": "新野县"
                            },
                            {
                                "t3name": "唐河县"
                            },
                            {
                                "t3name": "社旗县"
                            },
                            {
                                "t3name": "邓州市"
                            },
                            {
                                "t3name": "镇平县"
                            },
                            {
                                "t3name": "西峡县"
                            },
                            {
                                "t3name": "淅川县"
                            },
                            {
                                "t3name": "内乡县"
                            },
                            {
                                "t3name": "卧龙区"
                            },
                            {
                                "t3name": "宛城区"
                            },
                            {
                                "t3name": "方城县"
                            },
                            {
                                "t3name": "南召县"
                            }
                        ]
                    },
                    {
                        "t2name": "洛阳市",
                        "t3": [
                            {
                                "t3name": "宜阳县"
                            },
                            {
                                "t3name": "洛宁县"
                            },
                            {
                                "t3name": "嵩县"
                            },
                            {
                                "t3name": "汝阳县"
                            },
                            {
                                "t3name": "老城区"
                            },
                            {
                                "t3name": "廛河回族区"
                            },
                            {
                                "t3name": "洛龙区"
                            },
                            {
                                "t3name": "西工区"
                            },
                            {
                                "t3name": "吉利区"
                            },
                            {
                                "t3name": "涧西区"
                            },
                            {
                                "t3name": "孟津县"
                            },
                            {
                                "t3name": "伊川县"
                            },
                            {
                                "t3name": "偃师市"
                            },
                            {
                                "t3name": "新安县"
                            },
                            {
                                "t3name": "栾川县"
                            }
                        ]
                    },
                    {
                        "t2name": "三门峡市",
                        "t3": [
                            {
                                "t3name": "陕县"
                            },
                            {
                                "t3name": "卢氏县"
                            },
                            {
                                "t3name": "湖滨区"
                            },
                            {
                                "t3name": "渑池县"
                            },
                            {
                                "t3name": "义马市"
                            },
                            {
                                "t3name": "灵宝市"
                            }
                        ]
                    },
                    {
                        "t2name": "商丘市",
                        "t3": [
                            {
                                "t3name": "夏邑县"
                            },
                            {
                                "t3name": "睢阳区"
                            },
                            {
                                "t3name": "民权县"
                            },
                            {
                                "t3name": "睢县"
                            },
                            {
                                "t3name": "宁陵县"
                            },
                            {
                                "t3name": "永城市"
                            },
                            {
                                "t3name": "梁园区"
                            },
                            {
                                "t3name": "柘城县"
                            },
                            {
                                "t3name": "虞城县"
                            }
                        ]
                    },
                    {
                        "t2name": "焦作市",
                        "t3": [
                            {
                                "t3name": "温县"
                            },
                            {
                                "t3name": "武陟县"
                            },
                            {
                                "t3name": "博爱县"
                            },
                            {
                                "t3name": "修武县"
                            },
                            {
                                "t3name": "解放区"
                            },
                            {
                                "t3name": "中站区"
                            },
                            {
                                "t3name": "沁阳市"
                            },
                            {
                                "t3name": "济源市"
                            },
                            {
                                "t3name": "马村区"
                            },
                            {
                                "t3name": "山阳区"
                            },
                            {
                                "t3name": "孟州市"
                            }
                        ]
                    },
                    {
                        "t2name": "开封市",
                        "t3": [
                            {
                                "t3name": "通许县"
                            },
                            {
                                "t3name": "杞县"
                            },
                            {
                                "t3name": "开封县"
                            },
                            {
                                "t3name": "尉氏县"
                            },
                            {
                                "t3name": "兰考县"
                            },
                            {
                                "t3name": "禹王台区"
                            },
                            {
                                "t3name": "金明区"
                            },
                            {
                                "t3name": "龙亭区"
                            },
                            {
                                "t3name": "顺河回族区"
                            },
                            {
                                "t3name": "鼓楼区"
                            }
                        ]
                    },
                    {
                        "t2name": "驻马店市",
                        "t3": [
                            {
                                "t3name": "西平县"
                            },
                            {
                                "t3name": "驿城区"
                            },
                            {
                                "t3name": "平舆县"
                            },
                            {
                                "t3name": "上蔡县"
                            },
                            {
                                "t3name": "确山县"
                            },
                            {
                                "t3name": "正阳县"
                            },
                            {
                                "t3name": "汝南县"
                            },
                            {
                                "t3name": "泌阳县"
                            },
                            {
                                "t3name": "遂平县"
                            },
                            {
                                "t3name": "新蔡县"
                            }
                        ]
                    },
                    {
                        "t2name": "濮阳市",
                        "t3": [
                            {
                                "t3name": "范县"
                            },
                            {
                                "t3name": "台前县"
                            },
                            {
                                "t3name": "濮阳县"
                            },
                            {
                                "t3name": "华龙区"
                            },
                            {
                                "t3name": "南乐县"
                            },
                            {
                                "t3name": "清丰县"
                            }
                        ]
                    },
                    {
                        "t2name": "许昌市",
                        "t3": [
                            {
                                "t3name": "魏都区"
                            },
                            {
                                "t3name": "许昌县"
                            },
                            {
                                "t3name": "鄢陵县"
                            },
                            {
                                "t3name": "襄城县"
                            },
                            {
                                "t3name": "禹州市"
                            },
                            {
                                "t3name": "长葛市"
                            }
                        ]
                    },
                    {
                        "t2name": "安阳市",
                        "t3": [
                            {
                                "t3name": "安阳县"
                            },
                            {
                                "t3name": "汤阴县"
                            },
                            {
                                "t3name": "滑县"
                            },
                            {
                                "t3name": "内黄县"
                            },
                            {
                                "t3name": "文峰区"
                            },
                            {
                                "t3name": "北关区"
                            },
                            {
                                "t3name": "殷都区"
                            },
                            {
                                "t3name": "龙安区"
                            },
                            {
                                "t3name": "林州市"
                            }
                        ]
                    },
                    {
                        "t2name": "信阳市",
                        "t3": [
                            {
                                "t3name": "淮滨县"
                            },
                            {
                                "t3name": "息县"
                            },
                            {
                                "t3name": "商城县"
                            },
                            {
                                "t3name": "新县"
                            },
                            {
                                "t3name": "光山县"
                            },
                            {
                                "t3name": "罗山县"
                            },
                            {
                                "t3name": "平桥区"
                            },
                            {
                                "t3name": "浉河区"
                            },
                            {
                                "t3name": "潢川县"
                            },
                            {
                                "t3name": "固始县"
                            }
                        ]
                    },
                    {
                        "t2name": "漯河市",
                        "t3": [
                            {
                                "t3name": "舞阳县"
                            },
                            {
                                "t3name": "源汇区"
                            },
                            {
                                "t3name": "郾城区"
                            },
                            {
                                "t3name": "召陵区"
                            },
                            {
                                "t3name": "临颍县"
                            }
                        ]
                    },
                    {
                        "t2name": "平顶山市",
                        "t3": [
                            {
                                "t3name": "郏县"
                            },
                            {
                                "t3name": "鲁山县"
                            },
                            {
                                "t3name": "叶县"
                            },
                            {
                                "t3name": "宝丰县"
                            },
                            {
                                "t3name": "湛河区"
                            },
                            {
                                "t3name": "石龙区"
                            },
                            {
                                "t3name": "卫东区"
                            },
                            {
                                "t3name": "新华区"
                            },
                            {
                                "t3name": "汝州市"
                            },
                            {
                                "t3name": "舞钢市"
                            }
                        ]
                    },
                    {
                        "t2name": "郑州市",
                        "t3": [
                            {
                                "t3name": "登封市"
                            },
                            {
                                "t3name": "巩义市"
                            },
                            {
                                "t3name": "中牟县"
                            },
                            {
                                "t3name": "惠济区"
                            },
                            {
                                "t3name": "中原区"
                            },
                            {
                                "t3name": "荥阳市"
                            },
                            {
                                "t3name": "新密市"
                            },
                            {
                                "t3name": "新郑市"
                            },
                            {
                                "t3name": "上街区"
                            },
                            {
                                "t3name": "金水区"
                            },
                            {
                                "t3name": "管城回族区"
                            },
                            {
                                "t3name": "二七区"
                            }
                        ]
                    },
                    {
                        "t2name": "新乡市",
                        "t3": [
                            {
                                "t3name": "封丘县"
                            },
                            {
                                "t3name": "长垣县"
                            },
                            {
                                "t3name": "原阳县"
                            },
                            {
                                "t3name": "延津县"
                            },
                            {
                                "t3name": "获嘉县"
                            },
                            {
                                "t3name": "新乡县"
                            },
                            {
                                "t3name": "卫辉市"
                            },
                            {
                                "t3name": "辉县市"
                            },
                            {
                                "t3name": "卫滨区"
                            },
                            {
                                "t3name": "红旗区"
                            },
                            {
                                "t3name": "牧野区"
                            },
                            {
                                "t3name": "凤泉区"
                            }
                        ]
                    },
                    {
                        "t2name": "鹤壁市",
                        "t3": [
                            {
                                "t3name": "浚县"
                            },
                            {
                                "t3name": "淇滨区"
                            },
                            {
                                "t3name": "鹤山区"
                            },
                            {
                                "t3name": "淇县"
                            },
                            {
                                "t3name": "山城区"
                            }
                        ]
                    },
                    {
                        "t2name": "周口市",
                        "t3": [
                            {
                                "t3name": "沈丘县"
                            },
                            {
                                "t3name": "郸城县"
                            },
                            {
                                "t3name": "西华县"
                            },
                            {
                                "t3name": "商水县"
                            },
                            {
                                "t3name": "川汇区"
                            },
                            {
                                "t3name": "扶沟县"
                            },
                            {
                                "t3name": "鹿邑县"
                            },
                            {
                                "t3name": "淮阳县"
                            },
                            {
                                "t3name": "太康县"
                            },
                            {
                                "t3name": "项城市"
                            }
                        ]
                    }
                ]
            },
            {
                "t1name": "贵州省",
                "t2": [
                    {
                        "t2name": "毕节地市",
                        "t3": [
                            {
                                "t3name": "毕节市"
                            },
                            {
                                "t3name": "黔西县"
                            },
                            {
                                "t3name": "大方县"
                            },
                            {
                                "t3name": "纳雍县"
                            },
                            {
                                "t3name": "威宁"
                            },
                            {
                                "t3name": "赫章县"
                            },
                            {
                                "t3name": "织金县"
                            },
                            {
                                "t3name": "金沙县"
                            }
                        ]
                    },
                    {
                        "t2name": "黔南布依",
                        "t3": [
                            {
                                "t3name": "惠水县"
                            },
                            {
                                "t3name": "龙里县"
                            },
                            {
                                "t3name": "都匀市"
                            },
                            {
                                "t3name": "荔波县"
                            },
                            {
                                "t3name": "福泉市"
                            },
                            {
                                "t3name": "瓮安县"
                            },
                            {
                                "t3name": "贵定县"
                            },
                            {
                                "t3name": "平塘县"
                            },
                            {
                                "t3name": "独山县"
                            },
                            {
                                "t3name": "长顺县"
                            },
                            {
                                "t3name": "罗甸县"
                            },
                            {
                                "t3name": "三都"
                            }
                        ]
                    },
                    {
                        "t2name": "六盘水市",
                        "t3": [
                            {
                                "t3name": "钟山区"
                            },
                            {
                                "t3name": "水城县"
                            },
                            {
                                "t3name": "六枝特区"
                            },
                            {
                                "t3name": "盘县"
                            }
                        ]
                    },
                    {
                        "t2name": "黔东南苗",
                        "t3": [
                            {
                                "t3name": "岑巩县"
                            },
                            {
                                "t3name": "天柱县"
                            },
                            {
                                "t3name": "锦屏县"
                            },
                            {
                                "t3name": "黎平县"
                            },
                            {
                                "t3name": "台江县"
                            },
                            {
                                "t3name": "剑河县"
                            },
                            {
                                "t3name": "凯里市"
                            },
                            {
                                "t3name": "黄平县"
                            },
                            {
                                "t3name": "施秉县"
                            },
                            {
                                "t3name": "三穗县"
                            },
                            {
                                "t3name": "镇远县"
                            },
                            {
                                "t3name": "丹寨县"
                            },
                            {
                                "t3name": "雷山县"
                            },
                            {
                                "t3name": "从江县"
                            },
                            {
                                "t3name": "麻江县"
                            },
                            {
                                "t3name": "榕江县"
                            }
                        ]
                    },
                    {
                        "t2name": "贵阳市",
                        "t3": [
                            {
                                "t3name": "清镇市"
                            },
                            {
                                "t3name": "小河区"
                            },
                            {
                                "t3name": "开阳县"
                            },
                            {
                                "t3name": "乌当区"
                            },
                            {
                                "t3name": "白云区"
                            },
                            {
                                "t3name": "云岩区"
                            },
                            {
                                "t3name": "花溪区"
                            },
                            {
                                "t3name": "南明区"
                            },
                            {
                                "t3name": "修文县"
                            },
                            {
                                "t3name": "息烽县"
                            }
                        ]
                    },
                    {
                        "t2name": "遵义市",
                        "t3": [
                            {
                                "t3name": "遵义县"
                            },
                            {
                                "t3name": "汇川区"
                            },
                            {
                                "t3name": "红花岗区"
                            },
                            {
                                "t3name": "仁怀市"
                            },
                            {
                                "t3name": "习水县"
                            },
                            {
                                "t3name": "赤水市"
                            },
                            {
                                "t3name": "务川县"
                            },
                            {
                                "t3name": "凤冈县"
                            },
                            {
                                "t3name": "湄潭县"
                            },
                            {
                                "t3name": "余庆县"
                            },
                            {
                                "t3name": "桐梓县"
                            },
                            {
                                "t3name": "绥阳县"
                            },
                            {
                                "t3name": "正安县"
                            },
                            {
                                "t3name": "道真县"
                            }
                        ]
                    },
                    {
                        "t2name": "铜仁地市",
                        "t3": [
                            {
                                "t3name": "印江"
                            },
                            {
                                "t3name": "玉屏"
                            },
                            {
                                "t3name": "江口县"
                            },
                            {
                                "t3name": "铜仁市"
                            },
                            {
                                "t3name": "德江县"
                            },
                            {
                                "t3name": "石阡县"
                            },
                            {
                                "t3name": "思南县"
                            },
                            {
                                "t3name": "万山特区"
                            },
                            {
                                "t3name": "沿河"
                            },
                            {
                                "t3name": "松桃"
                            }
                        ]
                    },
                    {
                        "t2name": "黔西南布",
                        "t3": [
                            {
                                "t3name": "安龙县"
                            },
                            {
                                "t3name": "贞丰县"
                            },
                            {
                                "t3name": "晴隆县"
                            },
                            {
                                "t3name": "册亨县"
                            },
                            {
                                "t3name": "望谟县"
                            },
                            {
                                "t3name": "兴仁县"
                            },
                            {
                                "t3name": "普安县"
                            },
                            {
                                "t3name": "兴义市"
                            }
                        ]
                    },
                    {
                        "t2name": "安顺市",
                        "t3": [
                            {
                                "t3name": "紫云"
                            },
                            {
                                "t3name": "关岭"
                            },
                            {
                                "t3name": "镇宁"
                            },
                            {
                                "t3name": "普定县"
                            },
                            {
                                "t3name": "平坝县"
                            },
                            {
                                "t3name": "西秀区"
                            }
                        ]
                    }
                ]
            },
            {
                "t1name": "江西省",
                "t2": [
                    {
                        "t2name": "南昌市",
                        "t3": [
                            {
                                "t3name": "东湖区"
                            },
                            {
                                "t3name": "西湖区"
                            },
                            {
                                "t3name": "青云谱区"
                            },
                            {
                                "t3name": "湾里区"
                            },
                            {
                                "t3name": "进贤县"
                            },
                            {
                                "t3name": "安义县"
                            },
                            {
                                "t3name": "新建县"
                            },
                            {
                                "t3name": "青山湖区"
                            },
                            {
                                "t3name": "南昌县"
                            }
                        ]
                    },
                    {
                        "t2name": "萍乡市",
                        "t3": [
                            {
                                "t3name": "安源区"
                            },
                            {
                                "t3name": "芦溪县"
                            },
                            {
                                "t3name": "上栗县"
                            },
                            {
                                "t3name": "莲花县"
                            },
                            {
                                "t3name": "湘东区"
                            }
                        ]
                    },
                    {
                        "t2name": "景德镇市",
                        "t3": [
                            {
                                "t3name": "乐平市"
                            },
                            {
                                "t3name": "浮梁县"
                            },
                            {
                                "t3name": "珠山区"
                            },
                            {
                                "t3name": "昌江区"
                            }
                        ]
                    },
                    {
                        "t2name": "吉安市",
                        "t3": [
                            {
                                "t3name": "安福县"
                            },
                            {
                                "t3name": "万安县"
                            },
                            {
                                "t3name": "遂川县"
                            },
                            {
                                "t3name": "泰和县"
                            },
                            {
                                "t3name": "永丰县"
                            },
                            {
                                "t3name": "新干县"
                            },
                            {
                                "t3name": "峡江县"
                            },
                            {
                                "t3name": "吉水县"
                            },
                            {
                                "t3name": "青原区"
                            },
                            {
                                "t3name": "吉安县"
                            },
                            {
                                "t3name": "井冈山市"
                            },
                            {
                                "t3name": "永新县"
                            },
                            {
                                "t3name": "吉州区"
                            }
                        ]
                    },
                    {
                        "t2name": "九江市",
                        "t3": [
                            {
                                "t3name": "彭泽县"
                            },
                            {
                                "t3name": "德安县"
                            },
                            {
                                "t3name": "星子县"
                            },
                            {
                                "t3name": "修水县"
                            },
                            {
                                "t3name": "永修县"
                            },
                            {
                                "t3name": "九江县"
                            },
                            {
                                "t3name": "武宁县"
                            },
                            {
                                "t3name": "庐山区"
                            },
                            {
                                "t3name": "浔阳区"
                            },
                            {
                                "t3name": "湖口县"
                            },
                            {
                                "t3name": "都昌县"
                            },
                            {
                                "t3name": "瑞昌市"
                            }
                        ]
                    },
                    {
                        "t2name": "新余市",
                        "t3": [
                            {
                                "t3name": "分宜县"
                            },
                            {
                                "t3name": "渝水区"
                            }
                        ]
                    },
                    {
                        "t2name": "鹰潭市",
                        "t3": [
                            {
                                "t3name": "贵溪市"
                            },
                            {
                                "t3name": "余江县"
                            },
                            {
                                "t3name": "月湖区"
                            }
                        ]
                    },
                    {
                        "t2name": "抚州市",
                        "t3": [
                            {
                                "t3name": "广昌县"
                            },
                            {
                                "t3name": "南城县"
                            },
                            {
                                "t3name": "临川区"
                            },
                            {
                                "t3name": "南丰县"
                            },
                            {
                                "t3name": "黎川县"
                            },
                            {
                                "t3name": "乐安县"
                            },
                            {
                                "t3name": "崇仁县"
                            },
                            {
                                "t3name": "金溪县"
                            },
                            {
                                "t3name": "宜黄县"
                            },
                            {
                                "t3name": "东乡县"
                            },
                            {
                                "t3name": "资溪县"
                            }
                        ]
                    },
                    {
                        "t2name": "赣州市",
                        "t3": [
                            {
                                "t3name": "章贡区"
                            },
                            {
                                "t3name": "会昌县"
                            },
                            {
                                "t3name": "于都县"
                            },
                            {
                                "t3name": "兴国县"
                            },
                            {
                                "t3name": "宁都县"
                            },
                            {
                                "t3name": "全南县"
                            },
                            {
                                "t3name": "石城县"
                            },
                            {
                                "t3name": "寻乌县"
                            },
                            {
                                "t3name": "安远县"
                            },
                            {
                                "t3name": "崇义县"
                            },
                            {
                                "t3name": "定南县"
                            },
                            {
                                "t3name": "龙南县"
                            },
                            {
                                "t3name": "信丰县"
                            },
                            {
                                "t3name": "赣县"
                            },
                            {
                                "t3name": "上犹县"
                            },
                            {
                                "t3name": "大余县"
                            },
                            {
                                "t3name": "南康市"
                            },
                            {
                                "t3name": "瑞金市"
                            }
                        ]
                    },
                    {
                        "t2name": "上饶市",
                        "t3": [
                            {
                                "t3name": "德兴市"
                            },
                            {
                                "t3name": "婺源县"
                            },
                            {
                                "t3name": "万年县"
                            },
                            {
                                "t3name": "横峰县"
                            },
                            {
                                "t3name": "弋阳县"
                            },
                            {
                                "t3name": "玉山县"
                            },
                            {
                                "t3name": "铅山县"
                            },
                            {
                                "t3name": "上饶县"
                            },
                            {
                                "t3name": "广丰县"
                            },
                            {
                                "t3name": "信州区"
                            },
                            {
                                "t3name": "余干县"
                            },
                            {
                                "t3name": "鄱阳县"
                            }
                        ]
                    },
                    {
                        "t2name": "宜春市",
                        "t3": [
                            {
                                "t3name": "宜丰县"
                            },
                            {
                                "t3name": "靖安县"
                            },
                            {
                                "t3name": "铜鼓县"
                            },
                            {
                                "t3name": "丰城市"
                            },
                            {
                                "t3name": "袁州区"
                            },
                            {
                                "t3name": "奉新县"
                            },
                            {
                                "t3name": "万载县"
                            },
                            {
                                "t3name": "上高县"
                            },
                            {
                                "t3name": "樟树市"
                            },
                            {
                                "t3name": "高安市"
                            }
                        ]
                    }
                ]
            },
            {
                "t1name": "广西壮族",
                "t2": [
                    {
                        "t2name": "贺州市",
                        "t3": [
                            {
                                "t3name": "昭平县"
                            },
                            {
                                "t3name": "八步区"
                            },
                            {
                                "t3name": "富川瑶族自治县"
                            },
                            {
                                "t3name": "钟山县"
                            }
                        ]
                    },
                    {
                        "t2name": "梧州市",
                        "t3": [
                            {
                                "t3name": "万秀区"
                            },
                            {
                                "t3name": "蝶山区"
                            },
                            {
                                "t3name": "岑溪市"
                            },
                            {
                                "t3name": "苍梧县"
                            },
                            {
                                "t3name": "长洲区"
                            },
                            {
                                "t3name": "蒙山县"
                            },
                            {
                                "t3name": "藤县"
                            }
                        ]
                    },
                    {
                        "t2name": "河池市",
                        "t3": [
                            {
                                "t3name": "南丹县"
                            },
                            {
                                "t3name": "金城江区"
                            },
                            {
                                "t3name": "凤山县"
                            },
                            {
                                "t3name": "天峨县"
                            },
                            {
                                "t3name": "罗城仫佬族自治县"
                            },
                            {
                                "t3name": "东兰县"
                            },
                            {
                                "t3name": "都安瑶族自治县"
                            },
                            {
                                "t3name": "大化瑶族自治县"
                            },
                            {
                                "t3name": "环江毛南族自治县"
                            },
                            {
                                "t3name": "巴马瑶族自治县"
                            },
                            {
                                "t3name": "宜州市"
                            }
                        ]
                    },
                    {
                        "t2name": "百色市",
                        "t3": [
                            {
                                "t3name": "乐业县"
                            },
                            {
                                "t3name": "田林县"
                            },
                            {
                                "t3name": "那坡县"
                            },
                            {
                                "t3name": "凌云县"
                            },
                            {
                                "t3name": "德保县"
                            },
                            {
                                "t3name": "靖西县"
                            },
                            {
                                "t3name": "田东县"
                            },
                            {
                                "t3name": "平果县"
                            },
                            {
                                "t3name": "田阳县"
                            },
                            {
                                "t3name": "右江区"
                            },
                            {
                                "t3name": "西林县"
                            },
                            {
                                "t3name": "隆林各族自治县"
                            }
                        ]
                    },
                    {
                        "t2name": "来宾市",
                        "t3": [
                            {
                                "t3name": "忻城县"
                            },
                            {
                                "t3name": "象州县"
                            },
                            {
                                "t3name": "兴宾区"
                            },
                            {
                                "t3name": "武宣县"
                            },
                            {
                                "t3name": "金秀瑶族自治县"
                            },
                            {
                                "t3name": "合山市"
                            }
                        ]
                    },
                    {
                        "t2name": "贵港市",
                        "t3": [
                            {
                                "t3name": "港北区"
                            },
                            {
                                "t3name": "港南区"
                            },
                            {
                                "t3name": "覃塘区"
                            },
                            {
                                "t3name": "桂平市"
                            },
                            {
                                "t3name": "平南县"
                            }
                        ]
                    },
                    {
                        "t2name": "玉林市",
                        "t3": [
                            {
                                "t3name": "北流市"
                            },
                            {
                                "t3name": "兴业县"
                            },
                            {
                                "t3name": "博白县"
                            },
                            {
                                "t3name": "陆川县"
                            },
                            {
                                "t3name": "容县"
                            },
                            {
                                "t3name": "玉州区"
                            }
                        ]
                    },
                    {
                        "t2name": "钦州市",
                        "t3": [
                            {
                                "t3name": "钦北区"
                            },
                            {
                                "t3name": "灵山县"
                            },
                            {
                                "t3name": "浦北县"
                            },
                            {
                                "t3name": "钦南区"
                            }
                        ]
                    },
                    {
                        "t2name": "北海市",
                        "t3": [
                            {
                                "t3name": "海城区"
                            },
                            {
                                "t3name": "铁山港区"
                            },
                            {
                                "t3name": "银海区"
                            },
                            {
                                "t3name": "合浦县"
                            }
                        ]
                    },
                    {
                        "t2name": "柳州市",
                        "t3": [
                            {
                                "t3name": "城中区"
                            },
                            {
                                "t3name": "鱼峰区"
                            },
                            {
                                "t3name": "柳南区"
                            },
                            {
                                "t3name": "柳北区"
                            },
                            {
                                "t3name": "柳江县"
                            },
                            {
                                "t3name": "柳城县"
                            },
                            {
                                "t3name": "鹿寨县"
                            },
                            {
                                "t3name": "融安县"
                            },
                            {
                                "t3name": "融水苗族自治县"
                            },
                            {
                                "t3name": "三江侗族自治县"
                            }
                        ]
                    },
                    {
                        "t2name": "桂林市",
                        "t3": [
                            {
                                "t3name": "灌阳县"
                            },
                            {
                                "t3name": "龙胜各族自治县"
                            },
                            {
                                "t3name": "兴安县"
                            },
                            {
                                "t3name": "永福县"
                            },
                            {
                                "t3name": "荔蒲县"
                            },
                            {
                                "t3name": "恭城瑶族自治县"
                            },
                            {
                                "t3name": "资源县"
                            },
                            {
                                "t3name": "平乐县"
                            },
                            {
                                "t3name": "象山区"
                            },
                            {
                                "t3name": "叠彩区"
                            },
                            {
                                "t3name": "秀峰区"
                            },
                            {
                                "t3name": "临桂县"
                            },
                            {
                                "t3name": "阳朔县"
                            },
                            {
                                "t3name": "雁山区"
                            },
                            {
                                "t3name": "七星区"
                            },
                            {
                                "t3name": "全州县"
                            },
                            {
                                "t3name": "灵川县"
                            }
                        ]
                    },
                    {
                        "t2name": "南宁市",
                        "t3": [
                            {
                                "t3name": "横县"
                            },
                            {
                                "t3name": "宾阳县"
                            },
                            {
                                "t3name": "上林县"
                            },
                            {
                                "t3name": "兴宁区"
                            },
                            {
                                "t3name": "江南区"
                            },
                            {
                                "t3name": "青秀区"
                            },
                            {
                                "t3name": "良庆区"
                            },
                            {
                                "t3name": "西乡塘区"
                            },
                            {
                                "t3name": "武鸣县"
                            },
                            {
                                "t3name": "邕宁区"
                            },
                            {
                                "t3name": "马山县"
                            },
                            {
                                "t3name": "隆安县"
                            }
                        ]
                    },
                    {
                        "t2name": "防城港市",
                        "t3": [
                            {
                                "t3name": "防城区"
                            },
                            {
                                "t3name": "港口区"
                            },
                            {
                                "t3name": "上思县"
                            },
                            {
                                "t3name": "东兴市"
                            }
                        ]
                    },
                    {
                        "t2name": "崇左市",
                        "t3": [
                            {
                                "t3name": "大新县"
                            },
                            {
                                "t3name": "龙州县"
                            },
                            {
                                "t3name": "凭祥市"
                            },
                            {
                                "t3name": "天等县"
                            },
                            {
                                "t3name": "江洲区"
                            },
                            {
                                "t3name": "宁明县"
                            },
                            {
                                "t3name": "扶绥县"
                            }
                        ]
                    }
                ]
            },
            {
                "t1name": "陕西省",
                "t2": [
                    {
                        "t2name": "咸阳市",
                        "t3": [
                            {
                                "t3name": "杨凌区"
                            },
                            {
                                "t3name": "秦都区"
                            },
                            {
                                "t3name": "旬邑县"
                            },
                            {
                                "t3name": "淳化县"
                            },
                            {
                                "t3name": "乾县"
                            },
                            {
                                "t3name": "泾阳县"
                            },
                            {
                                "t3name": "三原县"
                            },
                            {
                                "t3name": "渭城区"
                            },
                            {
                                "t3name": "永寿县"
                            },
                            {
                                "t3name": "礼泉县"
                            },
                            {
                                "t3name": "武功县"
                            },
                            {
                                "t3name": "长武县"
                            },
                            {
                                "t3name": "彬县"
                            },
                            {
                                "t3name": "兴平市"
                            }
                        ]
                    },
                    {
                        "t2name": "铜川市",
                        "t3": [
                            {
                                "t3name": "印台区"
                            },
                            {
                                "t3name": "王益区"
                            },
                            {
                                "t3name": "宜君县"
                            },
                            {
                                "t3name": "耀州区"
                            }
                        ]
                    },
                    {
                        "t2name": "商洛市",
                        "t3": [
                            {
                                "t3name": "山阳县"
                            },
                            {
                                "t3name": "商南县"
                            },
                            {
                                "t3name": "丹凤县"
                            },
                            {
                                "t3name": "洛南县"
                            },
                            {
                                "t3name": "商州区"
                            },
                            {
                                "t3name": "柞水县"
                            },
                            {
                                "t3name": "镇安县"
                            }
                        ]
                    },
                    {
                        "t2name": "榆林市",
                        "t3": [
                            {
                                "t3name": "横山县"
                            },
                            {
                                "t3name": "靖边县"
                            },
                            {
                                "t3name": "定边县"
                            },
                            {
                                "t3name": "绥德县"
                            },
                            {
                                "t3name": "吴堡县"
                            },
                            {
                                "t3name": "榆阳区"
                            },
                            {
                                "t3name": "神木县"
                            },
                            {
                                "t3name": "府谷县"
                            },
                            {
                                "t3name": "米脂县"
                            },
                            {
                                "t3name": "佳县"
                            },
                            {
                                "t3name": "子洲县"
                            },
                            {
                                "t3name": "清涧县"
                            }
                        ]
                    },
                    {
                        "t2name": "渭南市",
                        "t3": [
                            {
                                "t3name": "临渭区"
                            },
                            {
                                "t3name": "华县"
                            },
                            {
                                "t3name": "潼关县"
                            },
                            {
                                "t3name": "大荔县"
                            },
                            {
                                "t3name": "白水县"
                            },
                            {
                                "t3name": "蒲城县"
                            },
                            {
                                "t3name": "韩城市"
                            },
                            {
                                "t3name": "富平县"
                            },
                            {
                                "t3name": "华阴市"
                            },
                            {
                                "t3name": "澄城县"
                            },
                            {
                                "t3name": "合阳县"
                            }
                        ]
                    },
                    {
                        "t2name": "汉中市",
                        "t3": [
                            {
                                "t3name": "略阳县"
                            },
                            {
                                "t3name": "宁强县"
                            },
                            {
                                "t3name": "勉县"
                            },
                            {
                                "t3name": "西乡县"
                            },
                            {
                                "t3name": "洋县"
                            },
                            {
                                "t3name": "城固县"
                            },
                            {
                                "t3name": "南郑县"
                            },
                            {
                                "t3name": "汉台区"
                            },
                            {
                                "t3name": "留坝县"
                            },
                            {
                                "t3name": "镇巴县"
                            },
                            {
                                "t3name": "佛坪县"
                            }
                        ]
                    },
                    {
                        "t2name": "安康市",
                        "t3": [
                            {
                                "t3name": "汉阴县"
                            },
                            {
                                "t3name": "石泉县"
                            },
                            {
                                "t3name": "宁陕县"
                            },
                            {
                                "t3name": "紫阳县"
                            },
                            {
                                "t3name": "白河县"
                            },
                            {
                                "t3name": "旬阳县"
                            },
                            {
                                "t3name": "汉滨区"
                            },
                            {
                                "t3name": "镇坪县"
                            },
                            {
                                "t3name": "岚皋县"
                            },
                            {
                                "t3name": "平利县"
                            }
                        ]
                    },
                    {
                        "t2name": "延安市",
                        "t3": [
                            {
                                "t3name": "延川县"
                            },
                            {
                                "t3name": "延长县"
                            },
                            {
                                "t3name": "黄龙县"
                            },
                            {
                                "t3name": "黄陵县"
                            },
                            {
                                "t3name": "洛川县"
                            },
                            {
                                "t3name": "宜川县"
                            },
                            {
                                "t3name": "甘泉县"
                            },
                            {
                                "t3name": "富县"
                            },
                            {
                                "t3name": "志丹县"
                            },
                            {
                                "t3name": "吴起县"
                            },
                            {
                                "t3name": "子长县"
                            },
                            {
                                "t3name": "安塞县"
                            },
                            {
                                "t3name": "宝塔区"
                            }
                        ]
                    },
                    {
                        "t2name": "宝鸡市",
                        "t3": [
                            {
                                "t3name": "太白县"
                            },
                            {
                                "t3name": "凤县"
                            },
                            {
                                "t3name": "千阳县"
                            },
                            {
                                "t3name": "麟游县"
                            },
                            {
                                "t3name": "陈仓区"
                            },
                            {
                                "t3name": "凤翔县"
                            },
                            {
                                "t3name": "渭滨区"
                            },
                            {
                                "t3name": "金台区"
                            },
                            {
                                "t3name": "眉县"
                            },
                            {
                                "t3name": "陇县"
                            },
                            {
                                "t3name": "岐山县"
                            },
                            {
                                "t3name": "扶风县"
                            }
                        ]
                    },
                    {
                        "t2name": "西安市",
                        "t3": [
                            {
                                "t3name": "高陵县"
                            },
                            {
                                "t3name": "户县"
                            },
                            {
                                "t3name": "长安区"
                            },
                            {
                                "t3name": "临潼区"
                            },
                            {
                                "t3name": "周至县"
                            },
                            {
                                "t3name": "蓝田县"
                            },
                            {
                                "t3name": "雁塔区"
                            },
                            {
                                "t3name": "阎良区"
                            },
                            {
                                "t3name": "碑林区"
                            },
                            {
                                "t3name": "莲湖区"
                            },
                            {
                                "t3name": "灞桥区"
                            },
                            {
                                "t3name": "未央区"
                            },
                            {
                                "t3name": "新城区"
                            }
                        ]
                    }
                ]
            },
            {
                "t1name": "山西省",
                "t2": [
                    {
                        "t2name": "临汾市",
                        "t3": [
                            {
                                "t3name": "吉县"
                            },
                            {
                                "t3name": "霍州市"
                            },
                            {
                                "t3name": "蒲县"
                            },
                            {
                                "t3name": "侯马市"
                            },
                            {
                                "t3name": "尧都区"
                            },
                            {
                                "t3name": "汾西县"
                            },
                            {
                                "t3name": "翼城县"
                            },
                            {
                                "t3name": "隰县"
                            },
                            {
                                "t3name": "永和县"
                            },
                            {
                                "t3name": "乡宁县"
                            },
                            {
                                "t3name": "大宁县"
                            },
                            {
                                "t3name": "浮山县"
                            },
                            {
                                "t3name": "曲沃县"
                            },
                            {
                                "t3name": "古县"
                            },
                            {
                                "t3name": "安泽县"
                            },
                            {
                                "t3name": "襄汾县"
                            },
                            {
                                "t3name": "洪洞县"
                            }
                        ]
                    },
                    {
                        "t2name": "晋中市",
                        "t3": [
                            {
                                "t3name": "榆次区"
                            },
                            {
                                "t3name": "和顺县"
                            },
                            {
                                "t3name": "昔阳县"
                            },
                            {
                                "t3name": "榆社县"
                            },
                            {
                                "t3name": "左权县"
                            },
                            {
                                "t3name": "祁县"
                            },
                            {
                                "t3name": "平遥县"
                            },
                            {
                                "t3name": "寿阳县"
                            },
                            {
                                "t3name": "太谷县"
                            },
                            {
                                "t3name": "灵石县"
                            },
                            {
                                "t3name": "介休市"
                            }
                        ]
                    },
                    {
                        "t2name": "朔州市",
                        "t3": [
                            {
                                "t3name": "怀仁县"
                            },
                            {
                                "t3name": "朔城区"
                            },
                            {
                                "t3name": "右玉县"
                            },
                            {
                                "t3name": "应县"
                            },
                            {
                                "t3name": "山阴县"
                            },
                            {
                                "t3name": "平鲁区"
                            }
                        ]
                    },
                    {
                        "t2name": "运城市",
                        "t3": [
                            {
                                "t3name": "平陆县"
                            },
                            {
                                "t3name": "夏县"
                            },
                            {
                                "t3name": "新绛县"
                            },
                            {
                                "t3name": "稷山县"
                            },
                            {
                                "t3name": "垣曲县"
                            },
                            {
                                "t3name": "绛县"
                            },
                            {
                                "t3name": "临猗县"
                            },
                            {
                                "t3name": "盐湖区"
                            },
                            {
                                "t3name": "闻喜县"
                            },
                            {
                                "t3name": "万荣县"
                            },
                            {
                                "t3name": "芮城县"
                            },
                            {
                                "t3name": "永济市"
                            },
                            {
                                "t3name": "河津市"
                            }
                        ]
                    },
                    {
                        "t2name": "晋城市",
                        "t3": [
                            {
                                "t3name": "沁水县"
                            },
                            {
                                "t3name": "阳城县"
                            },
                            {
                                "t3name": "高平市"
                            },
                            {
                                "t3name": "泽州县"
                            },
                            {
                                "t3name": "陵川县"
                            },
                            {
                                "t3name": "城区"
                            }
                        ]
                    },
                    {
                        "t2name": "阳泉市",
                        "t3": [
                            {
                                "t3name": "城区"
                            },
                            {
                                "t3name": "平定县"
                            },
                            {
                                "t3name": "盂县"
                            },
                            {
                                "t3name": "矿区"
                            },
                            {
                                "t3name": "郊区"
                            }
                        ]
                    },
                    {
                        "t2name": "忻州市",
                        "t3": [
                            {
                                "t3name": "原平市"
                            },
                            {
                                "t3name": "神池县"
                            },
                            {
                                "t3name": "偏关县"
                            },
                            {
                                "t3name": "保德县"
                            },
                            {
                                "t3name": "定襄县"
                            },
                            {
                                "t3name": "五台县"
                            },
                            {
                                "t3name": "代县"
                            },
                            {
                                "t3name": "繁峙县"
                            },
                            {
                                "t3name": "河曲县"
                            },
                            {
                                "t3name": "岢岚县"
                            },
                            {
                                "t3name": "五寨县"
                            },
                            {
                                "t3name": "忻府区"
                            },
                            {
                                "t3name": "宁武县"
                            },
                            {
                                "t3name": "静乐县"
                            }
                        ]
                    },
                    {
                        "t2name": "大同市",
                        "t3": [
                            {
                                "t3name": "大同县"
                            },
                            {
                                "t3name": "新荣区"
                            },
                            {
                                "t3name": "南郊区"
                            },
                            {
                                "t3name": "城区"
                            },
                            {
                                "t3name": "矿区"
                            },
                            {
                                "t3name": "天镇县"
                            },
                            {
                                "t3name": "阳高县"
                            },
                            {
                                "t3name": "灵丘县"
                            },
                            {
                                "t3name": "广灵县"
                            },
                            {
                                "t3name": "左云县"
                            },
                            {
                                "t3name": "浑源县"
                            }
                        ]
                    },
                    {
                        "t2name": "长治市",
                        "t3": [
                            {
                                "t3name": "黎城县"
                            },
                            {
                                "t3name": "壶关县"
                            },
                            {
                                "t3name": "长子县"
                            },
                            {
                                "t3name": "武乡县"
                            },
                            {
                                "t3name": "沁县"
                            },
                            {
                                "t3name": "沁源县"
                            },
                            {
                                "t3name": "潞城市"
                            },
                            {
                                "t3name": "屯留县"
                            },
                            {
                                "t3name": "平顺县"
                            },
                            {
                                "t3name": "长治县"
                            },
                            {
                                "t3name": "襄垣县"
                            },
                            {
                                "t3name": "城区"
                            },
                            {
                                "t3name": "郊区"
                            }
                        ]
                    },
                    {
                        "t2name": "太原市",
                        "t3": [
                            {
                                "t3name": "杏花岭区"
                            },
                            {
                                "t3name": "尖草坪区"
                            },
                            {
                                "t3name": "万柏林区"
                            },
                            {
                                "t3name": "晋源区"
                            },
                            {
                                "t3name": "清徐县"
                            },
                            {
                                "t3name": "阳曲县"
                            },
                            {
                                "t3name": "娄烦县"
                            },
                            {
                                "t3name": "古交市"
                            },
                            {
                                "t3name": "迎泽区"
                            },
                            {
                                "t3name": "小店区"
                            }
                        ]
                    },
                    {
                        "t2name": "吕梁市",
                        "t3": [
                            {
                                "t3name": "石楼县"
                            },
                            {
                                "t3name": "岚县"
                            },
                            {
                                "t3name": "柳林县"
                            },
                            {
                                "t3name": "临县"
                            },
                            {
                                "t3name": "方山县"
                            },
                            {
                                "t3name": "中阳县"
                            },
                            {
                                "t3name": "交口县"
                            },
                            {
                                "t3name": "孝义市"
                            },
                            {
                                "t3name": "汾阳市"
                            },
                            {
                                "t3name": "文水县"
                            },
                            {
                                "t3name": "离石区"
                            },
                            {
                                "t3name": "兴县"
                            },
                            {
                                "t3name": "交城县"
                            }
                        ]
                    }
                ]
            },
            {
                "t1name": "青海省",
                "t2": [
                    {
                        "t2name": "黄南藏族",
                        "t3": [
                            {
                                "t3name": "河南"
                            },
                            {
                                "t3name": "泽库县"
                            },
                            {
                                "t3name": "尖扎县"
                            },
                            {
                                "t3name": "同仁县"
                            }
                        ]
                    },
                    {
                        "t2name": "海东市",
                        "t3": [
                            {
                                "t3name": "乐都县"
                            },
                            {
                                "t3name": "互助"
                            },
                            {
                                "t3name": "平安县"
                            },
                            {
                                "t3name": "民和"
                            },
                            {
                                "t3name": "化隆"
                            },
                            {
                                "t3name": "循化"
                            }
                        ]
                    },
                    {
                        "t2name": "果洛藏族",
                        "t3": [
                            {
                                "t3name": "班玛县"
                            },
                            {
                                "t3name": "甘德县"
                            },
                            {
                                "t3name": "达日县"
                            },
                            {
                                "t3name": "久治县"
                            },
                            {
                                "t3name": "玛沁县"
                            },
                            {
                                "t3name": "玛多县"
                            }
                        ]
                    },
                    {
                        "t2name": "西宁市",
                        "t3": [
                            {
                                "t3name": "湟中县"
                            },
                            {
                                "t3name": "湟源县"
                            },
                            {
                                "t3name": "城北区"
                            },
                            {
                                "t3name": "大通"
                            },
                            {
                                "t3name": "城西区"
                            },
                            {
                                "t3name": "城中区"
                            },
                            {
                                "t3name": "城东区"
                            }
                        ]
                    },
                    {
                        "t2name": "海北藏族",
                        "t3": [
                            {
                                "t3name": "刚察县"
                            },
                            {
                                "t3name": "海晏县"
                            },
                            {
                                "t3name": "祁连县"
                            },
                            {
                                "t3name": "门源"
                            }
                        ]
                    },
                    {
                        "t2name": "玉树藏族",
                        "t3": [
                            {
                                "t3name": "玉树县"
                            },
                            {
                                "t3name": "称多县"
                            },
                            {
                                "t3name": "杂多县"
                            },
                            {
                                "t3name": "囊谦县"
                            },
                            {
                                "t3name": "治多县"
                            },
                            {
                                "t3name": "曲麻莱县"
                            }
                        ]
                    },
                    {
                        "t2name": "海南藏族",
                        "t3": [
                            {
                                "t3name": "贵南县"
                            },
                            {
                                "t3name": "贵德县"
                            },
                            {
                                "t3name": "兴海县"
                            },
                            {
                                "t3name": "同德县"
                            },
                            {
                                "t3name": "共和县"
                            }
                        ]
                    },
                    {
                        "t2name": "海西蒙古",
                        "t3": [
                            {
                                "t3name": "天峻县"
                            },
                            {
                                "t3name": "都兰县"
                            },
                            {
                                "t3name": "格尔木市"
                            },
                            {
                                "t3name": "乌兰县"
                            },
                            {
                                "t3name": "德令哈市"
                            }
                        ]
                    }
                ]
            },
            {
                "t1name": "宁夏回族",
                "t2": [
                    {
                        "t2name": "石嘴山市",
                        "t3": [
                            {
                                "t3name": "大武口区"
                            },
                            {
                                "t3name": "惠农区"
                            },
                            {
                                "t3name": "平罗县"
                            }
                        ]
                    },
                    {
                        "t2name": "固原市",
                        "t3": [
                            {
                                "t3name": "原州区"
                            },
                            {
                                "t3name": "彭阳县"
                            },
                            {
                                "t3name": "泾源县"
                            },
                            {
                                "t3name": "隆德县"
                            },
                            {
                                "t3name": "西吉县"
                            }
                        ]
                    },
                    {
                        "t2name": "中卫市",
                        "t3": [
                            {
                                "t3name": "海原县"
                            },
                            {
                                "t3name": "中宁县"
                            },
                            {
                                "t3name": "沙坡头区"
                            }
                        ]
                    },
                    {
                        "t2name": "银川市",
                        "t3": [
                            {
                                "t3name": "贺兰县"
                            },
                            {
                                "t3name": "灵武市"
                            },
                            {
                                "t3name": "金凤区"
                            },
                            {
                                "t3name": "永宁县"
                            },
                            {
                                "t3name": "兴庆区"
                            },
                            {
                                "t3name": "西夏区"
                            }
                        ]
                    },
                    {
                        "t2name": "吴忠市",
                        "t3": [
                            {
                                "t3name": "青铜峡市"
                            },
                            {
                                "t3name": "同心县"
                            },
                            {
                                "t3name": "盐池县"
                            },
                            {
                                "t3name": "利通区"
                            }
                        ]
                    }
                ]
            },
            {
                "t1name": "甘肃省",
                "t2": [
                    {
                        "t2name": "兰州市",
                        "t3": [
                            {
                                "t3name": "西固区"
                            },
                            {
                                "t3name": "安宁区"
                            },
                            {
                                "t3name": "城关区"
                            },
                            {
                                "t3name": "七里河区"
                            },
                            {
                                "t3name": "皋兰县"
                            },
                            {
                                "t3name": "榆中县"
                            },
                            {
                                "t3name": "红古区"
                            },
                            {
                                "t3name": "永登县"
                            }
                        ]
                    },
                    {
                        "t2name": "金昌市",
                        "t3": [
                            {
                                "t3name": "金川区"
                            },
                            {
                                "t3name": "永昌县"
                            }
                        ]
                    },
                    {
                        "t2name": "甘南藏族",
                        "t3": [
                            {
                                "t3name": "碌曲县"
                            },
                            {
                                "t3name": "玛曲县"
                            },
                            {
                                "t3name": "夏河县"
                            },
                            {
                                "t3name": "卓尼县"
                            },
                            {
                                "t3name": "临潭县"
                            },
                            {
                                "t3name": "迭部县"
                            },
                            {
                                "t3name": "舟曲县"
                            },
                            {
                                "t3name": "合作市"
                            }
                        ]
                    },
                    {
                        "t2name": "平凉市",
                        "t3": [
                            {
                                "t3name": "静宁县"
                            },
                            {
                                "t3name": "庄浪县"
                            },
                            {
                                "t3name": "崆峒区"
                            },
                            {
                                "t3name": "华亭县"
                            },
                            {
                                "t3name": "崇信县"
                            },
                            {
                                "t3name": "灵台县"
                            },
                            {
                                "t3name": "泾川县"
                            }
                        ]
                    },
                    {
                        "t2name": "嘉峪关市",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "天水市",
                        "t3": [
                            {
                                "t3name": "秦安县"
                            },
                            {
                                "t3name": "清水县"
                            },
                            {
                                "t3name": "甘谷县"
                            },
                            {
                                "t3name": "武山县"
                            },
                            {
                                "t3name": "北道区"
                            },
                            {
                                "t3name": "秦城区"
                            },
                            {
                                "t3name": "张家川"
                            }
                        ]
                    },
                    {
                        "t2name": "白银市",
                        "t3": [
                            {
                                "t3name": "景泰县"
                            },
                            {
                                "t3name": "会宁县"
                            },
                            {
                                "t3name": "白银区"
                            },
                            {
                                "t3name": "靖远县"
                            },
                            {
                                "t3name": "平川区"
                            }
                        ]
                    },
                    {
                        "t2name": "武威市",
                        "t3": [
                            {
                                "t3name": "凉州区"
                            },
                            {
                                "t3name": "民勤县"
                            },
                            {
                                "t3name": "古浪县"
                            },
                            {
                                "t3name": "天祝"
                            }
                        ]
                    },
                    {
                        "t2name": "张掖市",
                        "t3": [
                            {
                                "t3name": "肃南裕固族"
                            },
                            {
                                "t3name": "民乐县"
                            },
                            {
                                "t3name": "山丹县"
                            },
                            {
                                "t3name": "高台县"
                            },
                            {
                                "t3name": "临泽县"
                            },
                            {
                                "t3name": "甘州区"
                            }
                        ]
                    },
                    {
                        "t2name": "庆阳市",
                        "t3": [
                            {
                                "t3name": "华池县"
                            },
                            {
                                "t3name": "合水县"
                            },
                            {
                                "t3name": "西峰区"
                            },
                            {
                                "t3name": "宁县"
                            },
                            {
                                "t3name": "正宁县"
                            },
                            {
                                "t3name": "镇原县"
                            },
                            {
                                "t3name": "庆城县"
                            },
                            {
                                "t3name": "环县"
                            }
                        ]
                    },
                    {
                        "t2name": "定西市",
                        "t3": [
                            {
                                "t3name": "安定区"
                            },
                            {
                                "t3name": "陇西县"
                            },
                            {
                                "t3name": "通渭县"
                            },
                            {
                                "t3name": "临洮县"
                            },
                            {
                                "t3name": "渭源县"
                            },
                            {
                                "t3name": "漳县"
                            },
                            {
                                "t3name": "岷县"
                            }
                        ]
                    },
                    {
                        "t2name": "临夏回族",
                        "t3": [
                            {
                                "t3name": "积石山"
                            },
                            {
                                "t3name": "东乡族"
                            },
                            {
                                "t3name": "和政县"
                            },
                            {
                                "t3name": "广河县"
                            },
                            {
                                "t3name": "永靖县"
                            },
                            {
                                "t3name": "康乐县"
                            },
                            {
                                "t3name": "临夏县"
                            },
                            {
                                "t3name": "临夏市"
                            }
                        ]
                    },
                    {
                        "t2name": "酒泉市",
                        "t3": [
                            {
                                "t3name": "敦煌市"
                            },
                            {
                                "t3name": "阿克塞"
                            },
                            {
                                "t3name": "玉门市"
                            },
                            {
                                "t3name": "瓜州县"
                            },
                            {
                                "t3name": "肃北"
                            },
                            {
                                "t3name": "肃州区"
                            },
                            {
                                "t3name": "金塔县"
                            }
                        ]
                    },
                    {
                        "t2name": "陇南市",
                        "t3": [
                            {
                                "t3name": "两当县"
                            },
                            {
                                "t3name": "礼县"
                            },
                            {
                                "t3name": "徽县"
                            },
                            {
                                "t3name": "文县"
                            },
                            {
                                "t3name": "宕昌县"
                            },
                            {
                                "t3name": "康县"
                            },
                            {
                                "t3name": "西和县"
                            },
                            {
                                "t3name": "武都区"
                            },
                            {
                                "t3name": "成县"
                            }
                        ]
                    }
                ]
            },
            {
                "t1name": "西藏自治",
                "t2": [
                    {
                        "t2name": "阿里地区",
                        "t3": [
                            {
                                "t3name": "普兰"
                            },
                            {
                                "t3name": "措勤"
                            },
                            {
                                "t3name": "改则"
                            },
                            {
                                "t3name": "革吉"
                            },
                            {
                                "t3name": "日土"
                            },
                            {
                                "t3name": "噶尔"
                            },
                            {
                                "t3name": "札达"
                            }
                        ]
                    },
                    {
                        "t2name": "拉萨市",
                        "t3": [
                            {
                                "t3name": "当雄"
                            },
                            {
                                "t3name": "尼木"
                            },
                            {
                                "t3name": "城关区"
                            },
                            {
                                "t3name": "林周"
                            },
                            {
                                "t3name": "达孜"
                            },
                            {
                                "t3name": "墨竹工卡"
                            },
                            {
                                "t3name": "曲水"
                            },
                            {
                                "t3name": "堆龙德庆"
                            }
                        ]
                    },
                    {
                        "t2name": "山南地区",
                        "t3": [
                            {
                                "t3name": "曲松"
                            },
                            {
                                "t3name": "措美"
                            },
                            {
                                "t3name": "洛扎"
                            },
                            {
                                "t3name": "加查"
                            },
                            {
                                "t3name": "扎囊"
                            },
                            {
                                "t3name": "贡嘎"
                            },
                            {
                                "t3name": "桑日"
                            },
                            {
                                "t3name": "琼结"
                            },
                            {
                                "t3name": "浪卡子"
                            },
                            {
                                "t3name": "隆子"
                            },
                            {
                                "t3name": "错那"
                            },
                            {
                                "t3name": "乃东"
                            }
                        ]
                    },
                    {
                        "t2name": "日喀则市",
                        "t3": [
                            {
                                "t3name": "昂仁"
                            },
                            {
                                "t3name": "拉孜"
                            },
                            {
                                "t3name": "萨迦"
                            },
                            {
                                "t3name": "定日"
                            },
                            {
                                "t3name": "江孜"
                            },
                            {
                                "t3name": "南木林"
                            },
                            {
                                "t3name": "日喀则市"
                            },
                            {
                                "t3name": "聂拉木"
                            },
                            {
                                "t3name": "萨嘎"
                            },
                            {
                                "t3name": "亚东"
                            },
                            {
                                "t3name": "吉隆"
                            },
                            {
                                "t3name": "定结"
                            },
                            {
                                "t3name": "仲巴"
                            },
                            {
                                "t3name": "白朗"
                            },
                            {
                                "t3name": "谢通门"
                            },
                            {
                                "t3name": "仁布"
                            },
                            {
                                "t3name": "岗巴"
                            },
                            {
                                "t3name": "康马"
                            }
                        ]
                    },
                    {
                        "t2name": "那曲地区",
                        "t3": [
                            {
                                "t3name": "尼玛"
                            },
                            {
                                "t3name": "那曲"
                            },
                            {
                                "t3name": "比如"
                            },
                            {
                                "t3name": "嘉黎"
                            },
                            {
                                "t3name": "安多"
                            },
                            {
                                "t3name": "聂荣"
                            },
                            {
                                "t3name": "索"
                            },
                            {
                                "t3name": "申扎"
                            },
                            {
                                "t3name": "巴青"
                            },
                            {
                                "t3name": "班戈"
                            }
                        ]
                    },
                    {
                        "t2name": "昌都地区",
                        "t3": [
                            {
                                "t3name": "芒康"
                            },
                            {
                                "t3name": "边坝"
                            },
                            {
                                "t3name": "左贡"
                            },
                            {
                                "t3name": "八宿"
                            },
                            {
                                "t3name": "昌都"
                            },
                            {
                                "t3name": "江达"
                            },
                            {
                                "t3name": "类乌齐"
                            },
                            {
                                "t3name": "贡觉"
                            },
                            {
                                "t3name": "察雅"
                            },
                            {
                                "t3name": "丁青"
                            },
                            {
                                "t3name": "洛隆"
                            }
                        ]
                    },
                    {
                        "t2name": "林芝地区",
                        "t3": [
                            {
                                "t3name": "墨脱"
                            },
                            {
                                "t3name": "米林"
                            },
                            {
                                "t3name": "工布江达"
                            },
                            {
                                "t3name": "林芝"
                            },
                            {
                                "t3name": "波密"
                            },
                            {
                                "t3name": "察隅"
                            },
                            {
                                "t3name": "朗"
                            }
                        ]
                    }
                ]
            },
            {
                "t1name": "内蒙古自",
                "t2": [
                    {
                        "t2name": "巴彦淖尔",
                        "t3": [
                            {
                                "t3name": "临河区"
                            },
                            {
                                "t3name": "五原县"
                            },
                            {
                                "t3name": "磴口县"
                            },
                            {
                                "t3name": "乌拉特前旗"
                            },
                            {
                                "t3name": "乌拉特中旗"
                            },
                            {
                                "t3name": "乌拉特后旗"
                            },
                            {
                                "t3name": "杭锦后旗"
                            }
                        ]
                    },
                    {
                        "t2name": "锡林郭勒盟",
                        "t3": [
                            {
                                "t3name": "多伦县"
                            },
                            {
                                "t3name": "二连浩特市"
                            },
                            {
                                "t3name": "苏尼特左旗"
                            },
                            {
                                "t3name": "苏尼特右旗"
                            },
                            {
                                "t3name": "锡林浩特市"
                            },
                            {
                                "t3name": "阿巴嘎旗"
                            },
                            {
                                "t3name": "东乌珠穆沁旗"
                            },
                            {
                                "t3name": "西乌珠穆沁旗"
                            },
                            {
                                "t3name": "正蓝旗"
                            },
                            {
                                "t3name": "正镶白旗"
                            },
                            {
                                "t3name": "镶黄旗"
                            },
                            {
                                "t3name": "太仆寺旗"
                            }
                        ]
                    },
                    {
                        "t2name": "兴安盟",
                        "t3": [
                            {
                                "t3name": "科尔沁右翼前旗"
                            },
                            {
                                "t3name": "阿尔山市"
                            },
                            {
                                "t3name": "乌兰浩特市"
                            },
                            {
                                "t3name": "突泉县"
                            },
                            {
                                "t3name": "科尔沁右翼中旗"
                            },
                            {
                                "t3name": "扎赉特旗"
                            }
                        ]
                    },
                    {
                        "t2name": "乌兰察布",
                        "t3": [
                            {
                                "t3name": "化德县"
                            },
                            {
                                "t3name": "商都县"
                            },
                            {
                                "t3name": "四子王旗"
                            },
                            {
                                "t3name": "察哈尔右翼后旗"
                            },
                            {
                                "t3name": "丰镇市"
                            },
                            {
                                "t3name": "凉城县"
                            },
                            {
                                "t3name": "兴和县"
                            },
                            {
                                "t3name": "集宁区"
                            },
                            {
                                "t3name": "卓资县"
                            },
                            {
                                "t3name": "察哈尔右翼中旗"
                            },
                            {
                                "t3name": "察哈尔右翼前旗"
                            }
                        ]
                    },
                    {
                        "t2name": "鄂尔多斯",
                        "t3": [
                            {
                                "t3name": "达拉特旗"
                            },
                            {
                                "t3name": "东胜区"
                            },
                            {
                                "t3name": "乌审旗"
                            },
                            {
                                "t3name": "伊金霍洛旗"
                            },
                            {
                                "t3name": "鄂托克旗"
                            },
                            {
                                "t3name": "杭锦旗"
                            },
                            {
                                "t3name": "准格尔旗"
                            },
                            {
                                "t3name": "鄂托克前旗"
                            }
                        ]
                    },
                    {
                        "t2name": "乌海市",
                        "t3": [
                            {
                                "t3name": "乌达区"
                            },
                            {
                                "t3name": "海南区"
                            },
                            {
                                "t3name": "海勃湾区"
                            }
                        ]
                    },
                    {
                        "t2name": "包头市",
                        "t3": [
                            {
                                "t3name": "达尔罕茂明安联合旗"
                            },
                            {
                                "t3name": "昆都仑区"
                            },
                            {
                                "t3name": "东河区"
                            },
                            {
                                "t3name": "九原区"
                            },
                            {
                                "t3name": "白云矿区"
                            },
                            {
                                "t3name": "固阳县"
                            },
                            {
                                "t3name": "石拐区"
                            },
                            {
                                "t3name": "青山区"
                            },
                            {
                                "t3name": "土默特右旗"
                            }
                        ]
                    },
                    {
                        "t2name": "呼和浩特",
                        "t3": [
                            {
                                "t3name": "清水河县"
                            },
                            {
                                "t3name": "和林格尔县"
                            },
                            {
                                "t3name": "托克托县"
                            },
                            {
                                "t3name": "土默特左旗"
                            },
                            {
                                "t3name": "赛罕区"
                            },
                            {
                                "t3name": "武川县"
                            },
                            {
                                "t3name": "新城区"
                            },
                            {
                                "t3name": "回民区"
                            },
                            {
                                "t3name": "玉泉区"
                            }
                        ]
                    },
                    {
                        "t2name": "呼伦贝尔",
                        "t3": [
                            {
                                "t3name": "根河市"
                            },
                            {
                                "t3name": "新巴尔虎右旗"
                            },
                            {
                                "t3name": "新巴尔虎左旗"
                            },
                            {
                                "t3name": "陈巴尔虎旗"
                            },
                            {
                                "t3name": "鄂温克族自治旗"
                            },
                            {
                                "t3name": "额尔古纳市"
                            },
                            {
                                "t3name": "扎兰屯市"
                            },
                            {
                                "t3name": "牙克石市"
                            },
                            {
                                "t3name": "满洲里市"
                            },
                            {
                                "t3name": "莫力达瓦达斡尔族"
                            },
                            {
                                "t3name": "鄂伦春自治旗"
                            },
                            {
                                "t3name": "海拉尔区"
                            },
                            {
                                "t3name": "阿荣旗"
                            }
                        ]
                    },
                    {
                        "t2name": "通辽市",
                        "t3": [
                            {
                                "t3name": "科尔沁左翼中旗"
                            },
                            {
                                "t3name": "科尔沁区"
                            },
                            {
                                "t3name": "开鲁县"
                            },
                            {
                                "t3name": "科尔沁左翼后旗"
                            },
                            {
                                "t3name": "奈曼旗"
                            },
                            {
                                "t3name": "库伦旗"
                            },
                            {
                                "t3name": "霍林郭勒市"
                            },
                            {
                                "t3name": "扎鲁特旗"
                            }
                        ]
                    },
                    {
                        "t2name": "阿拉善盟",
                        "t3": [
                            {
                                "t3name": "额济纳旗"
                            },
                            {
                                "t3name": "阿拉善右旗"
                            },
                            {
                                "t3name": "阿拉善左旗"
                            }
                        ]
                    },
                    {
                        "t2name": "赤峰市",
                        "t3": [
                            {
                                "t3name": "林西县"
                            },
                            {
                                "t3name": "克什克腾旗"
                            },
                            {
                                "t3name": "翁牛特旗"
                            },
                            {
                                "t3name": "喀喇沁旗"
                            },
                            {
                                "t3name": "松山区"
                            },
                            {
                                "t3name": "阿鲁科尔沁旗"
                            },
                            {
                                "t3name": "巴林左旗"
                            },
                            {
                                "t3name": "巴林右旗"
                            },
                            {
                                "t3name": "宁城县"
                            },
                            {
                                "t3name": "敖汉旗"
                            },
                            {
                                "t3name": "元宝山区"
                            },
                            {
                                "t3name": "红山区"
                            }
                        ]
                    }
                ]
            },
            {
                "t1name": "新疆维吾",
                "t2": [
                    {
                        "t2name": "伊犁",
                        "t3": [
                            {
                                "t3name": "新源"
                            },
                            {
                                "t3name": "昭苏"
                            },
                            {
                                "t3name": "霍城"
                            },
                            {
                                "t3name": "巩留"
                            },
                            {
                                "t3name": "伊宁"
                            },
                            {
                                "t3name": "察布查尔"
                            },
                            {
                                "t3name": "伊宁市"
                            },
                            {
                                "t3name": "奎屯市"
                            },
                            {
                                "t3name": "尼勒克"
                            },
                            {
                                "t3name": "特克斯"
                            }
                        ]
                    },
                    {
                        "t2name": "克拉玛依",
                        "t3": [
                            {
                                "t3name": "独山子区"
                            },
                            {
                                "t3name": "白碱滩区"
                            },
                            {
                                "t3name": "克拉玛依区"
                            },
                            {
                                "t3name": "乌尔禾区"
                            }
                        ]
                    },
                    {
                        "t2name": "哈密地",
                        "t3": [
                            {
                                "t3name": "巴里坤"
                            },
                            {
                                "t3name": "哈密市"
                            },
                            {
                                "t3name": "伊吾"
                            }
                        ]
                    },
                    {
                        "t2name": "石河子",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "吐鲁番地",
                        "t3": [
                            {
                                "t3name": "托克逊"
                            },
                            {
                                "t3name": "鄯善"
                            },
                            {
                                "t3name": "吐鲁番市"
                            }
                        ]
                    },
                    {
                        "t2name": "阿拉尔",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "阿勒泰地",
                        "t3": [
                            {
                                "t3name": "阿勒泰市"
                            },
                            {
                                "t3name": "布尔津"
                            },
                            {
                                "t3name": "福海"
                            },
                            {
                                "t3name": "哈巴河"
                            },
                            {
                                "t3name": "青河"
                            },
                            {
                                "t3name": "吉木乃"
                            },
                            {
                                "t3name": "富蕴"
                            }
                        ]
                    },
                    {
                        "t2name": "乌鲁木齐",
                        "t3": [
                            {
                                "t3name": "乌鲁木齐"
                            },
                            {
                                "t3name": "天山区"
                            },
                            {
                                "t3name": "沙依巴克区"
                            },
                            {
                                "t3name": "新市区"
                            },
                            {
                                "t3name": "水磨沟区"
                            },
                            {
                                "t3name": "头屯河区"
                            },
                            {
                                "t3name": "达坂城区"
                            },
                            {
                                "t3name": "东山区"
                            }
                        ]
                    },
                    {
                        "t2name": "塔城地",
                        "t3": [
                            {
                                "t3name": "和布克赛尔"
                            },
                            {
                                "t3name": "乌苏市"
                            },
                            {
                                "t3name": "塔城市"
                            },
                            {
                                "t3name": "沙湾"
                            },
                            {
                                "t3name": "额敏"
                            },
                            {
                                "t3name": "裕民"
                            },
                            {
                                "t3name": "托里"
                            }
                        ]
                    },
                    {
                        "t2name": "昌吉",
                        "t3": [
                            {
                                "t3name": "昌吉市"
                            },
                            {
                                "t3name": "呼图壁"
                            },
                            {
                                "t3name": "玛纳斯"
                            },
                            {
                                "t3name": "阜康市"
                            },
                            {
                                "t3name": "米泉市"
                            },
                            {
                                "t3name": "木垒"
                            },
                            {
                                "t3name": "奇台"
                            },
                            {
                                "t3name": "吉木萨尔"
                            }
                        ]
                    },
                    {
                        "t2name": "克孜勒",
                        "t3": [
                            {
                                "t3name": "阿合奇"
                            },
                            {
                                "t3name": "阿克陶"
                            },
                            {
                                "t3name": "阿图什市"
                            },
                            {
                                "t3name": "乌恰"
                            }
                        ]
                    },
                    {
                        "t2name": "图木舒克",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "阿克苏地",
                        "t3": [
                            {
                                "t3name": "乌什"
                            },
                            {
                                "t3name": "拜城"
                            },
                            {
                                "t3name": "柯坪"
                            },
                            {
                                "t3name": "阿瓦提"
                            },
                            {
                                "t3name": "库车"
                            },
                            {
                                "t3name": "温宿"
                            },
                            {
                                "t3name": "新和"
                            },
                            {
                                "t3name": "沙雅"
                            },
                            {
                                "t3name": "阿克苏市"
                            }
                        ]
                    },
                    {
                        "t2name": "五家渠",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "巴音郭楞",
                        "t3": [
                            {
                                "t3name": "博湖"
                            },
                            {
                                "t3name": "尉犁"
                            },
                            {
                                "t3name": "若羌"
                            },
                            {
                                "t3name": "库尔勒市"
                            },
                            {
                                "t3name": "轮台"
                            },
                            {
                                "t3name": "和静"
                            },
                            {
                                "t3name": "和硕"
                            },
                            {
                                "t3name": "且末"
                            },
                            {
                                "t3name": "焉耆"
                            }
                        ]
                    },
                    {
                        "t2name": "和田地",
                        "t3": [
                            {
                                "t3name": "于田"
                            },
                            {
                                "t3name": "民丰"
                            },
                            {
                                "t3name": "策勒"
                            },
                            {
                                "t3name": "洛浦"
                            },
                            {
                                "t3name": "皮山"
                            },
                            {
                                "t3name": "墨玉"
                            },
                            {
                                "t3name": "和田"
                            },
                            {
                                "t3name": "和田市"
                            }
                        ]
                    },
                    {
                        "t2name": "博尔塔拉",
                        "t3": [
                            {
                                "t3name": "精河"
                            },
                            {
                                "t3name": "温泉"
                            },
                            {
                                "t3name": "博乐市"
                            }
                        ]
                    },
                    {
                        "t2name": "喀什地",
                        "t3": [
                            {
                                "t3name": "伽师"
                            },
                            {
                                "t3name": "岳普湖"
                            },
                            {
                                "t3name": "叶城"
                            },
                            {
                                "t3name": "麦盖提"
                            },
                            {
                                "t3name": "疏勒"
                            },
                            {
                                "t3name": "英吉沙"
                            },
                            {
                                "t3name": "泽普"
                            },
                            {
                                "t3name": "莎车"
                            },
                            {
                                "t3name": "塔什库尔干"
                            },
                            {
                                "t3name": "巴楚"
                            },
                            {
                                "t3name": "喀什市"
                            },
                            {
                                "t3name": "疏附"
                            }
                        ]
                    }
                ]
            },
            {
                "t1name": "台湾",
                "t2": [
                    {
                        "t2name": "新竹县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "基隆市",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "高雄市",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "台北市",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "台南市",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "嘉义县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "台中市",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "宜兰县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "屏东县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "桃园市",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "台东县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "苗栗县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "金门县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "花莲县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "云林县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "连江县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "澎湖岛",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "南投县",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "彰化县",
                        "t3": [

                        ]
                    }
                ]
            },
            {
                "t1name": "香港特别行政区",
                "t2": [
                    {
                        "t2name": "油尖旺区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "黄大仙祠",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "深水埗区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "观塘区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "九龙城区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "湾仔区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "葵青区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "离岛区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "中西中西",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "南区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "东区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "荃湾区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "元朗区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "沙田区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "西贡区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "屯门区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "大埔区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "北区",
                        "t3": [

                        ]
                    }
                ]
            },
            {
                "t1name": "澳门特别行政区",
                "t2": [
                    {
                        "t2name": "花地玛堂区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "圣安多尼堂区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "大堂区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "望德堂区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "风顺堂区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "嘉模堂区",
                        "t3": [

                        ]
                    },
                    {
                        "t2name": "圣方济各堂",
                        "t3": [

                        ]
                    }
                ]
            }
        ]
        var cityservice = {
            data: (function () {
                return cityjson
            }()),
            getp: function () {
                return cityjson.map(function (i) { return i.t1name })
            },
            getc: function (p) {
                if (p) {
                    return cityjson.filter(function (i) { return i.t1name == p })[0].t2.map(function (i) { return i.t2name })
                } else {
                    return cityjson[0].t2.map(function (i) { return i.t2name })
                }

            },
            getr: function (p, c) {
                if (c) {
                    return cityjson.filter(function (i) { return i.t1name == p })[0].t2.filter(function (i) { return i.t2name == c })[0].t3.map(function (i) { return i.t3name })
                } else {
                    return []
                }

            },
            initdata: function (address) {
                if (address) {
                    //这里有坑^_^//
                    // var values = address.split(" ");
                    // return [[
                    //     { data: cityservice.getp() },
                    //     { data: cityservice.getc(values[0]) },
                    //     { data: cityservice.getr(values[0], values[1]) }
                    // ]]
                    return [[
                        { data: cityservice.getp() },
                        { data: cityservice.getc() },
                        { data: cityservice.getr() }
                    ]]
                } else {
                    return [[
                        { data: cityservice.getp() },
                        { data: cityservice.getc() },
                        { data: cityservice.getr() }
                    ]]
                }
            },
            getcchangedata: function (v0, v1) {
                var t2obj = cityjson
                    .filter(function (i) { return i.t1name == v0 })[0].t2
                    .filter(function (i) { return i.t2name == v1 })[0];
                var data = {
                    2: { data: t2obj.t3.map(function (i) { return i.t3name }) }
                }
                return data
            },
            getpchangedata: function (v0) {
                var t2tree = cityjson
                    .filter(function (i) { return i.t1name == v0 })[0].t2;
                var data = {
                    1: {
                        data: t2tree.map(function (ii) { return ii.t2name })
                    },
                    2: {
                        data: t2tree[0].t3.map(function (ii) { return ii.t3name })
                    }
                }
                return data;

            }
        }
        return cityservice;
    })