<template>
  <div class="sales-contract">
    <h1>销售合同</h1>
    <header>
      <p>合同签订地点：上海</p>
      <p>合同签定日期：</p>
      <p>合同编号：</p>
      <br>
      <p>代销单位（卖方）：上海挖链科技有限公司</p>
      <p>订货单位（买方）：</p>
      <br>
      <br>
      <p>根据《中华人民共和国合同法》的规定，本着平等、自愿、诚实信用的原则，卖方作为供货方的代销单位，经与买卖双方友好协商，特订立本协议，以兹双方共同遵守：</p>
      <br>
    </header>
    <div class="container">
      <ul>
        <ol class="c-list">
          <li>
            <h2>1、合同标的（以下或称“货品”）：</h2>
            <table>
              <tr>
                <td>型号(算力)</td>
                <td>数量</td>
                <td>单价/元</td>
                <td>金额/元</td>
                <td>备注</td>
              </tr>
              <tr>
                <td>ETH矿机合约（币盈计划）</td>
                <td></td>
                <td></td>
                <td></td>
                <td>额定算力范围220M±5%</td>
              </tr>
              <tr>
                <td>&nbsp;</td>
                <td></td>
                <td></td>
                <td></td>
                <td></td>
              </tr>
              <tr>
                <td>实际结算金额合计：</td>
                <td colspan="4">（人民币：______________元）</td>
              </tr>
            </table>
            <p>备注:</p>
            <ol class="r-list">
              <li><p>(1)本次销售价格为含税价格；</p></li>
              <li><p>(2)本次销售价格包含在合约期限内由卖方托管运营所产生的电费、运营费用等，买方无需再额外支出；</p></li>
              <li><p>(3)货品非原厂新机，亦非品牌机型，仅保证算力符合合同约定。</p></li>
            </ol>
          </li>
          <li>
            <h2>2、交割方式：</h2>
            <h3>2.1、交割地点： 托管矿场，买方个人账号内显示对应数据</h3>
            <h3>2.2、交割日期：____年____月____日</h3>
            <h3>2.3、买方签收人（姓名：_____，联系方式___________）应于交割日期验收货品，并检查个人账户内是否开始显示各项数据，如有问题，和卖方客服人员进行沟通解决。</h3>
          </li>
          <li>
            <h2>3、结算方式和期限：</h2>
            <h3>3.1、买卖双方合同款项结算方式及期限为：</h3>
            <table>
              <tr>
                <td>付款时间</td>
                <td>付款金额/元</td>
                <td>备注</td>
              </tr>
              <tr>
                <td>____年____月____日</td>
                <td></td>
                <td>全款</td>
              </tr>
              <tr>
                <td>合计：</td>
                <td></td>
                <td></td>
              </tr>
            </table>
            <h3>3.2、卖方收款方式为：</h3>
            <p>□ 汇款</p>
            <table>
              <tr>
                <td rowspan="3">银行付款信息</td>
                <td>收款人姓名：上海挖链科技有限公司</td>
              </tr>
              <tr>
                <td>收款账户：15000091573845</td>
              </tr>
              <tr>
                <td>开户行：平安银行上海新天地支行 </td>
              </tr>
            </table>
            <p>□ 通过卖方平台线上支付</p>
            <h3>3.3、结算方式：人民币。若买方需要开票，卖方应提供由供货方开具卖方的正规的增值税发票给买方。</h3>
          </li>
          <li>
            <h2>4、验收规定：</h2>
            <h3>4.1、货品合约交割时，买方应检查货品算力，若发现与合同标定不符，及时和卖方客服人员进行沟通，否则视为卖方交割时符合合同规定。</h3>
            <h3>4.2、货品合约异议期限为卖方交割后三日内。此期间，买方应仔细检查个人账户，并确认货品算力，一旦发现存在与合同不符之处，须立即通知卖方客服人员前来联检。</h3>
          </li>
          <li>
            <h2>5、保修与售后服务：</h2>
            <p>本产品售后政策如下：一旦购买，即视为对本合同的认同。</p>
            <h3>
              5.1、此货品不同于一般的消费类电子产品，而是根据顾客需求特殊定制的产品，除根据本合同约定由卖方行使回购权外，买方付款后不能退款、退货，投资需谨慎。由于市场原因，货品价格可能会随时调整，故卖方不做事先通知和价格补偿。</h3>
            <h3>5.2、正常情况下，此货品卖方保证稳定运营期限为365天，到期后货品生命周期默认结束。在此期间，卖方会全力保证货品正常运行、买方个人账号正常显示各项数据。</h3>
            <h3>5.3、卖方在保修期和售后服务另有承诺的，应当另外书面约定，作为本合同的附件，否则适用上款。</h3>
          </li>
          <li>
            <h2>6、特别约定：</h2>
            <h3>6.1、双方确认，买方购买货品后，默认将货品立即交由卖方代为托管运营365天，与托管运营服务相关费用均已包含，不再另行支付。</h3>
            <h3>6.2、自托管运营之日起未满180天期间，如买方就货品所产生的数字货币要求提币（即指提取数字货币至买方指定的合法钱包地址，下同），则：</h3>
            <h4>（1）如届时币值不足16800元时，卖方应提取数字货币至买方指定的合法钱包地址（对应提币所涉及到的手续费等，默认买方承担，下同），所涉托管服务自行终止，卖方将货品交还买方（由买方于一周内自提）。</h4>
            <h4>（2）如届时币值达到或超过16800元时，卖方应提取数字货币至买方指定的合法钱包地址，所涉托管服务自行终止，货品默认不予退还，由卖方进行处置。</h4>
            <h3>
              6.3、自运营托管之日起已满180天并至365天届满期间，如买方就货品所产生的数字货币要求提币，则：卖方应提取数字货币至买方指定的合法钱包地址，所涉托管服务自行终止，货品默认不予退还，由卖方进行处置。</h3>
            <h3>6.4、自运营托管之日起已届满365天，默认托管服务终止，且货品生命周期结束。买方可按照如下方式，在五个工作日完成对应操作：</h3>
            <h4>（1）如届时币值不足16800元时，且买方就货品所产生的数字货币未要求提币，则买方有权要求卖方按照本协议内货品售价的70%进行回购，则该货品在托管运营期内所产生的数字货币归属卖方所有。</h4>
            <h4>（2）如届时币值不足16800元时，买方就货品所产生的数字货币要求提币，卖方应提取数字货币至买方指定的合法钱包地址，货品默认不予退还，由卖方进行处置。</h4>
            <h4>（3）如届时币值达到或超过16800元时，买方就货品所产生的数字货币要求提币，卖方应提取数字货币至买方指定的合法钱包地址，货品默认不予退还，由卖方进行处置。</h4>
            <h3>
              6.5、数字货币币值确定方式按照届时“数字货币公允币价*数字货币数量”计算，其中数字货币公允币价定义如下：双方约定，将huobipro.com每日早上8点的数字货币价格，扣除0.2%交易费和0.3%提现费作为当天数字货币公允币价，如huobipro.com出现被盗、不能提币等情况，导致币价出现异常时，卖方同意由买方指定具有代表性的国内或国外交易所，作为数字货币公允币价的来源。</h3>
          </li>
          <li>
            <h2>7、违约责任：</h2>
            <h3>
              7.1、如买方未按合同约定的付款期限履行付款义务，卖方有权以任何方式将货品收回，买方须承担因违约而给卖方造成的经济损失，包括但不限于违约金、收回货品的运费及其他费用等。卖方无需退回货款给买方且买方先前所付订金不予退回。</h3>
            <h3>7.2、若因货品缺货致使卖方不能按本合同交割时，不视为卖方违约。卖方在交割期限后三日内全额退回买方已支付的订金或货款。
            </h3>
          </li>
          <li>
            <h2>8、不可抗力：</h2>
            <p>
              因地震、暴风雨、洪水、水灾、其它自然事件、战争、暴乱、内战、公众骚乱、公众敌对事件等不可抗力事件的发生，导致合同不能全部或部分履行（或适当履行）的，免除相应的违约责任，受影响的一方，应立即将情况通知对方，并在15个工作日提供事件详情以及合同不能履行、或部分不能履行、或需要延期履行的理由的有效证明文件，按不可抗力事件对履行本合同的影响程度，由双方协商决定是否解除合同、部分免除或变更合同责任，或延期履行合同。若受不可抗力事件影响，使本合同主要义务之履行延迟的时间超过180天，则任何一方均有权解除合同而不承担任何后果，也可由双方协商采取补救措施。</p>
          </li>
          <li>
            <h2>9、争议解决：</h2>
            <p>若履行本合同产生的任何争议，双方应通过友好协商解决，协商不成的，双方约定任何一方可通过向签约地法院诉讼解决。</p>
          </li>
          <li>
            <h2>10、其他说明：</h2>
            <h3>10.1、合同附件是本合同不可分割的重要组成部分，与本合同具有同等的法律效力。</h3>
            <h3>10.2、若合同有其他相关补充说明，则可经双方协商一致，签订补充协议，与合同具有同等法律效力。若与本合同中的相应条款发生冲突，则以补充协议条款规定为准。</h3>
          </li>
          <li>
            <h2>11、生效：</h2>
            <p>
              本合同经双方代表签字盖章后即视为生效，本合同一式贰份，买卖双方各执壹份，具有同等效力。若本合同采用电子文本形式在线签署，则经买方通过平台电子合同签署系统在线点击确认后即视为生效，并留存于卖方平台为此设立的专用服务器上备查，甲、乙双方均确认本合同的真实性并认可合同的法律效力。</p>
          </li>
        </ol>
      </ul>
    </div>
    <footer>
      <el-row class="company-info">
        <el-col :span="12">
          <p>卖方：上海挖链科技有限公司</p>
          <p>公司（盖章）签字：</p>
          <p>地址：上海市徐汇区云锦路500号</p>
          <p class="address">绿地汇中心B座12楼</p>
          <p>电话：400-865-6688</p>
          <p>日期：</p>
        </el-col>
        <el-col :span="12">
          <p>买方：</p>
          <p>公司（盖章）签字：</p>
          <p>地址：</p>
          <p>&nbsp;</p>
          <p>电话：</p>
          <p>日期：</p>
        </el-col>
      </el-row>
    </footer>
  </div>
</template>
<script>
  export default {
    data() {
      return {};
    },
    mounted() {

    },
    methods: {}
  };
</script>
<style lang="scss" scoped>
  .sales-contract {
    width: 1200px;
    margin: 0 auto 50px;
    padding-top: 40px;
  }

  h1 {
    font-size: 20px;
    text-align: center;
    margin-bottom: 20px;
  }

  h2 {
    font-size: 14px;
    color: #303137;
    margin-bottom: 10px;
    margin-top: 30px;
  }

  h3 {
    font-size: 14px;
    color: #151515;
    margin-bottom: 10px;
  }

  p, h4 {
    font-size: 14px;
    color: #151515;
    margin-bottom: 10px;
    font-weight: normal;
  }

  table {
    margin: 20px auto;
    width: 100%;
    font-size: 14px;
    color: #151515;
    border-collapse: collapse;
  }

  th, td {
    border: 1px solid #151515;
    padding: 14px;
  }

  .company-info {
    margin-top: 30px;
  }

  .address {
    text-indent: 42px;
  }

</style>
