<template>
  <div class="container">
    <h2>交易条款</h2>
    <p class="declaration">
      “您”、“您的”以及“你们”指任何订购、购买本网站销售产品的人员。“我们”以及“我们的”指上海挖链科技有限公司及其关联方。您在订购产品的同时，有义务遵守以下交易条款。您在本网站下订单之前，请您仔细阅读以下交易条款。如果您不同意遵守该等条款，请不要购买本网站销售产品。</p>
    <h3>1.如何通过本网站订购产品：</h3>
    <p>下订单后，您会收到一封我们发送的确认邮件（“订购确认函”），确认我们已收到订单。</p>
    <p>请注意，这并不意味着我们已经接受/确认您的订单。您的订单应仅视为购买产品的意向书。</p>
    <p>
      所有订单均应以我们接受为准，且我们将通过向您发送确认付款（付款确认）和订单装运（订单已发货）的邮件的方式确认我们已接受该订单。如在我们指定期限内，我们未收到您支付的款项，我们有权取消您的订单。您首次订购产品时需在我们网站创建用户账户，您可随时登陆该账户查看您的订单状态。</p>
    <p>
      只有我们向您发送发货确认书后，您与我们的合同才视为建立。合同仅与发货确认书中确认已发货的产品相关。对您订单中可能存在的任何其它产品的供应，我们不承担任何责任。在接受订单和发货之前，我们保留随时取消订单的权利，且在价格存在明显错误或我们或第三方供应商无存货的情况下，我们也有权撤销已接受的订单。</p>
    <p>请不要通过邮件或Skype或除本网站之外的任何网站向任何声称是我们授权代表的人订购产品。这可能是一个骗局，且您可能永远无法收到订购的产品。在此情形下，我们不承担任何责任，也不提供任何赔偿。</p>

    <h3>2.价格和产品供应：</h3>
    <p>
      网站上的产品价格和供应情况如有变化，恕不另行通知。如发现错误，我们将予以更正。虽然我们会尽最大努力，但网站上的产品仍然存在错误标价的可能。在向您配送产品之前，我们会对价格进行检查，如果发现产品的正确价格低于我们所标注的价格，我们在向您配送产品时，将相应地减少您的付款金额。如果产品的正确价格高于网站上所标注的价格，我们可选择发货前联系您以便取得您的指令，或拒绝订单并告知您订单被拒的情况。如果价格错误能够被您合理识别，即便已经发送了订单确认函或者付款确认函，我们仍有权拒绝按照错误（较低）价格发货，且不承担任何责任。</p>
    <p>网站上的产品以人民币定价及支付，以下是我们接受付款的唯一官方账户，如果您向该账户以外的其它账户汇款，我们将无法收到付款：</p>
    <p>开户行：平安银行上海新天地支行</p>
    <p>户名：上海挖链科技有限公司</p>
    <p>账号：15000091573845</p>
    <p>
      有时，您可能在购物车中订购了某种产品并提交订单进行处理，但是之后由于产品缺货您的订单会被取消。您认可产品可能销售得很快，虽然提交订单的时间很短，但是产品仍有售空的可能。您同意即便收到我们的订单确认函后，订单仍可取消，且无任何处罚。极少数情况下，您可能会收到我们的发货确认书，但是之后由于我们或第三方供应商库存缺货，您同意我们可以因缺货撤销已经接受的订单且不受任何处罚。</p>
    <p>所有购买都是最终购买。在极少数情况下，我们可自行决定做例外处理。该种例外在仅此一次的基础上做出，且不能以任何方式使我们在随后的案例中负有义务。</p>

    <h3>3.网站用户的税款和关税：</h3>
    <p>您认可我们向中华人民共和国（仅为本《交易条款》之目的，不包括香港、澳门特别行政区和台湾）境内销售的所有产品价格及所开具的发票中均包含增值税。</p>

    <h3>4.产品交付：</h3>
    <p>
      订单被足额付款后，我们将安排发货。物流服务由第三方提供，如德邦、顺丰、顺达或圆通。请注意，除非网站另有明确说明，否则产品的零售价格不包括运费，交货时间仅为预计时间。第三方服务商不对交货时间做任何保证，且不应依赖该等服务。</p>
    <p>我们将产品交付承运人后，即完成交付，产品所有权移转至您，其毁损、灭失风险均由您承担。</p>

    <h3>5.无法投递的包裹：</h3>
    <p>某些情况下，有些包裹会因无法投递而退给我们。我们将重新安排发送您所订购的产品，但是因此发生的额外费应由您承担。</p>
    <p>地址不正确。如果包裹的地址不正确或过时，运输服务商或非指定收件人会将包裹退给我们。请您在下订单时认真检查收货地址。</p>
    <p>地址格式不正确。如果我们的系统无法正确识别所输入的地址，包裹可能会被分派至错误的运输服务商，从而无法送达至正确地址。</p>
    <p>无法交货。大多数运输服务商对未能送出的包裹都会尝试多次递送。如果他们无法成功送出您的包裹，则会将其退给我们。</p>
    <p>收件人拒收。如果礼品的收件人不知道有礼物发送给她/他，会认为包裹发错而拒收。</p>
    <p>非法地址。极少数情况下，地址可能在包裹运输期间变为非法地址。如果发生这种情况，运输服务商会将包裹退回给我们。</p>
    <p>运输过程中损坏。如果包裹在运输途中发生损坏，运输服务商可能不会尝试交货，而是将包裹退回给我们。</p>
    <p>如果包裹无法运输至您订单中所提供的地址，可能会发生额外的运输费用。</p>

    <h3>6.包裹丢失：</h3>
    <p>在运输状态满足下列至少一个条件时，您有权向我们提起调查流程：1） 包裹21天内没有物流跟踪记录；或者2）物流跟踪记录显示的最后一次更新时间超过10天。</p>
    <p>由于物流部门处理该问题所需的时间，自您提出要求起至调查流程完成可能需要6周时间。在调查期间，您与我们之间的沟通尤为重要，以保证物流状态信息为最新的。如果在此期内未找到或收到包裹，我们将重新发送产品。</p>

    <h3>7.退货：</h3>
    <p>产品的退货政策列明在产品页面。</p>

    <h3>8.瑕疵产品及产品问题导致的维修：</h3>
    <p>
      在质保期内，如果产品缺陷是因为产品本身的问题（不包括质保限制规定下的瑕疵）造成的，您可以按照质保规定自费退回商品进行维修，但应在发现产品瑕疵后的合理时间内退回产品。我们收到原产品并进过相关服务处理流程后，将重新发回经过维修的产品。您需要自己承担产品退回的运费。</p>

    <h3>9.质保期：</h3>
    <p>我们保证在质保期内，按照《用户手册》及本保证中定义的正常使用，本产品、其组件在材料及工艺上无缺陷。产品的质保期在产品页面上有明确规定，自发货之日起算。产品发货日期以订单中列明的发货日期为准。</p>
    <p>我们进一步保证在更换之日起三十（30）日内或在质保期的剩余时间内（以时间较长者为准），更换产品和/或其部件或组件在材料及工艺上无缺陷。</p>

    <h3>10.保护：</h3>
    <p>本保证不可转让且仅适用于原始购买者。本保证明确排除任何非从我们或我们授权的供应商和/或其关联公司全新购买的产品。本保证也不适用于通过购买非由我们出售的产品而获得的产品。</p>
    <p>
      我们对任何由本产品或购买本产品而引起和/或发生的意外或间接损害概不负责。我们承担的责任仅以产品本身为限。我们对因第三方或客户的利润损失而引起的任何损失或费用，或任何其他间接损失或费用（无论其如何发生）概不负责。我们保留对设计、固件或制造进行更改或改进的权利，而对先前制造和/或出售的产品概不承担任何更改或改进的义务。</p>

    <h3>11.保证限制：</h3>
    <p>我们对出于特定目的而预先安装的软件及其质量、性能、功能性或兼容性不提供保证。我们不保证软件包含的功能会满足特定要求或软件的运行会不中断或无差错。产品按其现状出售。</p>
    <p>在适用法律允许的范围内，本保证不适用于下列情况：</p>
    <p>(1)正常磨损；</p>
    <p>(2)因意外、滥用、误用、疏忽、操作不当或安装不当而引起的损害；</p>
    <p>(3)因不当的物理环境或电压引起的产品损害或损失，包括但不限于潮湿、腐蚀环境、环境温度超出产品说明中要求的温度范围、散热器无法正常工作、航运或异常工作条件、高电压冲击、直流电或交流电质量引起的产品损害或损失；</p>
    <p>(4)因自然灾害引起的产品损害或损失，包括但不限于洪水、暴风雨、火灾及地震；</p>
    <p>(5)因操作失误或不遵守附带文件中的使用说明而引起的损害；</p>
    <p>(6)使用非由我们、我们的关联公司或我们授权的机构生产的产品或部件；</p>
    <p>(7)非由我们、我们的关联公司或我们授权的服务机构进行的更改，包括但不限于在未经我们书面授权情况下，客户拆卸、更改产品；</p>
    <p>(8)其原始软件非由我们、我们的关联公司或我们授权的服务机构进行更换或更改的产品；</p>
    <p>(9)假冒产品；</p>
    <p>(10)因当前和/或未来版本的操作系统、软件和/或硬件的互操作性而引起的数据损害或损失；</p>
    <p>(11)因不为产品文件所建议和/或允许的不当使用或行为而引起的数据损害或损失；</p>
    <p>(12)非由我们提供的产品使用信息而引起的产品失效；</p>
    <p>(13)运算板或芯片被压坏、摔坏、烧毁。</p>


    <h3>12.质保服务：</h3>
    <p>
      在质保期内，我们将承担修理或基于我们的全权判断用相同或相似（如：更新的）版本的产品更换缺陷产品的责任，除非该种缺陷是由保证限制中的情况所导致。在产品修理时，为完成修理及恢复产品的正常运行所必要的部件、组件及劳动免费，但前提是产品被返还时未受其他损害，且已向我们的服务处理机构预付运费（包括保费）。
    </p>
    <p> 因向我们的服务处理机构退还产品或部件、组件而引起的费用由该产品所有者承担。如果产品或部件、组件的退还未保险，您将承担在运输期间遭受损失或损害的一切风险。</p>

    <h3>13.反对歧视：</h3>
    <p>我们反对任何年龄、种族、国籍、性别、性取向和宗教方面的歧视。</p>

    <h3>14.版权：</h3>
    <p>
      您承认本网站内的信息、数据、软件、图片、视频、字体、图形、音乐、声音、以及其它资料（统称为“内容”）皆受到版权、商标权、商业秘密、数据库权和/或其它专利权的保护，并受到现有和未来开发的所有形式、媒体和技术的保护。所有内容作为统一的作品受到版权的保护，我们拥有上述内容的版权和/或数据库权利，或者此类内容的选择、协调、安排、演示和增添权利。您不得修改、删除、补充、添加、发布、传播、参与转让或销售上述内容，或从中创建衍生作品或以任何方式利用全部或部分内容。如果没有特定限制，您可以复制您所选定的内容，但仅供您个人使用，并需遵守内容中所包含的任何注意事项，例如：所有版权声明、商标、图例或其他所有权声明。未经版权或其它权利所有者的许可，您不得以任何方式上传、发布、复制或分发受版权或其他所有权保护的内容。</p>
    <p>
      网站上的任何内容不应被视为通过暗示或基于禁止反言原则允许或授权利用分幅技术、深度链接或其它方式使用网站或网站上任何信息，除非：（a）本《交易条款》明确许可；或（b）事先经我们书面许可或拥有网站上信息的版权和商标权的第三方的书面许可。</p>

    <h3>15.网站访问：</h3>
    <p>
      未经我们明确书面同意，您不得下载（页面缓存除外）或修改网站或其任何部分。这包括：禁止转售或出于商业目的使用本网站或其内容；禁止任何产品列表、描述或价格的收集和使用；禁止任何衍生品的使用或修改本网站或其内容；禁止下载或复制账户信息，以期为其他商家牟利；以及禁止使用数据挖掘、屏幕抓取、机器人或类似数据收集和提取工具。未经我们明确书面同意，不得复制、出售、转售、访问或出于任何商业目的利用本网站或本网站的任何部分。您不得使用分幅技术附入网站、通过本网站提供的产品或其关联公司的任何商标、标识或其他专有信息（包括图像、文本、页面布局或形式）。未经我们明确书面同意，不得利用任何元标签或任何其他“隐藏文本”的方式使用我们的名称或商标。</p>

    <h3>16.用户账户/区域：</h3>
    <p>
      如您使用本网站，应对自己的用户信息/账户名和相应的密码负责保密，并限制对您的计算机以及用于创建账户的电子邮件的访问和读取。您同意对您账户内发生的或与其相关的活动承担全部责任。我们保留拒绝服务、终止账户以及在网站用户区对您所提交的内容进行删除或编辑的权利。</p>

    <h3>17.网站链接：</h3>
    <p>
      我们对任何互为友情链接的网站内容或与我们或本网站相关联的任何公告牌内容不承担任何责任。这些链接仅为您的方便而提供，且访问这些网站的风险由您自行承担。除非特别说明，否则本网站关联的任何其它网站都与我们无关，且这些网站的内容不受我们控制。此外，与任何其它网站的链接并不意味着我们对这些网站的内容表示认同或承担任何责任。</p>
    <p>在任何情况下，我们所提供的第三方或第三方的产品或服务的参考信息并不意味着我们认可第三方或任何产品或服务，或对此承担任何责任。</p>

    <h3>18.免责条款和责任限制：</h3>
    <p>
      本网站是在“现有状况”以及“可用”基础上提供的。我们及其关联公司不保证使用的连续性和内容的准确性，也不保证网站所提供内容、或网站上所销售产品或服务的准确性、一致性和完整性。此外，我们明确拒绝任何明示或暗示的保证，包括但不限于所有权的保证，隐含的适销性保证或适用于特定目的的保证。我们或其关联公司提供的任何口头建议或书面信息均不构成任何保证。您明确同意，登陆、查看、浏览、访问或使用本网站的风险由您自己承担。</p>
    <p>
      在任何情况下，我们或关联公司均不对因使用或无法使用本网站而导致的任何直接、间接、偶然、特殊或后果性损害承担责任，包括但不限于用户对任何网站信息的依赖，或由于错误、遗漏、中断、删除文件或电子邮件、错误、缺陷、病毒、操作或传输延迟或任何执行失败，无论是否由于不可抗力、通信故障、盗窃、破坏或未经授权访问我们记录、程序或服务。上述责任限制适用于法律诉讼，包括但不限于合同、疏忽或其他侵权行为或股权行为，即使我们的授权代表已被告知或应该知道此类损害的可能性。您特此确认本规定适用于通过本网站提供的所有内容、商品和服务。</p>
    <p>除非特别说明，否则我们网站上的产品仅适于个人使用，而非商业用途。如您购买产品用于商业或业务目的，您应承担由此可能产生的相关风险。</p>

    <h3>19.在线行为：</h3>
    <p>
      您同意仅出于合法目的使用本网站。禁止在本网站发布或通过本网站传输任何非法、有害、威胁性、侮辱、骚扰、诽谤、庸俗、下流、露骨、亵渎性、仇视、种族性或其它不合理言论，包括但不限于任何鼓励欺诈行为或鼓励犯罪活动，或鼓励导致民事责任或其它违反现相关中国或国际法律的行为。您同意不作出或宣扬骚扰行为，或者不鼓励任何侮辱他人或实体的行为。</p>
    <p>
      禁止通过本网站发送或以其他方式发布未经授权的商业通信（如垃圾邮件）。如果我们收到或怀疑您涉嫌提供侵权、诽谤、损害、非法或令人反感的用户内容，我们可以进行调查（但不承担任何责任），并有权决定是否从网站上删除或要求删除此类用户内容。我们可能披露任何用户内容或任何类型的电子通信（i）以满足任何法律，法规或政府的要求；（ii）对网站经营而言是必需或恰当的；或（iii）保护我们及其关联公司、我们的用户和客户和/或您。</p>
    <p>
      我们有权禁止我们认为非法或损害您、本网站、网站用户、我们的客户或我们或第三方的任何权利的行为、通信或内容。尽管如此，我们和其关联公司都不确保问题内容发布后，能够立即删除。因此我们和其关联公司对于本网站上的行为、沟通或内容方面的任何作为或不作为不承担任何责任。</p>

    <h3>20.发布在本网站上的用户内容：</h3>
    <p>
      对于您在本网站上发送、传输或上传的任何信息，例如电子邮件地址、送货联系人或其他信息或数据（统称为“用户内容”），您同意授予我们以及我们承包商和业务伙伴独家的、可转让的使用、复制、数字存储和分发该用户内容的权利，并可以在其基础上准备派生作品或整合进入其它作品中。</p>
    <p>
      您同意不发布、上传或传输侵犯任何第三方的知识产权或所有权的任何用户内容，包括：任何一方的任何知识产权，特别是不属于您的比特币地址或者您非法获得访问权的比特币地址，如通过钱包窃取病毒或违反原始所有人权利、版权、专利、商标、商业秘密、公开或隐私权利的任何其它行为，例如：未经本人同意而使用其收货联系方式或电子邮件地址。您了解并同意，我们有权因任何理由或不需任何理由删除任何用户内容，包括但不限于（i）违反本《交易条款》的，（ii）攻击性或非法的，或（iii）可能损害、侵犯或威胁任何用户和/或任何其他个人或实体的权利。</p>

    <h3>21.同意接收我们发送的通知：</h3>
    <p>
      您同意我们有权向您发送与本网站相关的某些信息。我们将以电子版的形式向您在创建帐户时所登记的邮件地址发送信息。您有权根据适用法律禁止信息的发送，但如果您这样做，我们可能会取消您在本网站所拥有的权利。对于通过电子邮件提供给您的通知，电子邮件的发送日期即被视为接收日。只要您访问和使用本网站，即表示您同意您将会准备接收此类通知所需的软件和硬件。如果您不同意以电子方式接收任何通知，则表示您同意停止使用或访问本网站。</p>

    <h3>22.停止使用：</h3>
    <p>如果我们认为您的任何行为违反了任何使用法律、本《交易条款》或损害了其它用户、关联公司或我们的利益，在未通知情况下，我们可以终止或暂停您访问网站全部或部分的权利。此外，我们保留拒绝任何客户订单的权利。</p>

    <h3>23.未成年人使用：</h3>
    <p>我们要求所有购买产品者（i）不是未成年人，且可以合法地签订具有约束力的合同（通常指18岁或以上的人，取决于您居住的地方），或（ii）未成年人经过父母或监护人的准许在网站上购买物品。</p>

    <h3>24.其他：</h3>
    <p>如本《交易条款》与您与我们签署的合同有任何不一致之处，则以您与我们签署的合同为准。</p>

    <h3>25.不可抗力：</h3>
    <p>
      如因超出我们合理控制的任何原因，包括地震、洪灾等自然灾害、劳资纠纷或其他行业波动、电力中断、能源中断、通讯中断、政府行为或命令、恐怖主义行为、战争等，造成我们延迟履行或未能履行任何义务，我们不对该等延迟履行或未能履行承担任何责任。</p>

    <h3>26.适用法律：</h3>
    <p>您同意本《交易条款》以及您与我们之间可能引发的任何纠纷受中华人民共和国法律的管辖，不考虑法律冲突原则。</p>

    <h3>27.纠纷：</h3>
    <p>任何与您访问网站、本《交易条款》、您通过本网站发布广告或招揽生意的行为或与您所购买的产品相关的纠纷均应提交福建湛华智能科技有限公司所在地有管辖权的人民法院解决。</p>
    <p>如果您以任何方式侵害或威胁侵害我们或其关联公司的知识产权，我们可能会选择通过法庭发布禁令或寻求其他适当救济。您同意此类法庭拥有排他管辖权和裁决。</p>
  </div>
</template>

<script>
  export default {
    data() {
      return {};
    }
  };
</script>

<style scoped>
  .container {
    width: 1200px;
    margin: 0 auto 50px;
    padding-top: 40px;
  }

  h2 {
    font-size: 20px;
    text-align: center;
    margin-bottom: 20px;
  }

  h3 {
    font-size: 14px;
    color: #303137;
    margin-bottom: 10px;
    margin-top: 30px;
  }

  p {
    font-size: 14px;
    color: #151515;
  }

  h3 + p {
    margin-bottom: 30px;
    line-height: 30px;
  }
</style>
